
&После("УстановитьОтборСписка")
Процедура АБ_УстановитьОтборСписка(Список, ПараметрыОтбора)
	//++dar 01.06.26 (330575)
	// ответственный 
	Ответственный = ПараметрыОтбора.Получить("Ответственный");
	Если Ответственный <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Ответственный) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Ответственный");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
				"Ответственный",
				Ответственный);
		КонецЕсли;
	КонецЕсли;
	//--dar 01.06.26 (330575)
КонецПроцедуры
