
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.СрокХраненияЗавершенныхЗаданий.Доступность = НаборКонстант.ХранитьЗавершенныеЗадания;
	
// ХОЛД Начало
	РаботаСФормамиХолдинг.ИзменитьФормуНастроекПрограммы(ЭтотОбъект);
// ХОЛД Конец

КонецПроцедуры

&НаКлиенте
Процедура ХранитьЗавершенныеЗаданияПриИзменении(Элемент)
	
	Элементы.СрокХраненияЗавершенныхЗаданий.Доступность = НаборКонстант.ХранитьЗавершенныеЗадания;
	Если Не НаборКонстант.ХранитьЗавершенныеЗадания Тогда
		НаборКонстант.СрокХраненияЗавершенныхЗаданий = 0;
	КонецЕсли;	
	
КонецПроцедуры


