
&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++dar 18.03.26 (317077)
	ТипДоговораСвойства = Новый Структура;
	ТипДоговораСвойства.Вставить("Ширина", 25);
	ТипДоговораСвойства.Вставить("АвтоМаксимальнаяШирина", Истина);
	ТипДоговораСвойства.Вставить("АвтоМаксимальнаяВысота", Истина);
	ТипДоговораСвойства.Вставить("РастягиватьПоГоризонтали", Ложь);
	ТипДоговораСвойства.Вставить("ВысотаЗаголовка", 1);
	ТипДоговораСвойства.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Лево);
	
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ТипДоговора", Элементы.ГруппаДополнительныеНастройки, Истина, , , "Цель договора для НДС", ТипДоговораСвойства);
	//--dar 18.03.26 (317077)
	
	//++dar 22.04.26 (324174)
    УВМ_РаботаСФормами.СоздатьРеквизит(ЭтотОбъект, "УВМ_СписокВариантыДоговоров", Новый ОписаниеТипов("СписокЗначений"));
	СобытияСписокВариантыДоговоров = Новый Структура("ПриИзменении", "УВМ_СписокВариантыДоговоровПриИзменении");
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_СписокВариантыДоговоров", Элементы.ГруппаДополнительныеНастройки, "УВМ_СписокВариантыДоговоров", , , 
									"Доступные типы договоров", , СобытияСписокВариантыДоговоров);
	ЭтаФорма.УВМ_СписокВариантыДоговоров.ТипЗначения = УВМ_РаботаСФормами.ОписаниеТипаПеречисление("УВМ_ВариантыДоговоров");
	Для Каждого ТекущийВариантДоговора Из Объект.УВМ_ВариантыДоговоров Цикл
		ЭтотОбъект.УВМ_СписокВариантыДоговоров.Добавить(ТекущийВариантДоговора.ВариантДоговора);
	КонецЦикла;
	//--dar 22.04.26 (324174)
	
	//++dar 04.05.26 (326149)
	СвойстваПоля = Новый Структура;
	СвойстваПоля.Вставить("РастягиватьПоГоризонтали", Ложь);
	СвойстваПоля.Вставить("АвтоМаксимальнаяШирина", Истина);
	СвойстваПоля.Вставить("АвтоМаксимальнаяВысота", Истина);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ТипКонтрагента", Элементы.Право, Истина, , , , СвойстваПоля);
	//--dar 04.05.26 (326149)
	
	//++dar 01.06.26 (330575)
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_СкрыватьПолеТипНеустойки", Элементы.ГруппаДополнительныеНастройки, Истина);
	//--dar 01.06.26 (330575)

	//++dar 23.06.26 (333905)
	СвойстваГруппыФорма = Новый Структура("Группировка",
	ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	УВМ_ГруппаФорма = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтотОбъект,
																		"УВМ_ГруппаФорма", Элементы.ГруппаДополнительныеНастройки,
																		Элементы.ФормаДокумента, , , , СвойстваГруппыФорма);
	
	Элементы.Переместить(Элементы.ФормаДокумента, УВМ_ГруппаФорма);
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_Скрыть", УВМ_ГруппаФорма, "Объект.УВМ_Скрыть", "Скрыть", 1);
	//--dar 23.06.26 (333905)

КонецПроцедуры

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура АБ_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//++dar 22.04.26 (324174)
	ТекущийОбъект.УВМ_ВариантыДоговоров.Очистить();
	Для Каждого ТекущийВариант Из ЭтотОбъект.УВМ_СписокВариантыДоговоров Цикл
		НовСтр = ТекущийОбъект.УВМ_ВариантыДоговоров.Добавить();
		НовСтр.ВариантДоговора = ТекущийВариант.Значение;
	КонецЦикла;
	//--dar 22.04.26 (324174)
КонецПроцедуры

//++dar 22.04.26 (324174)
&НаКлиенте
Процедура УВМ_СписокВариантыДоговоровПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
//--dar 22.04.26 (324174)
