#Область ПрограммныйИнтерфейс

#Область ОбщегоНазначения

// Возвращает номер версии протокола обмена с сервисом распознавания.
//
// Возвращаемое значение:
//  Строка - номер версии протокола обмена .
//
Функция ВерсияПротоколаОбмена() Экспорт
	
	Возврат "1.2";
	
КонецФункции

// Возвращает идентификатор подсистемы распознавания документов.
// 
// Возвращаемое значение:
//  Строка - Идентификатор подсистемы
//
Функция ИдентификаторПодсистемы() Экспорт
	
	Возврат "БиблиотекаРаспознаванияДокументов";
	
КонецФункции

// Максимальный размер очереди документов на распознавании.
// 
// Возвращаемое значение:
//  Число - Максимальный размер очереди документов на распознавании
Функция МаксимальныйРазмерОчередиДокументовНаРаспознавании() Экспорт
	
	Возврат 20;
	
КонецФункции

#КонецОбласти

#Область СервисРаспознавания

// Выполняет авторизацию по тикету ИТС.
Процедура ВыполнитьАвторизациюПоТикетуИТС() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ПараметрыАвторизации = ТекущиеПараметрыАвторизации();
	Если АвторизацияВыполнена(ПараметрыАвторизации) Тогда
		Возврат;
	КонецЕсли;

	ВладелецТикета = "DocumentRecognition";
	РезультатПолученияТикета = РаспознаваниеЛокализация.РезультатПолученияТикета(ВладелецТикета);
	
	Если ПустаяСтрока(РезультатПолученияТикета.Тикет) Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось получить тикет авторизации с Портала 1С:ИТС
			           |по причине:
			           |%1'", ОбщегоНазначения.КодОсновногоЯзыка()), РезультатПолученияТикета.СообщениеОбОшибке);
			           
		Если РаботаВМоделиСервиса.РазделениеВключено() Тогда
			ВызватьИсключение ТекстСообщения;
		Иначе
			
			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение, , , ТекстСообщения);
				
		КонецЕсли;
	КонецЕсли;
	
	Если РезультатПолученияТикета.КодОшибки = "НеверныйЛогинИлиПароль"
		Или РезультатПолученияТикета.КодОшибки = "ПревышеноКоличествоПопыток" Тогда
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не удалось получить тикет авторизации с Портала 1С:ИТС по причине: %1
				|Перейдите в настройки интернет-поддержки и измените данные авторизации.'", 
					ОбщегоНазначения.КодОсновногоЯзыка()), РезультатПолученияТикета.СообщениеОбОшибке);
		
	КонецЕсли;
	
	Область = ОбластьАвторизации();
	Область.ТипАутентификации = "ПоТикетуИТС";

	Если ПустаяСтрока(РезультатПолученияТикета.КодОшибки) Тогда
		
		РезультатАвторизации = РаспознаваниеДокументовКоннекторСлужебный.ВыполнитьАвторизациюПоТикетуИТС(
			РезультатПолученияТикета.Тикет,
			Область,
			ПараметрыАвторизации.ИдентификаторИБ);

	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		ДанныеАутентификации = РаспознаваниеЛокализация.ДанныеАутентификацииПользователяИнтернетПоддержки();
		Если ДанныеАутентификации <> Неопределено Тогда
			Логин  = ДанныеАутентификации.Логин;
			Пароль = ДанныеАутентификации.Пароль;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
		РезультатАвторизации = РаспознаваниеДокументовКоннекторСлужебный.ВыполнитьАвторизациюПоЛогинуПаролюИТС(
			Логин,
			Пароль,
			Область,
			ПараметрыАвторизации.ИдентификаторИБ);
		
	КонецЕсли;
	
	ПараметрыАвторизации.ИдентификаторИБ = РезультатАвторизации.ИдентификаторИБ;
	ПараметрыАвторизации.ТокенДоступа = РезультатАвторизации.ТокенДоступа;
	ПараметрыАвторизации.Состояние = РезультатАвторизации.Состояние;
	ПараметрыАвторизации.ТипАутентификации = "ПоТикетуИТС";
	ПараметрыАвторизации.Логин = "";

	ЗаписатьПараметрыАвторизации(ПараметрыАвторизации);

	УстановитьПривилегированныйРежим(Ложь);

	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Удаляет данные авторизации.
// 
// Параметры:
//  УдалитьИдентификаторИБ - Булево - Удалить идентификатор ИБ
//
Процедура УдалитьДанныеАвторизации(УдалитьИдентификаторИБ = Ложь) Экспорт
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		ВызватьИсключение НСтр("ru = 'Удалять данные авторизации доступно только Администратору.'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыАвторизации = ТекущиеПараметрыАвторизации();
	
	ПараметрыАвторизации.ТокенДоступа = "";
	ПараметрыАвторизации.ТипАутентификации = "НеВыполнена";
	ПараметрыАвторизации.Состояние = "Ожидает";
	Если УдалитьИдентификаторИБ Тогда
		ПараметрыАвторизации.ИдентификаторИБ = "";
	КонецЕсли;
	ПараметрыАвторизации.Логин = "";
	
	ЗаписатьПараметрыАвторизации(ПараметрыАвторизации);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Проверяет подключение к сервису распознавания.
// 
// Параметры:
//  ПытатьсяПодключитьсяПриПроверке - Булево - Пытаться подключиться при проверке
//  ВыбрасыватьИсключение - Булево - Выбрасывать исключение
// 
// Возвращаемое значение:
//  Булево - Подключено к сервису распознавания
//
Функция ПодключеноКСервисуРаспознавания(ПытатьсяПодключитьсяПриПроверке = Истина, ВыбрасыватьИсключение = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыАвторизации = ТекущиеПараметрыАвторизации();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если АвторизацияВыполнена(ПараметрыАвторизации) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не ПытатьсяПодключитьсяПриПроверке Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если РаспознаваниеЛокализация.ВыполненаАвторизацияЧерезИТС() Тогда
		Попытка
			ВыполнитьАвторизациюПоТикетуИТС();
		Исключение
			Если ВыбрасыватьИсключение Тогда
				ВызватьИсключение;
			Иначе
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Попытка автоматической авторизации по тикету с Портала 1С:ИТС не удалось
					           |по причине:
					           |%1'", ОбщегоНазначения.КодОсновногоЯзыка()),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(
					СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение, , , ТекстОшибки);
				
				Возврат Ложь;
			КонецЕсли;
		КонецПопытки;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Проверяет авторизацию аккаунта.
// 
// Возвращаемое значение:
//  Булево - Аккаунт авторизован
//
Функция АккаунтАвторизован() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыАвторизации = ТекущиеПараметрыАвторизации();
	Возврат АвторизацияВыполнена(ПараметрыАвторизации);
	
КонецФункции

// Проверяет активацию аккаунта.
// 
// Параметры:
//  ВыбрасыватьИсключение - Булево - Выбрасывать исключение
// 
// Возвращаемое значение:
//  Булево - Аккаунт активирован
//
Функция АккаунтАктивирован(ВыбрасыватьИсключение = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыАвторизации = ТекущиеПараметрыАвторизации();
	
	Если Не АвторизацияВыполнена(ПараметрыАвторизации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если АктивацияВыполнена(ПараметрыАвторизации) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Попытка
		Результат = РаспознаваниеДокументовКоннекторСлужебный.СостояниеАктивацииУчетнойЗаписи();
		Если Результат.Состояние = "Активирован" Тогда
			ПараметрыАвторизации.Состояние = Результат.Состояние;
			ЗаписатьПараметрыАвторизации(ПараметрыАвторизации);
		КонецЕсли;
	Исключение
		Если ВыбрасыватьИсключение Тогда
			ВызватьИсключение;
		Иначе
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Попытка проверки активации аккаунта Портала 1С:ИТС не удалось
				           |по причине:
				           |%1'", ОбщегоНазначения.КодОсновногоЯзыка()),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение, , ,
				ТекстОшибки);
			
			Возврат Ложь;
		КонецЕсли;
	КонецПопытки;
	
	Возврат Результат.Состояние = "Активирован";
	
КонецФункции

// Для использования требуется привилегированный режим.
// 
// Возвращаемое значение:
//  Структура - Текущие параметры авторизации:
//  * ИдентификаторИБ - Строка 
//  * ТокенДоступа - Строка 
//  * Состояние - Строка 
//  * ТипАутентификации - Строка 
//  * Логин - Строка 
//
Функция ТекущиеПараметрыАвторизации() Экспорт
	
	ДанныеВБезопасномХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ИдентификаторПодсистемы(),
		"ИдентификаторИБ, ТокенДоступа, ТипАутентификации, Логин, Состояние");
	
	Если ДанныеВБезопасномХранилище.ИдентификаторИБ <> Неопределено
		И ДанныеВБезопасномХранилище.ТокенДоступа <> Неопределено
		И ДанныеВБезопасномХранилище.ТипАутентификации <> Неопределено Тогда
		
		Если ДанныеВБезопасномХранилище.Состояние = Неопределено Тогда
			ДанныеВБезопасномХранилище.Состояние = "Активирован";
		КонецЕсли;
		
		//@skip-check constructor-function-return-section
		Возврат ДанныеВБезопасномХранилище;
	КонецЕсли;
	
	Возврат НовыеПараметрыАвторизации();
	
КонецФункции

// Функциональная опция ИспользоватьСервисРаспознаванияДокументовДляЗаполненияКарточек включена,
// информационная база зарегистрирована в сервисе распознавания документов,
// активация учетной записи выполнена
//
// Возвращаемое значение:
//  Булево
//
Функция ИспользованиеДоступно() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСервисРаспознаванияДокументовДляЗаполненияКарточек") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыАвторизации = ТекущиеПараметрыАвторизации();
	
	Если Не АвторизацияВыполнена(ПараметрыАвторизации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не АктивацияВыполнена(ПараметрыАвторизации) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

Функция ОтправитьОбратнуюСвязьRecognitionResult(Знач Результат, Знач ИдентификаторРезультата) Экспорт
	
	Пакет = Новый Структура("recognition_result", Результат);
	Возврат РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(ИдентификаторРезультата, Пакет);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаспознаваниеДокументов

Процедура ВыполнитьОбменССервисомРаспознаванияДокументов() Экспорт
	
	ФайлыДляОбработки = ПолучитьФайлыДокументовДляРаспознавания();
	
	Для Каждого ПараметрыФайла Из ФайлыДляОбработки.Выгрузка Цикл
		
		Попытка
			
			ВыполнитьВыгрузкуФайлаВСервисРаспознаванияДокументов(ПараметрыФайла);
			
		Исключение
			
			ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Не удалось выгрузить файл в сервис распознавания: %1'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеОшибки());
				
			РегистрыСведений.ФайлыДокументовНаРаспознавании.ЗафиксироватьОшибкуПриРаспознавании(ПараметрыФайла.Файл, 
				ОписаниеОшибки);
				
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого ПараметрыФайла Из ФайлыДляОбработки.Загрузка Цикл
		
		Попытка
			
			ВыполнитьЗагрузкуРезультатаРаспознавания(ПараметрыФайла);
			
		Исключение
			
			ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Не удалось загрузить результат распознавания: %1'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеОшибки());
				
			РегистрыСведений.ФайлыДокументовНаРаспознавании.ЗафиксироватьОшибкуПриРаспознавании(ПараметрыФайла.Файл, 
				ОписаниеОшибки);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Выполнить выгрузку файла в сервис распознавания документов.
// 
// Параметры:
//  ПараметрыФайла - СтрокаТаблицыЗначений - Параметры файла
Процедура ВыполнитьВыгрузкуФайлаВСервисРаспознаванияДокументов(Знач ПараметрыФайла)
	
	Если ПустаяСтрока(ПараметрыФайла.ИдентификаторЗадания) Тогда
		
		ИменаФайловДляРаспознавания = Новый Массив;
		ДатаСоздания = ТекущаяУниверсальнаяДата();
		ИменаФайловДляРаспознавания.Добавить(ПараметрыФайла.Файл.Наименование + "." + ПараметрыФайла.Файл.Расширение);
		ИдентификаторЗадания = РаспознаваниеДокументовSDK.СоздатьЗаданиеРаспознавания(ИменаФайловДляРаспознавания, 
			ДатаСоздания);
			
	Иначе
		
		ИдентификаторЗадания = ПараметрыФайла.ИдентификаторЗадания;
		
	КонецЕсли;
	
	Результат = РаспознаваниеДокументовSDK.ПолучитьСостояниеОбработкиЗадания(ИдентификаторЗадания);
	
	Если Результат.ОбработкаЗавершена Или Результат.АдресаЗагрузкиФайлов.Количество() = 0 Тогда
		
		ОписаниеОшибки = НСтр("ru = 'Произошла ошибка при создании задания.'", ОбщегоНазначения.КодОсновногоЯзыка());
		РегистрыСведений.ФайлыДокументовНаРаспознавании.ИзменитьСостояние(ПараметрыФайла.Файл, "", "", ОписаниеОшибки); 
		Возврат;
		
	КонецЕсли;
	
	АдресЗагрузкиФайла = Результат.АдресаЗагрузкиФайлов[0];
		
		ИдентификаторФайла = РаспознаваниеДокументовSDK.ЗагрузкаФайлаПоАдресу(АдресЗагрузкиФайла,
			РаботаСФайлами.ДвоичныеДанныеФайла(ПараметрыФайла.Файл));
			
	РегистрыСведений.ФайлыДокументовНаРаспознавании.ИзменитьСостояние(ПараметрыФайла.Файл, ИдентификаторФайла, 
		ИдентификаторЗадания); 
	
КонецПроцедуры

Процедура ВыполнитьЗагрузкуРезультатаРаспознавания(Знач ПараметрыФайла)
			
		СостояниеЗадания = РаспознаваниеДокументовSDK.ПолучитьСостояниеОбработкиЗадания(ПараметрыФайла.ИдентификаторЗадания);
		
		Если СостояниеЗадания.РаспознанныеДокументы.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ИдентификаторЗадания = ПараметрыФайла.ИдентификаторЗадания;
		Файл = ПараметрыФайла.Файл;
		
		Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Файл, "Владелец");
		ДокументСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ВладелецФайла");
		
		Для Каждого РаспознанныйДокумент Из СостояниеЗадания.РаспознанныеДокументы Цикл
			
			ИдентификаторДокумента = РаспознанныйДокумент.ИдентификаторДокумента;
			
			РезультатУжеОбработан = РегистрыСведений.РезультатыРаспознаванияДокументов.РезультатУжеОбработан(
				ИдентификаторДокумента);
			
			Если РезультатУжеОбработан Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("ИдентификаторДокумента", РаспознанныйДокумент.ИдентификаторДокумента);
			ПараметрыЗаполнения.Вставить("ИдентификаторЗадания", ИдентификаторЗадания);
			ПараметрыЗаполнения.Вставить("Документ", ДокументСсылка);
			ПараметрыЗаполнения.Вставить("Файл", Файл);
			
			ЗаполнениеДокумента(ПараметрыЗаполнения);
			
			Прервать; //в текущей реализации на каждый файл один документ
			
		КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнениеДокумента(Знач ПараметрыЗаполнения)
	
	ДокументСсылка = ПараметрыЗаполнения.Документ;
	СвойстваРаспознанногоДокумента = ПолучитьРезультатПоИдентификатору(ПараметрыЗаполнения.ИдентификаторДокумента);
	
	Если СвойстваРаспознанногоДокумента.ОписаниеОшибки <> "" Тогда
		
		РегистрыСведений.ФайлыДокументовНаРаспознавании.ЗафиксироватьОшибкуПриРаспознавании(ПараметрыЗаполнения.Файл, 
			СвойстваРаспознанногоДокумента.ОписаниеОшибки);
		Возврат;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
	
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить(Метаданные.Справочники.ДокументыПредприятия.ПолноеИмя());
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ДокументСсылка);
		БлокировкаДанных.Заблокировать();
		
		РегистрыСведений.ФайлыДокументовНаРаспознавании.УдалитьФайл(ПараметрыЗаполнения.Файл);
		РегистрыСведений.СостоянияРаспознаваемыхДокументов.ДобавитьЗапись(ПараметрыЗаполнения.Документ, 
			Перечисления.СтатусыРаспознаванияДокументов.Распознан);
		
		Если СвойстваРаспознанногоДокумента.Загружен = Ложь Тогда
			РегистрыСведений.РезультатыРаспознаванияДокументов.ДобавитьЗапись(ДокументСсылка,
				ПараметрыЗаполнения.ИдентификаторДокумента, ПараметрыЗаполнения.ИдентификаторЗадания, 
					ПараметрыЗаполнения.Файл, СвойстваРаспознанногоДокумента);
		КонецЕсли;
		
	
		Если СвойстваРаспознанногоДокумента.ТипФормализованногоДокумента <> Неопределено Тогда
			
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			
			ЗаполнитьДокумент_v1(ДокументОбъект, СвойстваРаспознанногоДокумента);
			ДокументОбъект.Записать();
			
		Иначе
			
			Заголовок = СтрЗаменить(ДокументСсылка.Заголовок, "Выполняется распознавание...", "");
			УстановитьСтатусРаспознаванияДокумента(ДокументСсылка, 
				Перечисления.СтатусыРаспознаванияДокументов.Распознан, Заголовок,  Истина);
			НеобходимаПроверкаРеквизита(ДокументСсылка, ИмяРеквизитаВсе(), ""); 
					
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		ПослеУспешногоЗаполненияДокумента(ПараметрыЗаполнения);
		
	Исключение
		
		ОтменитьТранзакцию();
		ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Не удалось заполнить документ: %1'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеОшибки());
			
		РегистрыСведений.ФайлыДокументовНаРаспознавании.ЗафиксироватьОшибкуПриРаспознавании(ПараметрыЗаполнения.Файл, 
			ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьДокумент_v1(ДокументОбъект, Знач СвойстваРаспознанногоДокумента)

	ДесериализованноеЗначение = СвойстваРаспознанногоДокумента.Данные.ДесериализованноеЗначение.Получить("result");

	Если ТипЗнч(ДесериализованноеЗначение) <> Тип("Соответствие") Тогда
		ВызватьИсключение НСтр("ru = 'Ожидалось, что ДесериализованноеЗначение будет типа Соответствие.'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДесериализованноеЗначение["document"]) Тогда
		
		Ошибка = ДесериализованноеЗначение["document"]["error"];
		
		Если ЗначениеЗаполнено(Ошибка) Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка распознавания %1'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), Ошибка);
		КонецЕсли;
		
	КонецЕсли;
	
	ТипДокумента = СвойстваРаспознанногоДокумента.ТипФормализованногоДокумента;
	
	ВидИТематика = РегистрыСведений.СоответствиеВидовРаспознаваемыхДокументов.ВидФормализованногоДокумента(ТипДокумента);
	
	Если ВидИТематика = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.ВидДокумента = ВидИТематика.ВидДокумента;
	
	ДокументОбъект.Тематика = Справочники.ТематикиДокументов.ПустаяСсылка();
	
	Если ДокументОбъект.ВидДокумента.ВестиУчетПоТематикам Тогда
		ДокументОбъект.Тематика = ВидИТематика.Тематика;
	КонецЕсли;
	
	СоответствиеРеквизитов = РаспознаваниеДокументовСлужебный
		.ПолучитьСопоставлениеРеквизитовИСвойствJSON(ТипДокумента);
	
	ДанныеРеквизитов = ДанныеРеквизитовДокумента(СоответствиеРеквизитов);

	СвойстваШапки = ДесериализованноеЗначение["Страница"];
	СоответствияШапки = СвойстваШапки["child"];
	
	ЗаполнитьРеквизитыРекурсивно(ТипДокумента, СоответствияШапки, "", СоответствиеРеквизитов, ДанныеРеквизитов);
	РаспознаваниеДокументовСлужебный.ДобавитьВариантыНайденныеПоискомПоНесколькимРеквизитам(ДанныеРеквизитов, Истина);
	ЗаполнитьЗначенияПоСпискамКандидатов(ДанныеРеквизитов.ТаблицаРеквизитов, ДанныеРеквизитов.СпискиКандидатов);
	ЗаполнитьЗначенияПоСпискамКандидатов(ДанныеРеквизитов.ТаблицаРеквизитовТЧ, ДанныеРеквизитов.СпискиКандидатов);
	
	ЗаполнитьСтороны(ДокументОбъект, ДанныеРеквизитов, ТипДокумента);

	ЗаполнитьПрочиеРеквизиты(ДокументОбъект, ДанныеРеквизитов);

КонецПроцедуры

Процедура ЗаполнитьСтороны(ДокументОбъект, Знач ДанныеРеквизитов, Знач ТипДокумента)
	
	//все документы считаем входящими
	ВидДокумента = ДокументОбъект.ВидДокумента;
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(ВидДокумента);
	
	ЗначенияРеквизитовСоответствие = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивСсылок, 
		"ВестиУчетПоОрганизациям, ВестиУчетПоКонтрагентам, ВестиУчетСторон");
		
	ЗначенияРеквизитов = ЗначенияРеквизитовСоответствие.Получить(ВидДокумента);
	
	ВестиУчетПоОрганизациям = ЗначенияРеквизитов.ВестиУчетПоОрганизациям;
	ВестиУчетПоКонтрагентам = ЗначенияРеквизитов.ВестиУчетПоКонтрагентам;
	ВестиУчетСторон = ЗначенияРеквизитов.ВестиУчетСторон;
	
	ПроверятьВсе = Истина;
	
	КоэффициентУверенности = КоэффициентУверенности();
	Организация = Справочники.Организации.ПустаяСсылка(); 
	УверенностьНайденногоЗначенияОрганизация = 0;
	
	ДанныеПоКонтрагентам = ДанныеРеквизитовПоТипу(ДанныеРеквизитов.ТаблицаРеквизитов, 
		Тип("СправочникСсылка.Контрагенты"));
	ДанныеПоОрганизациям = ДанныеРеквизитовПоТипу(ДанныеРеквизитов.ТаблицаРеквизитов, 
		Тип("СправочникСсылка.Организации"));
	
	ОрганизацииПоТипуДокумента = ОрганизацияПоТипуВходящегоДокумента(ТипДокумента, ДанныеПоОрганизациям); 
	КонтрагентыПоТипуВходящегоДокумента = КонтрагентыПоТипуВходящегоДокумента(ТипДокумента, ДанныеПоКонтрагентам); 
	
	Организация = Справочники.Организации.ПустаяСсылка();
	Если ОрганизацииПоТипуДокумента.Количество() > 0 Тогда  
		Организация = ОрганизацииПоТипуДокумента[0].Значение;
		УверенностьНайденногоЗначенияОрганизация = ОрганизацииПоТипуДокумента[0].УверенностьНайденногоЗначения;     
	КонецЕсли;
	
	ИННОрганизации = "";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ИННОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН");
	КонецЕсли;
	
	Если ВестиУчетСторон Тогда
		
		Сторона = Неопределено;
		Если ДокументОбъект.Стороны.Количество() > 0 Тогда
			Если Не ЗначениеЗаполнено(ДокументОбъект.Стороны[0].Сторона) Тогда
				Сторона = ДокументОбъект.Стороны[0];
			КонецЕсли;
		Иначе
			Сторона = ДокументОбъект.Стороны.Добавить();
		КонецЕсли;
		
		Если Сторона <> Неопределено Тогда
			Если ЗначениеЗаполнено(Организация) Тогда
				Сторона.Сторона = Организация;    
				Если ПроверятьВсе Или УверенностьНайденногоЗначенияОрганизация < КоэффициентУверенности Тогда
					НеобходимаПроверкаРеквизита(ДокументОбъект.Ссылка, "Сторона", Организация, "Объект.Стороны", 1);
				КонецЕсли;
			Иначе 
				НеобходимаПроверкаРеквизита(ДокументОбъект.Ссылка, "Сторона", Организация, "Объект.Стороны", 1);
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого Контрагент Из КонтрагентыПоТипуВходящегоДокумента Цикл
			
			ЗначениеКонтрагента = Контрагент.Значение;
			ИННКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеКонтрагента, "ИНН");
			
			Если ЗначениеЗаполнено(Организация) Тогда 
				Если ИННКонтрагента = ИННОрганизации Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ДокументОбъект.Стороны.Найти(Контрагент.Значение, "Сторона") = Неопределено Тогда
				Сторона = ДокументОбъект.Стороны.Добавить();
				Сторона.Сторона = Контрагент.Значение;
				Если ПроверятьВсе Или Контрагент.УверенностьНайденногоЗначения < КоэффициентУверенности Тогда
					НеобходимаПроверкаРеквизита(ДокументОбъект.Ссылка, "Сторона", Контрагент.Значение, "Объект.Стороны", Сторона.НомерСтроки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ВестиУчетПоКонтрагентам Тогда
		
		Для Каждого Контрагент Из КонтрагентыПоТипуВходящегоДокумента Цикл
			ЗначениеКонтрагента = Контрагент.Значение;
			Если (ВестиУчетСторон Или ВестиУчетПоОрганизациям) И ЗначениеЗаполнено(Организация) 
				И ИННКонтрагента = ИННОрганизации Тогда
					Продолжить;
			КонецЕсли;

			Если ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
				Если ЗначениеКонтрагента <> ДокументОбъект.Контрагент 
					И ДокументОбъект.Контрагенты.Найти(Контрагент.Значение, "Контрагент") = Неопределено  Тогда
						НС = ДокументОбъект.Контрагенты.Добавить();
						НС.Контрагент = ЗначениеКонтрагента;
						Если ПроверятьВсе Или Контрагент.УверенностьНайденногоЗначения < КоэффициентУверенности Тогда
							НеобходимаПроверкаРеквизита(ДокументОбъект.Ссылка, "Контрагент", Контрагент.Значение,
								"Объект.Контрагенты", Сторона.НомерСтроки);
						КонецЕсли;
				КонецЕсли;
			Иначе
				ДокументОбъект.Контрагент = ЗначениеКонтрагента;   
				ДокументОбъект.Контрагенты.Добавить().Контрагент = ЗначениеКонтрагента;
				Если ПроверятьВсе Или Контрагент.УверенностьНайденногоЗначения < КоэффициентУверенности Тогда
					НеобходимаПроверкаРеквизита(ДокументОбъект.Ссылка, "Объект.Контрагент", Контрагент.Значение);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
		
	Если ВестиУчетПоОрганизациям И Не ВестиУчетСторон Тогда
		
		ДокументОбъект.Организация = Организация; 
		Если ПроверятьВсе Или УверенностьНайденногоЗначенияОрганизация < КоэффициентУверенности Тогда
			НеобходимаПроверкаРеквизита(ДокументОбъект.Ссылка, "Объект.Организация", Организация);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры  

Функция ОрганизацияПоТипуВходящегоДокумента(Знач ТипДокумента, Знач ДанныеПоОрганизациям) 
	
	Реквизиты = ИменаРеквизитовОрганизацийПоТипуВходящегоДокумента(ТипДокумента);
	ТаблицаОрганизаций = ПолучитьСтрокиПоИменамРеквизитов(Реквизиты, ДанныеПоОрганизациям);
	ТаблицаОрганизаций.Сортировать("УверенностьНайденногоЗначения Убыв");
	Возврат ТаблицаОрганизаций; 
	
КонецФункции   

Функция КонтрагентыПоТипуВходящегоДокумента(Знач ТипДокумента, Знач ДанныеПоКонтрагентам) 
   
	Реквизиты = ИменаРеквизитовКонтрагентовПоТипуВходящегоДокумента(ТипДокумента);	
	ТаблицаКонтрагентов = ПолучитьСтрокиПоИменамРеквизитов(Реквизиты, ДанныеПоКонтрагентам);
	ТаблицаКонтрагентов.Сортировать("УверенностьНайденногоЗначения Убыв");
	Возврат ТаблицаКонтрагентов;  
	
КонецФункции    

Функция ИменаРеквизитовКонтрагентовПоТипуВходящегоДокумента(Знач ТипДокумента)
	
	МассивИмен = Новый Массив; 
	
	Если   ТипДокумента = Перечисления.ТипыФормализованныхДокументов.АктОбОказанииУслуг Тогда
		МассивИмен = Новый Массив;  
        МассивИмен.Добавить("Исполнитель");
		МассивИмен.Добавить("Грузоотправитель"); 
		МассивИмен.Добавить("Продавец");  
		МассивИмен.Добавить("Поставщик");
	ИначеЕсли ТипДокумента = Перечисления.ТипыФормализованныхДокументов.СчетНаОплату Тогда
		МассивИмен.Добавить("Исполнитель");
		МассивИмен.Добавить("Продавец");
		МассивИмен.Добавить("Поставщик");   
	ИначеЕсли ТипДокумента = Перечисления.ТипыФормализованныхДокументов.СчетФактура Тогда      
		МассивИмен.Добавить("Продавец");
		МассивИмен.Добавить("Грузоотправитель"); 
		МассивИмен.Добавить("Поставщик");
	ИначеЕсли ТипДокумента = Перечисления.ТипыФормализованныхДокументов.ТОРГ12 Тогда  
		МассивИмен.Добавить("Продавец");
		МассивИмен.Добавить("Грузоотправитель"); 
		МассивИмен.Добавить("Поставщик");   
	ИначеЕсли ТипДокумента = Перечисления.ТипыФормализованныхДокументов.УПД Тогда    
		МассивИмен.Добавить("Продавец");
		МассивИмен.Добавить("Грузоотправитель"); 
		МассивИмен.Добавить("Поставщик"); 
	КонецЕсли; 
	
	Возврат МассивИмен;
	
КонецФункции  

Функция ИменаРеквизитовОрганизацийПоТипуВходящегоДокумента(Знач ТипДокумента)
	
	МассивИмен = Новый Массив; 
	
	Если   ТипДокумента = Перечисления.ТипыФормализованныхДокументов.АктОбОказанииУслуг Тогда
		МассивИмен = Новый Массив;  
		МассивИмен.Добавить("ПокупательОрганизация");   
		МассивИмен.Добавить("ГрузополучательОрганизация");  
	ИначеЕсли ТипДокумента = Перечисления.ТипыФормализованныхДокументов.СчетНаОплату Тогда    
		МассивИмен.Добавить("ПокупательОрганизация");   
	ИначеЕсли ТипДокумента = Перечисления.ТипыФормализованныхДокументов.СчетФактура Тогда      
		МассивИмен.Добавить("ПокупательОрганизация");  
		МассивИмен.Добавить("ГрузополучательОрганизация");
	ИначеЕсли ТипДокумента = Перечисления.ТипыФормализованныхДокументов.ТОРГ12 Тогда  
		МассивИмен.Добавить("ПокупательОрганизация"); 
		МассивИмен.Добавить("ГрузополучательОрганизация");
	ИначеЕсли ТипДокумента = Перечисления.ТипыФормализованныхДокументов.УПД Тогда    
		МассивИмен.Добавить("ПокупательОрганизация");
		МассивИмен.Добавить("ГрузополучательОрганизация");		
	КонецЕсли; 
	
	Возврат МассивИмен;
	
КонецФункции

Функция ПолучитьСтрокиПоИменамРеквизитов(Знач Реквизиты, Знач ТаблицаПоиска)    
	
	ТаблицаВозврата = ТаблицаПоиска.Скопировать();
	ТаблицаВозврата.Очистить();	
	
	Для Каждого ИмяРеквизита Из Реквизиты Цикл
		НСтр = ТаблицаПоиска.Найти(ИмяРеквизита, "ИмяРеквизита");
		Если НСтр <> Неопределено Тогда
			НовСтр = ТаблицаВозврата.Добавить(); 
			ЗаполнитьЗначенияСвойств(НовСтр, НСтр);
		КонецЕсли;
	КонецЦикла;	   
	
	Возврат ТаблицаВозврата;
	
КонецФункции

Функция ДанныеРеквизитовПоТипу(Знач ДанныеРеквизитов, Знач Тип)
	
	ТаблицаРеквизитовПоТипу = ДанныеРеквизитов.Скопировать();
	ТаблицаРеквизитовПоТипу.Очистить();
	
	Для Каждого Реквизит Из ДанныеРеквизитов Цикл
		Если ЗначениеЗаполнено(Реквизит.Значение) И ТипЗнч(Реквизит.Значение) = Тип Тогда    
			НовСтр = ТаблицаРеквизитовПоТипу.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Реквизит);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРеквизитовПоТипу;
	
КонецФункции

Процедура НеобходимаПроверкаРеквизита(ДокументСсылка, Знач ИмяРеквизита, Знач РаспознанноеЗначение, 
	Знач ТабличнаяЧасть = Неопределено, Знач НомерСтроки = Неопределено) 
	
	ПараметрыВерификации = Новый Структура("РаспознанноеЗначение, ТребуетПроверки, Проверен", РаспознанноеЗначение, 
		Истина, Ложь); 
	
	Если ТабличнаяЧасть = Неопределено Тогда  
		РегистрыСведений.ВерификацияРеквизитовРаспознанныхДокументов.
			ДобавитьПроверяемыйРеквизит(ДокументСсылка, ИмяРеквизита, ПараметрыВерификации);
	Иначе
		РегистрыСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов.
		ДобавитьПроверяемыйРеквизит(ДокументСсылка, ИмяРеквизита, ТабличнаяЧасть, НомерСтроки, ПараметрыВерификации);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПрочиеРеквизиты(ДокументОбъект, Знач ДанныеРеквизитов)
	
	ТаблицаРеквизитов = ДанныеРеквизитов.ТаблицаРеквизитов;
	Валюта = Делопроизводство.ПолучитьВалютуПоУмолчанию();  
	ДокументОбъект.Валюта = Валюта;
	ДокументОбъект.ФормаДокумента = Перечисления.ВариантыФормДокументов.Бумажная;
	Отбор = Новый Структура("ИмяРеквизита", "ИтогоВсего");
	НайденныеСтроки = ТаблицаРеквизитов.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 И ЗначениеЗаполнено(НайденныеСтроки[0].Значение) Тогда
		ДокументОбъект.Сумма = НайденныеСтроки[0].Значение;
		ДокументОбъект.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ДокументОбъект.Сумма, Валюта);
		НеобходимаПроверкаРеквизита(ДокументОбъект.Ссылка, "Объект.Сумма", ДокументОбъект.Сумма);
	КонецЕсли;
	
	Отбор = Новый Структура("ИмяРеквизита", "ИтогоСуммаНДС");
	НайденныеСтроки = ТаблицаРеквизитов.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 И ЗначениеЗаполнено(НайденныеСтроки[0].Значение) Тогда
		ДокументОбъект.СуммаНДС = НайденныеСтроки[0].Значение;
		ДокументОбъект.СуммаНДСПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ДокументОбъект.СуммаНДС, Валюта);
		НеобходимаПроверкаРеквизита(ДокументОбъект.Ссылка, "Объект.СуммаНДС", ДокументОбъект.СуммаНДС);
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоСпискамКандидатов(ТаблицаДанных, СпискиКандидатов)
	
	Для Каждого Стр Из ТаблицаДанных Цикл
		
		СписокКандидатов = СпискиКандидатов.Получить(Стр);
		
		Если СписокКандидатов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СписокКандидатов.Количество() > 0 Тогда
			
			Для Каждого Кандидат Из СписокКандидатов Цикл
				Если Кандидат.Коэффициент > Стр.УверенностьНайденногоЗначения Тогда
					Стр.Значение = Кандидат.Ссылка;
					Стр.УверенностьНайденногоЗначения = Кандидат.Коэффициент;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеРеквизитовДокумента(Знач СоответствиеРеквизитов)
	
	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("ИмяРеквизита", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаРеквизитов.Колонки.Добавить("Значение", Метаданные.ОпределяемыеТипы.РаспознаваемыеРеквизитыДокумента.Тип);
	ТаблицаРеквизитов.Колонки.Добавить("НайденноеЗначение", Метаданные.ОпределяемыеТипы.РаспознаваемыеРеквизитыДокумента.Тип);
	ТаблицаРеквизитов.Колонки.Добавить("УверенностьНайденногоЗначения", ОбщегоНазначения.ОписаниеТипаЧисло(1, 2));
	ТаблицаРеквизитов.Колонки.Добавить("РаспознанныйТекст", ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	
	ТаблицаРеквизитовТЧ = Новый ТаблицаЗначений;
	ТаблицаРеквизитовТЧ.Колонки.Добавить("ТабличнаяЧасть", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаРеквизитовТЧ.Колонки.Добавить("НомерСтрокиТЧ", ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТаблицаРеквизитовТЧ.Колонки.Добавить("ИмяРеквизита", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаРеквизитовТЧ.Колонки.Добавить("Значение", Метаданные.ОпределяемыеТипы.РаспознаваемыеРеквизитыДокумента.Тип);
	ТаблицаРеквизитовТЧ.Колонки.Добавить("НайденноеЗначение", Метаданные.ОпределяемыеТипы.РаспознаваемыеРеквизитыДокумента.Тип);
	ТаблицаРеквизитовТЧ.Колонки.Добавить("УверенностьНайденногоЗначения", ОбщегоНазначения.ОписаниеТипаЧисло(1, 2));
	ТаблицаРеквизитовТЧ.Колонки.Добавить("РаспознанныйТекст", ОбщегоНазначения.ОписаниеТипаСтрока(1000));

	Для Каждого ДанныеСопоставления Из СоответствиеРеквизитов Цикл
		
		Если ДанныеСопоставления.ЭтоРеквизитТабличнойЧасти Тогда
			
			НомерСтроки = 1;
			
			Реквизит = РаспознаваниеДокументовСлужебный
				.РеквизитТаблицыДокумента(ТаблицаРеквизитовТЧ, НомерСтроки, ДанныеСопоставления.ИмяРеквизита);
			Реквизит.Значение = ДанныеСопоставления.ОписаниеТипа.ПривестиЗначение();
			
		Иначе
			
			Реквизит = РаспознаваниеДокументовСлужебный
				.РеквизитДокумента(ТаблицаРеквизитов, ДанныеСопоставления.ИмяРеквизита);
			Реквизит.Значение = ДанныеСопоставления.ОписаниеТипа.ПривестиЗначение();
			
		КонецЕсли;
		
	КонецЦикла;
	
	СпискиКандидатов = Новый Соответствие;
	СтруктураВозврата = Новый Структура("ТаблицаРеквизитов, ТаблицаРеквизитовТЧ, СпискиКандидатов",
		ТаблицаРеквизитов, ТаблицаРеквизитовТЧ, СпискиКандидатов);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ЗаполнитьРеквизитыРекурсивно(ТипДокумента, СоответствиеJSON, АдресJSON, СоответствиеРеквизитов, 
		РеквизитыДокумента, ТабличнаяЧасть = Неопределено, НомерСтрокиТЧ = 0, Знач ПредСоответствиеJSON = Неопределено)
	
	Перем СтрТабРек;
	
	Для Каждого ТекСоотв Из СоответствиеJSON Цикл
		Если ТипЗнч(ТекСоотв.Значение) = Тип("Соответствие") Тогда
			
			Если ТекСоотв.Значение["type"] = "container" ИЛИ НЕ ТекСоотв.Значение.Получить("child") = Неопределено Тогда
				
				Если ТекСоотв.Значение.Получить("postprocessed") = Истина Тогда
					ЗаполнитьЗначенияРеквизита(СтрТабРек, АдресJSON + СокрЛП(ТекСоотв.Ключ) + ".", 
						РеквизитыДокумента, НомерСтрокиТЧ, СоответствиеРеквизитов, ТабличнаяЧасть, ТекСоотв.Значение, 
							СоответствиеJSON);
				КонецЕсли;
				НовСоответствие = ТекСоотв.Значение["child"];
				ПредСоответствиеJSON = ТекСоотв;
				
			ИначеЕсли ТекСоотв.Значение["type"] = "table" Тогда
				
				ДанныеСтрок = ТекСоотв.Значение["rows"];
				АдресJSON = ТекСоотв.Ключ + ".Строка.";
				ИмяТаблицы = ТекСоотв.Ключ;
				
				РаспознаваниеДокументовСлужебный.ПриФормированииДанныхТабличныхЧастей(ТипДокумента, ИмяТаблицы, 
					АдресJSON, ДанныеСтрок);
				
				Для Каждого СтрокаТаблицы Из ДанныеСтрок Цикл
					ЗаполнитьРеквизитыРекурсивно(ТипДокумента, СтрокаТаблицы, АдресJSON, СоответствиеРеквизитов, 
						РеквизитыДокумента, ИмяТаблицы, ДанныеСтрок.Найти(СтрокаТаблицы) + 1);
				КонецЦикла;
				
				ДанныеПодвала = ТекСоотв.Значение["footer"];
				ИмяТаблицы = ТекСоотв.Ключ;
				
				РаспознаваниеДокументовСлужебный.ПриФормированииДанныхТабличныхЧастей(ТипДокумента, ИмяТаблицы, 
					АдресJSON, ДанныеСтрок);
				
				Для Каждого СтрокаТаблицы Из ДанныеПодвала Цикл
					АдресJSON = ИмяТаблицы + "." + СтрокаТаблицы.Ключ + ".";
					ЗаполнитьРеквизитыРекурсивно(ТипДокумента, СтрокаТаблицы.Значение, АдресJSON, 
						СоответствиеРеквизитов, РеквизитыДокумента);
				КонецЦикла;
				
				АдресJSON = "";
				Продолжить;
				
			Иначе
				НовСоответствие = ТекСоотв.Значение;
			КонецЕсли;
			
			ЗаполнитьРеквизитыРекурсивно(ТипДокумента, НовСоответствие, АдресJSON + СокрЛП(ТекСоотв.Ключ) + ".", 
				СоответствиеРеквизитов, РеквизитыДокумента, ТабличнаяЧасть, НомерСтрокиТЧ, ПредСоответствиеJSON);
				
		Иначе
			
			ЗаполнитьЗначенияРеквизита(СтрТабРек, АдресJSON, РеквизитыДокумента, НомерСтрокиТЧ, 
				СоответствиеРеквизитов, ТабличнаяЧасть, СоответствиеJSON, ПредСоответствиеJSON);
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияРеквизита(СтрТабРек, Знач АдресJSON, РеквизитыДокумента, Знач НомерСтрокиТЧ, 
	Знач СоответствиеРеквизитов, Знач ТабличнаяЧасть, Знач СоответствиеJSON, Знач ПредСоответствиеJSON = Неопределено)
	
	Если СтрТабРек <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекАдрес = Лев(АдресJSON, СтрДлина(АдресJSON) - 1); // Убираем точку в конце

	СтрокиОтбора = СоответствиеРеквизитов.НайтиСтроки(Новый Структура("Адрес", ТекАдрес));
	
	Для Каждого ТекРеквизит Из СтрокиОтбора Цикл
		
		Если ТабличнаяЧасть = Неопределено Тогда
			Отбор = Новый Структура("ИмяРеквизита", ТекРеквизит.ИмяРеквизита);
			НайденныеСтроки = РеквизитыДокумента.ТаблицаРеквизитов.НайтиСтроки(Отбор);
			СтрТабРек = НайденныеСтроки[0];
		Иначе
			Если НомерСтрокиТЧ = 1 Тогда
				Отбор = Новый Структура("НомерСтрокиТЧ, ИмяРеквизита", 1, ТекРеквизит.ИмяРеквизита);
				СтрТабРек = РеквизитыДокумента.ТаблицаРеквизитовТЧ.НайтиСтроки(Отбор)[0];
			Иначе
				СтрТабРек = РеквизитыДокумента.ТаблицаРеквизитовТЧ.Добавить();
			КонецЕсли;
			СтрТабРек.НомерСтрокиТЧ = НомерСтрокиТЧ;
		КонецЕсли;
		
		СтрТабРек.ИмяРеквизита = ТекРеквизит.ИмяРеквизита;
		СтрТабРек.Значение = ТекРеквизит.ОписаниеТипа.ПривестиЗначение();
		
		Для Каждого ТекСоотв Из СоответствиеJSON Цикл
			Если ТипЗнч(ТекСоотв.Значение) = Тип("Соответствие") Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСоотв.Ключ = "text" Тогда
				СтрТабРек.РаспознанныйТекст = ТекСоотв.Значение;
				ТекТипРеквизита = ТипЗнч(СтрТабРек.Значение);
				Если РаспознаваниеДокументовКлиентСервер.ЭтоПримитивныйТип(ТекТипРеквизита) Тогда
					Если ТекТипРеквизита = Тип("Строка") Тогда
						СтрТабРек.Значение = СокрЛП(ТекСоотв.Значение);
					Иначе
						СтрТабРек.Значение = РаспознаваниеДокументовСериализацияСлужебныйКлиентСервер.ПривестиТип(
							ТекСоотв.Значение, ТекТипРеквизита);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПослеУспешногоЗаполненияДокумента(Знач ПараметрыЗаполнения)
	
	РезультатОбратнойСвязи = ОписаниеОбратнойСвязи("Загружен");
	ОтправитьОбратнуюСвязьRecognitionResult(РезультатОбратнойСвязи, ПараметрыЗаполнения.ИдентификаторДокумента);
	
КонецПроцедуры

// Создание контрагента в информационной базе по реквизитам.
//
// Параметры:
//   РеквизитыКонтрагента - Структура:
//    * ИНН - Строка - ИНН контрагента.
//    * КПП - Строка - КПП контрагента.
//    * Наименование - Строка - наименование контрагента.
//   Контрагент - СправочникСсылка - ссылка на созданного контрагента.
//   Отказ - Булево - признак ошибки.
//
Процедура СоздатьКонтрагентаПоРеквизитам(Знач РеквизитыКонтрагента, Контрагент, Отказ = Ложь) Экспорт

	КонтрагентыЛокализация.СоздатьКонтрагентаПоРеквизитам(РеквизитыКонтрагента, Контрагент, Отказ);
	
КонецПроцедуры

Функция ПолучитьРезультатПоИдентификатору(Знач ИдентификаторДокумента)
	
	//сначала из регистра
	Результат = РегистрыСведений.РезультатыРаспознаванияДокументов.
		ПолучитьРезультатПоИдентификатору(ИдентификаторДокумента);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Данные");
	СтруктураВозврата.Вставить("Загружен", Ложь);
	СтруктураВозврата.Вставить("ТипФормализованногоДокумента", Неопределено);  
	СтруктураВозврата.Вставить("Текст");
	СтруктураВозврата.Вставить("ОписаниеОшибки", "");
	
	Если Результат <> Неопределено Тогда
		
		СтруктураВозврата.Данные = Результат;
		СтруктураВозврата.Загружен = Истина;
		СтруктураВозврата.ТипФормализованногоДокумента = ТипФормализованногоДокумента(Результат);

	Иначе

		//старый формат - формализованные документы
		Результат = РаспознаваниеДокументовКоннекторСлужебный.
			ПолучитьРезультатПоИдентификатору(ИдентификаторДокумента);
		
		Если Результат.КодСостояния <> 200 Тогда
			
			СтруктураВозврата.ОписаниеОшибки = 
				СтрШаблон(НСтр("ru = 'Не удалось получить результат по идентификатору документа. Код состояния: %1'", 
					ОбщегоНазначения.КодОсновногоЯзыка()), Результат.КодСостояния);
				
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		
		ТипФормализованногоДокумента = ТипФормализованногоДокумента(Результат);
		
		Если ТипФормализованногоДокумента <> Неопределено Тогда //универсальный формат
			
			СтруктураВозврата.ТипФормализованногоДокумента = ТипФормализованногоДокумента;
			
		КонецЕсли;
			
		СтруктураВозврата.Данные = Результат;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ТипФормализованногоДокумента(Знач ДанныеДокумента)
	
	ДесериализованноеЗначение = Неопределено;
	Если ТипЗнч(ДанныеДокумента) = Тип("Структура") И ДанныеДокумента.Свойство("ДесериализованноеЗначение",
		ДесериализованноеЗначение) Тогда 
		ДесериализованноеЗначение = ДесериализованноеЗначение.Получить("result");
		Если ТипЗнч(ДесериализованноеЗначение) <> Тип("Соответствие") Тогда
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	Если ТипЗнч(ДесериализованноеЗначение.Получить("document")) = Тип("Соответствие") Тогда
		ТипДокумента = ДесериализованноеЗначение["document"].Получить("type");
	Иначе
		ТипДокумента = Неопределено;
	КонецЕсли;
	
	СоответствиеТипов = СоответствиеВидовРаспознаваемыхДокументов();
	
	ТипСсылкой = СоответствиеТипов.Получить(ТипДокумента);
	
	Если ТипСсылкой <> Перечисления.ТипыФормализованныхДокументов.НеопределенныйДокумент Тогда
		Возврат ТипСсылкой;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьФайлыДокументовДляРаспознавания()
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ФайлыДокументовНаРаспознавании.Файл КАК Файл,
		|	ФайлыДокументовНаРаспознавании.ИдентификаторЗадания,
		|	ФайлыДокументовНаРаспознавании.ИдентификаторФайла
		|ПОМЕСТИТЬ ВТ_ВсеФайлы
		|ИЗ
		|	РегистрСведений.ФайлыДокументовНаРаспознавании КАК ФайлыДокументовНаРаспознавании
		|ГДЕ
		|	ФайлыДокументовНаРаспознавании.КоличествоПопыток < &МаксимальноеКоличествоПопыток
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеФайлы.Файл,
		|	ВТ_ВсеФайлы.ИдентификаторЗадания,
		|	ВТ_ВсеФайлы.ИдентификаторФайла
		|ИЗ
		|	ВТ_ВсеФайлы КАК ВТ_ВсеФайлы
		|ГДЕ
		|	ВТ_ВсеФайлы.ИдентификаторФайла = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеФайлы.Файл,
		|	ВТ_ВсеФайлы.ИдентификаторЗадания,
		|	ВТ_ВсеФайлы.ИдентификаторФайла
		|ИЗ
		|	ВТ_ВсеФайлы КАК ВТ_ВсеФайлы
		|ГДЕ
		|	ВТ_ВсеФайлы.ИдентификаторФайла <> """"");
	
	Запрос.УстановитьПараметр("МаксимальноеКоличествоПопыток",
		РегистрыСведений.ФайлыДокументовНаРаспознавании.МаксимальноеКоличествоНеудачныхПопытокОбработки() );
	Результат = Запрос.ВыполнитьПакет();
	СтруктураВозврата = Новый Структура("Выгрузка, Загрузка", Результат[1].Выгрузить(), Результат[2].Выгрузить());
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область Авторизация

Функция НовыеПараметрыАвторизации()
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторИБ", "");
	Результат.Вставить("ТокенДоступа", "");
	Результат.Вставить("Состояние", "Ожидает");
	Результат.Вставить("ТипАутентификации", "НеВыполнена"); // ПоТикетуИТС, ПоЛогинуПаролю
	Результат.Вставить("Логин", "");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьПараметрыАвторизации(Параметры)
	
	ИдентификаторПодсистемы = ИдентификаторПодсистемы();
	НачатьТранзакцию();
	Попытка
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(ИдентификаторПодсистемы);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
			ИдентификаторПодсистемы,
			Параметры.ИдентификаторИБ,
			"ИдентификаторИБ");
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
			ИдентификаторПодсистемы,
			Параметры.ТокенДоступа,
			"ТокенДоступа");
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
			ИдентификаторПодсистемы,
			Параметры.Состояние,
			"Состояние");
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
			ИдентификаторПодсистемы,
			Параметры.ТипАутентификации,
			"ТипАутентификации");
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
			ИдентификаторПодсистемы,
			Параметры.Логин,
			"Логин");
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыАвторизации = Новый Структура;
	ПараметрыАвторизации.Вставить("Состояние", Параметры.Состояние);
	ПараметрыАвторизации.Вставить("ТипАутентификации", Параметры.ТипАутентификации);
	
КонецПроцедуры

Функция АвторизацияВыполнена(ПараметрыАвторизации)
	
	Возврат ПараметрыАвторизации.ТипАутентификации <> "НеВыполнена";
	
КонецФункции

Функция АктивацияВыполнена(ПараметрыАвторизации)
	
	Возврат ПараметрыАвторизации.ТипАутентификации = "ПоЛогинуПаролю"
		Или ПараметрыАвторизации.Состояние = "Активирован";
	
КонецФункции

Функция ОбластьАвторизации()
	
	Попытка
		
		АбонентЭтогоПриложения = ПрограммныйИнтерфейсСервиса.АбонентЭтогоПриложения().Наименование;
		
	Исключение
		
		АбонентЭтогоПриложения = НСтр("ru = '<Неопределено>'", ОбщегоНазначения.КодОсновногоЯзыка());
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Не удалось получить абонента приложения:
					           |%1'", ОбщегоНазначения.КодОсновногоЯзыка()),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(
					СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Предупреждение, , ,
					ТекстОшибки);	
						
	КонецПопытки;
	
	Попытка
		
		АдресПриложения = ПрограммныйИнтерфейсСервиса.СвойстваПриложения(РаботаВМоделиСервиса.
			ЗначениеРазделителяСеанса()).АдресПриложения;
			
	Исключение
		
		АдресПриложения = "";
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось получить адрес приложения:
			           |%1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение, , ,
			ТекстОшибки);
			
	КонецПопытки;
	
	ИнформацияМоделиСервиса = Новый Структура;
	ИнформацияМоделиСервиса.Вставить("РазделениеВключено", РаботаВМоделиСервиса.РазделениеВключено());
	ИнформацияМоделиСервиса.Вставить("ДоступноИспользованиеРазделенныхДанных", РаботаВМоделиСервиса.
		ДоступноИспользованиеРазделенныхДанных());
	ИнформацияМоделиСервиса.Вставить("ЗначениеРазделителяСеанса", РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
	ИнформацияМоделиСервиса.Вставить("АбонентЭтогоПриложения", АбонентЭтогоПриложения);
	ИнформацияМоделиСервиса.Вставить("АдресПриложения", АдресПриложения);
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеАутентификации = РаспознаваниеЛокализация.ДанныеАутентификацииПользователяИнтернетПоддержки();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеАутентификации <> Неопределено Тогда
		ЛогинПользователяИТС  = ДанныеАутентификации.Логин;
	Иначе
		ЛогинПользователяИТС = НСтр("ru = '<Неопределено>'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	ИнформацияИТС = Новый Структура;
	ИнформацияИТС.Вставить("ЛогинПользователяИТС", ЛогинПользователяИТС);
	
	Результат = Новый Структура;
	Результат.Вставить("Конфигурация", Метаданные.Имя);
	Результат.Вставить("ВерсияКонфигурации", Метаданные.Версия);
	Результат.Вставить("ИнформацияМоделиСервиса", ИнформацияМоделиСервиса);
	Результат.Вставить("ИнформацияИТС", ИнформацияИТС);
	Результат.Вставить("ТекущаяУниверсальнаяДата", ЗаписатьДатуJSON(ТекущаяУниверсальнаяДата(), ФорматДатыJSON.ISO));
	Результат.Вставить("ТипАутентификации", НСтр("ru = '<Неопределено>'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Результат.Вставить("ИдентификаторИнформационнойБазы", СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДокументов

Функция СостоянияПоБалансу() Экспорт
	
	СостояниеБаланса = "ПроверкаСтатусаПодключения";
	// Возможные состояния:
	// * НеПоказыватьБаланс
	// * ПроверкаСтатусаПодключения
	// * Ошибка
	// * НеАвторизован
	// * НеАктивирован
	// * ПилотныйРежим
	// * ПилотныйРежимДатаОкончания
	// * ПилотныйРежимДатаОкончанияНаступила
	// * БалансНулевой
	// * БалансПоложительный
	// * БалансПоложительныйДатаОкончания
	// * БалансОтрицательный
	// * СервисОтключен
	
	Результат = Новый Структура;
	Результат.Вставить("СостояниеБаланса", СостояниеБаланса);
	Результат.Вставить("АдресЭлПочты", "");
	Результат.Вставить("ДатаОкончания", Дата("00010101"));
	Результат.Вставить("Баланс", 0);
	Результат.Вставить("Кредит", 0);
	Результат.Вставить("Использовано", 0);
	Результат.Вставить("ПоказатьТребованиеВключитьИТС", Ложь);
	Результат.Вставить("ПоказатьПредупреждениеНулевойБаланс", Ложь);
	Результат.Вставить("ПоказатьПредупреждениеСервисОтключен", Ложь);
	Результат.Вставить("ВыполнятьЗагрузкуРезультатов", Истина);
	Результат.Вставить("ПодключениеТестовогоПериодаДоступно", Ложь);
	
	Если Не АккаунтАвторизован() Тогда
		Результат.СостояниеБаланса = "НеАвторизован";
		Результат.ВыполнятьЗагрузкуРезультатов = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	Если Не АккаунтАктивирован() Тогда
		Результат.СостояниеБаланса = "НеАктивирован";
		Результат.ВыполнятьЗагрузкуРезультатов = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		ТекущийБаланс = РаспознаваниеДокументовSDK.ТекущийБаланс();
	Исключение
		Результат.СостояниеБаланса = "Ошибка";
		Возврат Результат;
	КонецПопытки;
	
	Если ТекущийБаланс.АвторизацияТикетИТС Тогда
		Результат.ПодключениеТестовогоПериодаДоступно = ПодключениеТестовогоПериодаДоступно();
	КонецЕсли;
	
	Если ТекущийБаланс.АвторизацияТикетИТС Или ТекущийБаланс.ТарификацияВключена Тогда
		
		Если ТекущийБаланс.Баланс = 0 Тогда
			
			Результат.СостояниеБаланса = "БалансНулевой";
			Результат.ДатаОкончания = ТекущийБаланс.ДатаОкончания;
			
			Если ЗначениеЗаполнено(Результат.ДатаОкончания) Тогда
				Результат.ПоказатьПредупреждениеНулевойБаланс = Истина;
			КонецЕсли;
			
		ИначеЕсли ТекущийБаланс.Баланс > 0 Тогда
			
			Если ЗначениеЗаполнено(ТекущийБаланс.ДатаОкончания) Тогда
				Результат.СостояниеБаланса = "БалансПоложительныйДатаОкончания";
				Результат.ДатаОкончания = ТекущийБаланс.ДатаОкончания;
				Результат.Баланс = ТекущийБаланс.Баланс;
			Иначе
				Результат.СостояниеБаланса = "БалансПоложительный";
				Результат.Баланс = ТекущийБаланс.Баланс;
			КонецЕсли;
			
		Иначе // ТекущийБаланс.Баланс < 0
			
			Если ТекущийБаланс.Лимит > 0 Тогда
				
				Результат.СостояниеБаланса = "БалансОтрицательный";
				Результат.ДатаОкончания = ТекущийБаланс.ДатаОкончания;
				Результат.Кредит = ТекущийБаланс.Лимит - ТекущийБаланс.Баланс;
				Результат.Использовано = -ТекущийБаланс.Баланс;
				
				Если ЗначениеЗаполнено(Результат.ДатаОкончания) Тогда
					Результат.ПоказатьПредупреждениеНулевойБаланс = Истина;
				КонецЕсли;
				
			Иначе // ТекущийБаланс.Лимит <= 0
				
				Результат.СостояниеБаланса = "СервисОтключен";
				Результат.ДатаОкончания = ТекущийБаланс.ДатаОкончания;
				Результат.Использовано = -ТекущийБаланс.Баланс;
				
				Результат.ПоказатьПредупреждениеСервисОтключен = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе // Не ТекущийБаланс.АвторизацияТикетИТС И Не ТекущийБаланс.ТарификацияВключена
		
		Если Не ЗначениеЗаполнено(ТекущийБаланс.ДатаОкончания) Тогда
			
			Результат.СостояниеБаланса = "ПилотныйРежим";
			
		ИначеЕсли ТекущийБаланс.ДатаОкончания > ТекущаяУниверсальнаяДата() Тогда
			
			Результат.СостояниеБаланса = "ПилотныйРежимДатаОкончания";
			Результат.ДатаОкончания = ТекущийБаланс.ДатаОкончания;
			
		Иначе
			Результат.СостояниеБаланса = "ПилотныйРежимДатаОкончанияНаступила";
			Результат.ДатаОкончания = ТекущийБаланс.ДатаОкончания;
			Результат.ПоказатьТребованиеВключитьИТС = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодключениеТестовогоПериодаДоступно()
	
	ИдентификаторСервиса = РаспознаваниеКлиентСервер.ИдентификаторСервиса();
	Идентификаторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторСервиса);
	ОписательДоступности = РаспознаваниеЛокализация.ДоступноПодключениеТестовогоПериода(Идентификаторы);
	Если Не ОписательДоступности.Ошибка Тогда
		Возврат ОписательДоступности.СервисыСопровождения[ИдентификаторСервиса] = "Доступно";
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Функция СобытиеЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru = 'РаспознаваниеДокументов'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция ОписаниеОбратнойСвязи(Статус) Экспорт
	
	РезультатОбратнойСвязи = Новый Структура;
	РезультатОбратнойСвязи.Вставить("Статус", Статус);
	РезультатОбратнойСвязи.Вставить("IdСозданногоДокумента", "");
	РезультатОбратнойСвязи.Вставить("ДатаИзмененияСтатуса", ТекущаяУниверсальнаяДата());
	РезультатОбратнойСвязи.Вставить("НомерРаспознанногоДокумента", "");
	РезультатОбратнойСвязи.Вставить("ЭтоВходящийДокумент", Ложь);
	РезультатОбратнойСвязи.Вставить("НомерДокумента", "");
	РезультатОбратнойСвязи.Вставить("ДатаДокумента", "01.01.0001");
	РезультатОбратнойСвязи.Вставить("СуммаДокумента", 0);
	РезультатОбратнойСвязи.Вставить("Контрагент", "");
	РезультатОбратнойСвязи.Вставить("Организация", "");
	РезультатОбратнойСвязи.Вставить("ТипРаспознанногоДокумента", "");
	РезультатОбратнойСвязи.Вставить("ИмяКоманды", "");
	РезультатОбратнойСвязи.Вставить("ВариантРегистрации", "");
	
	Возврат РезультатОбратнойСвязи;
	
КонецФункции

// Возвращает параметры распознавания для сервиса распознавания первичных документов.
//
// Возвращаемое значение:
//  Структура
//   * ЯзыкРаспознавания - Строка - язык распознавания.
//
Функция ПараметрыЗаполненияКарточекДокументов() Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("ЯзыкРаспознавания", "");
	Параметры.Вставить("СоответствиеВидовДокументов", РегистрыСведений.
		СоответствиеВидовРаспознаваемыхДокументов.СоответствиеВидовРаспознаваемыхДокументов());
	
	Возврат Параметры;
	
КонецФункции

// Установить параметры заполнения карточек документов.
// 
// Параметры:
//  Параметры - Структура
Процедура УстановитьПараметрыЗаполненияКарточекДокументов(Знач Параметры) Экспорт
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		ВызватьИсключение НСтр(
			"ru = 'Запись параметров распознавания разрешена только пользователям с полными правами.'", 
				ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	РегистрыСведений.СоответствиеВидовРаспознаваемыхДокументов.ЗаписатьДанные(Параметры.СоответствиеВидовДокументов);
	
КонецПроцедуры

// Возвращает текущий статус распознавания документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ВозвращатьСтатусПрервано - Булево
//  ТолькоСтатус - Булево
// Возвращаемое значение:
//  Неопределено, Структура
Функция ТекущаяИнформацияОСтатусеРаспознаванияДокумента(ДокументСсылка, Знач ВозвращатьСтатусПрервано = Ложь, 
		Знач ТолькоСтатус = Ложь) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСервисРаспознаванияДокументовДляЗаполненияКарточек") Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда 
		Возврат Неопределено;	
	КонецЕсли;
	 
	Возврат РегистрыСведений.СостоянияРаспознаваемыхДокументов.ТекущийСтатусПоДокументу(ДокументСсылка, 
			ВозвращатьСтатусПрервано, ТолькоСтатус);
	
КонецФункции

// Информация о распознавании документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Неопределено, Структура - Информация о распознавании документа:
// * СтатусРаспознавания  - ПеречислениеСсылка.СтатусыРаспознаванияДокументов
// * ТребуетПроверки - Булево - 
Функция ИнформацияОРаспознаванииДокумента(ДокументСсылка) Экспорт
	
	ИнформацияОСтатусе = ТекущаяИнформацияОСтатусеРаспознаванияДокумента(ДокументСсылка);

	Если ИнформацияОСтатусе = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТребуетПроверки = ТребуетПроверки(ДокументСсылка);
	
	СтруктураВозврата = Новый Структура("СтатусРаспознавания, ТребуетПроверки", ИнформацияОСтатусе.СтатусРаспознавания, 
		ТребуетПроверки);
	
	Возврат СтруктураВозврата;
	
КонецФункции 

// // Возвращает историю распознавания документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ИсторияРаспознаванияДокумента(ДокументСсылка) Экспорт
	
	Возврат РегистрыСведений.СостоянияРаспознаваемыхДокументов.ИсторияРаспознавания(ДокументСсылка);
	
КонецФункции

// Возвращает признак необходимости проверки.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ВерифицированныеРеквизиты - ТаблицаЗначений
//  Сравнить - Булево
// Возвращаемое значение:
//  Булево
Функция ТребуетПроверки(ДокументСсылка, Знач ВерифицированныеРеквизиты = Неопределено, Знач Сравнить = Ложь) Экспорт
	
	ТребуетПроверки = Ложь;
	
	Если ВерифицированныеРеквизиты = Неопределено Тогда  
		
		ТребуетПроверки = РегистрыСведений.ВерификацияРеквизитовРаспознанныхДокументов.
			НеобходимаПроверкаРеквизитов(ДокументСсылка) Или 
				РегистрыСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов.
				НеобходимаПроверкиРеквизитовТабличныхЧастей(ДокументСсылка);
				
	Иначе	
		Если Сравнить = Истина Тогда
			
			ТабРекв = РегистрыСведений.ВерификацияРеквизитовРаспознанныхДокументов.
				РеквизитыТребующиеПроверки(ДокументСсылка);
				
			ТабРеквТЧ = РегистрыСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов.
				РеквизитыТребующиеПроверки(ДокументСсылка);

			КолвоРек = 0;
			КолвоРекТЧ = 0; 
			
			Для Каждого Стр Из ВерифицированныеРеквизиты Цикл
				
				Если Стр.ТабличнаяЧасть = "" Тогда 
					
					Если ТабРекв.Найти(Стр.ИмяРеквизита, "ИмяРеквизита") <> Неопределено и Стр.Проверен = Истина Тогда
						КолвоРек = КолвоРек + 1;
					КонецЕсли;
					
				Иначе
					
					Отбор = Новый Структура;
					Отбор.Вставить("ТабличнаяЧасть", Стр.ТабличнаяЧасть);
					Отбор.Вставить("ИмяРеквизита", Стр.ИмяРеквизита);
					Отбор.Вставить("НомерСтрокиТЧ", Стр.НомерСтрокиТЧ);
					Отбор.Вставить("Проверен", Истина);
					НСтр = ТабРеквТЧ.НайтиСтроки(Отбор);
					
					Если НСтр.Количество() > 0 Тогда
						КолвоРекТЧ = КолвоРекТЧ + 1;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ТребуетПроверки = КолвоРек <> ТабРекв.Количество() или КолвоРекТЧ <> ТабРеквТЧ.Количество();
			
		Иначе 
			
			Для Каждого Стр Из ВерифицированныеРеквизиты Цикл
				
				Если Стр.Проверен = Ложь Тогда
					ТребуетПроверки = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ТребуетПроверки;
	
КонецФункции

// Прерывает процесс распознавания документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ОписаниеОшибки - Строка
Процедура ПрерватьРаспознаваниеДокумента(ДокументСсылка, ОписаниеОшибки = "") Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		РегистрыСведений.ФайлыДокументовНаРаспознавании.УдалитьЗаписьПоДокументу(ДокументСсылка);
		РегистрыСведений.ВерификацияРеквизитовРаспознанныхДокументов.УдалитьДанныеДокумента(ДокументСсылка);
		РегистрыСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов.УдалитьДанныеДокумента(ДокументСсылка);
		РегистрыСведений.СостоянияРаспознаваемыхДокументов.ДобавитьЗапись(ДокументСсылка, 
			Перечисления.СтатусыРаспознаванияДокументов.Прервано);
			
		Заголовок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Заголовок");
		
		Если Не ПустаяСтрока(Заголовок) Тогда
			ЗаголовокДокумента = Заголовок; 
		Иначе
			ЗаголовокДокумента = НСтр("ru = '<Распознавание документа прервано>'", 
				ОбщегоНазначения.КодОсновногоЯзыка());
		КонецЕсли;
		
		ЗначенияРеквизитов = Новый Соответствие; 
		ЗначенияРеквизитов.Вставить("СтатусРаспознавания", Неопределено);
		ЗначенияРеквизитов.Вставить("Заголовок", ЗаголовокДокумента);
		
		Делопроизводство.ЗаписатьДанныеДокумента(ДокументСсылка, ЗначенияРеквизитов);
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Не удалось прервать процесс распознавания: ""%1""'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), ИнформацияОбОшибке);
		
	КонецПопытки;
	
КонецПроцедуры

// Устанавливает статус распознавания документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  Статус - ПеречислениеСсылка.СтатусыРаспознаванияДокументов
//  Заголовок - строка
//  ТребуетПроверки -Булево
Процедура УстановитьСтатусРаспознаванияДокумента(ДокументСсылка, Знач Статус, Знач Заголовок="", 
		Знач ТребуетПроверки = Неопределено) Экспорт
	
	РегистрыСведений.СостоянияРаспознаваемыхДокументов.ДобавитьЗапись(ДокументСсылка, Статус); 
	
	ЗначенияРеквизитов = Новый Соответствие; 
	ЗначенияРеквизитов.Вставить("СтатусРаспознавания", Статус);
	
	Если ТребуетПроверки <> Неопределено Тогда
		ЗначенияРеквизитов.Вставить("ТребуетПроверки", ТребуетПроверки);
	КонецЕсли;
	
	Если Статус = Перечисления.СтатусыРаспознаванияДокументов.НаРаспознавании Тогда
		
		Если Не ПустаяСтрока(Заголовок) Тогда
			
			ЗаголовокДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	 				НСтр("ru = '<%1 - Выполняется распознавание...>'", 
	 					ОбщегоНазначения.КодОсновногоЯзыка()),Заголовок);

		Иначе
			
			ЗаголовокДокумента = НСтр("ru = '<Документ не сформирован. Выполняется распознавание...>'", 
				ОбщегоНазначения.КодОсновногоЯзыка());
				
		КонецЕсли;
		
		ЗначенияРеквизитов.Вставить("Заголовок", ЗаголовокДокумента);
	
	ИначеЕсли Не ПустаяСтрока(Заголовок) Тогда
			
		ЗаголовокДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1'", ОбщегоНазначения.КодОсновногоЯзыка()),Заголовок); 

		ЗначенияРеквизитов.Вставить("Заголовок", ЗаголовокДокумента);
			
	КонецЕсли; 
	
	Делопроизводство.ЗаписатьДанныеДокумента(ДокументСсылка, ЗначенияРеквизитов);
	
КонецПроцедуры

// Локализация
// Проверяет возможность запуска распознавания документов
// 
// Параметры:
//  ПараметрыРаспознаванияДокументов - Структура
// 
// Возвращаемое значение:
//  Булево - Возможен запуск распознавания документов
Функция ВозможенЗапускРаспознаванияДокументов(Знач ПараметрыРаспознаванияДокументов) Экспорт
	
	Если Не ПараметрыРаспознаванияДокументов.ИспользованиеДоступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МаксимальныйРазмерОчереди = МаксимальныйРазмерОчередиДокументовНаРаспознавании();
	
	Если ПараметрыРаспознаванияДокументов.КоличествоДокументовНаРаспознавании > МаксимальныйРазмерОчереди Тогда
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Размер очереди документов на распознавании превышает максимальный размер: %1'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), МаксимальныйРазмерОчереди);
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'РаспознаваниеДокументов.Буфер переполнен'",
				ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Предупреждение, , , Текст);
			
		Возврат Ложь;
		
	КонецЕсли;
	
	СостоянияПоБалансу = СостоянияПоБалансу();
	
	Если Не (СостоянияПоБалансу.СостояниеБаланса = "БалансПоложительный" 
			Или СостоянияПоБалансу.СостояниеБаланса = "БалансПоложительныйДатаОкончания") Тогда
				
				РегистрыСведений.ФайлыДокументовНаРаспознавании.ЗафиксироватьОшибкиБаланса();
				
				Возврат Ложь;
				
	КонецЕсли;
	
	Если СостоянияПоБалансу.СостояниеБаланса = "БалансПоложительныйДатаОкончания" 
		И СостоянияПоБалансу.ДатаОкончания < ТекущаяДатаСеанса() Тогда
			Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
// Конец Локализация

// Возвращает структуру параметров
// 
// Возвращаемое значение:
//  Структура - Параметры распознавания документов:
// * ИспользованиеДоступно - Булево 
// * СобытиеДляЖурналаРегистрации - Строка 
// * КоличествоДокументовНаРаспознавании - Число
Функция ПараметрыРаспознаванияДокументов() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИспользованиеДоступно", Ложь);
	Параметры.Вставить("СобытиеДляЖурналаРегистрации","");
	Параметры.Вставить("КоличествоДокументовНаРаспознавании",0);
	
	Параметры.ИспользованиеДоступно = ИспользованиеДоступно();
	Параметры.СобытиеДляЖурналаРегистрации = НСтр("ru = 'Распознавание документов'", 
		ОбщегоНазначения.КодОсновногоЯзыка());
	Параметры.КоличествоДокументовНаРаспознавании =
		РегистрыСведений.ФайлыДокументовНаРаспознавании.КоличествоДокументовНаРаспознавании();
	
	Возврат Параметры;
	
КонецФункции

// Возобновить распознавание файла документа.
// 
// Параметры:
//  Файл - СправочникСсылка.ВерсииФайлов
Процедура ВозобновитьРаспознаваниеФайлаДокумента(Файл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьДанныеДляРедактирования(Файл);
		Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Файл, "Владелец");
		ДокументСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ВладелецФайла");		
		РегистрыСведений.ФайлыДокументовНаРаспознавании.ЗаблокироватьФайл(Файл);
		РегистрыСведений.ФайлыДокументовНаРаспознавании.СброситьОшибку(Файл);
		РегистрыСведений.СостоянияРаспознаваемыхДокументов.ДобавитьЗапись(ДокументСсылка, 
			Перечисления.СтатусыРаспознаванияДокументов.НаРаспознавании);
		РегистрыСведений.ВерификацияРеквизитовРаспознанныхДокументов.УдалитьДанныеДокумента(ДокументСсылка);
		РегистрыСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов.УдалитьДанныеДокумента(ДокументСсылка);
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Документ на распознавании.
// 
// Параметры:
//  Документ - СправочникСсылка.ДокументыПредприятия
//  СправочникОбъект.ДокументыПредприятия
// 
// Возвращаемое значение:
//  Булево - Документ на распознавании
Функция ДокументНаРаспознавании(Документ) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСервисРаспознаванияДокументовДляЗаполненияКарточек") Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если ТипЗнч(Документ) = Тип("СправочникОбъект.ДокументыПредприятия") Тогда   
		
		ДополнительныеСвойства = Документ.ДополнительныеСвойства; 
		
		Если ДополнительныеСвойства.Свойство("ДокументОтправленНаРаспознавание") Тогда     
			Возврат ДополнительныеСвойства.ДокументОтправленНаРаспознавание;
		КонецЕсли;
		
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда
		
		НаРаспознавании = РегистрыСВедений.СостоянияРаспознаваемыхДокументов.
			ДокументНаходитсяНаРаспознавании(Документ.Ссылка);
			
		Если ТипЗнч(Документ) = Тип("СправочникОбъект.ДокументыПредприятия") И НаРаспознавании Тогда
			
			Если Документ.ДополнительныеСвойства.Свойство("ДокументОтправленНаРаспознавание") = Ложь Тогда
				// добавим признак в доп. свойства, чтобы при повторном вызове не было обращения к регистру 
				Документ.ДополнительныеСвойства.Вставить("ДокументОтправленНаРаспознавание", Истина);
			КонецЕсли; 
			
		КонецЕсли; 
		
		Возврат НаРаспознавании;
		
	КонецЕсли;    
	
    Возврат Ложь;
	
КонецФункции

// Отправить файл документа на распознавание.
// 
// Параметры:
//  Файл - СправочникСсылка.Файлы
Процедура ОтправитьФайлДокументаНаРаспознавание(Файл) Экспорт
	
	Параметры = ПараметрыРаспознаванияДокументов();
	
	Если Не Параметры.ИспользованиеДоступно Тогда
		Возврат;
	КонецЕсли;
	
	ЗначРеквизитовФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Файл, "ТекущаяВерсия, ВладелецФайла");
	ЗначРеквизитовВерсии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначРеквизитовФайла.ТекущаяВерсия, 
		"Наименование, Расширение");
	
	НачатьТранзакцию();
	
	Попытка
		
		РегистрыСведений.ФайлыДокументовНаРаспознавании.ДобавитьФайл(ЗначРеквизитовФайла.ТекущаяВерсия);
		УстановитьСтатусРаспознаванияДокумента(ЗначРеквизитовФайла.ВладелецФайла, 
			Перечисления.СтатусыРаспознаванияДокументов.НаРаспознавании, 
				ЗначРеквизитовВерсии.Наименование + "." + ЗначРеквизитовВерсии.Расширение);
			
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();

		ОписаниеОшибкиИнфо = ОписаниеОшибки();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								 НСтр("ru = 'Не удалось отправить файл документа на распознавание ""%1"".'", 
								 	ОбщегоНазначения.КодОсновногоЯзыка()), 
										ПолучитьНавигационнуюСсылку(ЗначРеквизитовФайла.ТекущаяВерсия));
		ТекстСообщения = ТекстСообщения + Строка(ОписаниеОшибкиИнфо);
		
		ЗаписьЖурналаРегистрации(Параметры.СобытиеДляЖурналаРегистрации, 
			УровеньЖурналаРегистрации.Ошибка, , ,
			ТекстСообщения);
			
	КонецПопытки;
		
КонецПроцедуры

// Обновляет полномочия ролями для выполнения распознавания документов
Процедура ОбновитьПолномочия() Экспорт
	
	УправлениеДоступомДокументооборот.ДобавитьРольВПолномочия(
		"ПроверкаРаспознанныхДокументов", 
		"eeb325ab-db51-11de-a544-00179ab398dc");
	УправлениеДоступомДокументооборот.ДобавитьРольВПолномочия(
		"РаспознаваниеДокументов", 
		"eeb325ab-db51-11de-a544-00179ab398dc");
		
КонецПроцедуры

// Возвращает имя реквизита означающего необходимость проверки всех реквизитов
// 
// Возвращаемое значение:
//  Строка - Имя реквизита все
Функция ИмяРеквизитаВсе() Экспорт
	
	Возврат "#ВсеРеквизиты";
	
КонецФункции

// Соответствие видов распознаваемых документов.
// 
// Возвращаемое значение:
//  Соответствие  из КлючИЗначение:
//   * Ключ - Строка.
//   * Значение - ПеречислениеСсылка.ТипыФормализованныхДокументов
Функция СоответствиеВидовРаспознаваемыхДокументов() Экспорт
	
	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить("ACT", Перечисления.ТипыФормализованныхДокументов.АктОбОказанииУслуг);
	СоответствиеТипов.Вставить("SCH", Перечисления.ТипыФормализованныхДокументов.СчетНаОплату);
	СоответствиеТипов.Вставить("SF", Перечисления.ТипыФормализованныхДокументов.СчетФактура);
	СоответствиеТипов.Вставить("TG12", Перечисления.ТипыФормализованныхДокументов.ТОРГ12);
	СоответствиеТипов.Вставить("UPD", Перечисления.ТипыФормализованныхДокументов.УПД);
	
	Возврат СоответствиеТипов;
	
КонецФункции

Функция КоэффициентУверенности()
	
	Возврат 0.7;
	
КонецФункции

#КонецОбласти