
#Область СхемыПроцессов

//++dar 25.02.26 (309302)

// Создает задачу обработки элемента схемы.
// 
// Параметры:
// 	НаименованиеЗадачи - Строка - наименование задачи.
//  Процесс - БизнесПроцессСсылка.КомплексныйПроцесс - процесс со схемой.
// 
// Возвращаемое значение:
// 	ЗадачаСсылка.ЗадачаИсполнителя
//
Функция УВМ_СоздатьЗадачуОбработкиЭлементаСхемы(НаименованиеЗадачи, Процесс, ОтправитьДоговорКонтрагенту = Ложь, СформироватьДоговорВЕРП = Ложь) Экспорт
	
	ЗадачаЭлементаСхемы = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		
	ЗадачаЭлементаСхемы.БизнесПроцесс = Процесс;
	ЗадачаЭлементаСхемы.ТочкаМаршрута = ТочкиМаршрута.ВыполнитьДействияПроцессаПоСхеме;
	ЗадачаЭлементаСхемы.Дата = ТекущаяДатаСеанса();
	ЗадачаЭлементаСхемы.Наименование = НаименованиеЗадачи;
	
	ЗадачаЭлементаСхемы.УВМ_ОтправитьДоговорКонтрагенту = ОтправитьДоговорКонтрагенту;//доп. строка
	ЗадачаЭлементаСхемы.УВМ_СформироватьДоговорВЕРП = СформироватьДоговорВЕРП;//доп. строка
	
	РаботаСКомплекснымиБизнесПроцессамиСерверПереопределяемый.
		СоздатьПроцессПоДействиюЗаполнениеВедущейЗадачи(Процесс, ЗадачаЭлементаСхемы);
	
	ЗадачаЭлементаСхемы.Записать();
		
	Возврат ЗадачаЭлементаСхемы.Ссылка;
	
КонецФункции

//--dar 25.02.26 (309302)

#КонецОбласти