 
#Область ПрограммныйИнтерфейс

//++dar 25.02.26 (309302)
&НаКлиенте
Процедура УВМ_ПрикрепитьФайлPDF(Документ) Экспорт
	
	АдресФайла = АБ_ВызовСервера.УВМ_ПолучитьИмяФайлаWord(Документ, КаталогВременныхФайлов());
	Результат = ПолучитьИзВременногоХранилища(АдресФайла);
	
	//++dar 02.06.26 (330921)
	Если Результат.Свойство("PDFСуществует") И Результат.PDFСуществует Тогда
		Возврат;
	КонецЕсли;	
	//--dar 02.06.26 (330921)
	
	Если ЗначениеЗаполнено(Результат.ПолноеИмяФайла) Тогда
		Результат.ДДФайла.Записать(Результат.ПолноеИмяФайла);
		ИмяВременногоФайлаPDF_A = СтрШаблон("%1%2.%3", КаталогВременныхФайлов(), Результат.НаименованиеФайла, "pdf");
		
		Попытка
			WordApp = Новый COMОбъект("Word.Application");
			DocApp = WordApp.Documents.Add(Результат.ПолноеИмяФайла);
			DocApp.ExportAsFixedFormat(ИмяВременногоФайлаPDF_A, 17);
			WordApp.Application.Quit();
			WordApp = Неопределено;
			
			УВМ_ПрикрепитьФайлНаКлиентеПоИмениФайла(Документ, ИмяВременногоФайлаPDF_A);
			
			УдалитьФайлы(ИмяВременногоФайлаPDF_A);
			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = СтрШаблон("Имя модуля:%1, исходная строка:%2, описание:%3, причина:%4", ИнформацияОбОшибке.ИмяМодуля, 
																			ИнформацияОбОшибке.ИсходнаяСтрока, 
																			ИнформацияОбОшибке.Описание, 
																			ИнформацияОбОшибке.Причина.Описание);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
		
		УдалитьФайлы(Результат.ПолноеИмяФайла);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УВМ_СформироватьИОтправитьПисьмаКлиентам(МассивДокументов) Экспорт
	
	ПисьмаИПолучатели = АБ_ВызовСервера.УВМ_ПолучателиПисем(МассивДокументов);
	
	//++dar 02.06.26 (330921)
	Для Каждого ТекущееПисьмо Из ПисьмаИПолучатели Цикл
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Основание", ТекущееПисьмо.Ключ);
		ПараметрыФормы.Вставить("УВМ_ДокументКонтрагента", ТекущееПисьмо.Ключ);
		ПараметрыФормы.Вставить("УВМ_ПолучателиПисьма", ТекущееПисьмо.Значение);
		
		ОткрытьФорму("Документ.ИсходящееПисьмо.ФормаОбъекта", ПараметрыФормы, , Новый УникальныйИдентификатор);
	КонецЦикла;
	//--dar 02.06.26 (330921)
	
КонецПроцедуры	
//--dar 25.02.26 (309302)

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++dar 25.02.26 (309302)
&НаКлиенте
Процедура УВМ_ПрикрепитьФайлНаКлиентеПоИмениФайла(Документ, ПолноеИмяФайла)
	
	ПараметрыДобавления = Новый Структура;
	ПараметрыДобавления.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
	ПараметрыДобавления.Вставить("ВладелецФайла", Документ);
	ПараметрыДобавления.Вставить("ДобавлениеОригинала", Ложь);
	ПараметрыДобавления.Вставить("РольФайла", АБ_ВызовСервера.УВМ_РольФайлаДоговор());
	
	ФормаВладелец = Новый Структура;
	ФормаВладелец.Вставить("ИмяФормы", "");
	ФормаВладелец.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
	ПараметрыДобавления.Вставить("ФормаВладелец", ФормаВладелец);
	
	Результат = РаботаСФайламиКлиент.ДобавитьИзФайловойСистемыСРасширениемСинхронно(ПараметрыДобавления);
	
КонецПроцедуры
//--dar 25.02.26 (309302)

#КонецОбласти
