 
#Область ПрограммныйИнтерфейс

//++dar 25.02.26 (309302)
&НаКлиенте
Процедура УВМ_ПрикрепитьФайлPDF(Документ) Экспорт
	
	АдресФайла = АБ_ВызовСервера.УВМ_ПолучитьИмяФайлаWord(Документ, КаталогВременныхФайлов());
	Результат = ПолучитьИзВременногоХранилища(АдресФайла);
	
	Если ЗначениеЗаполнено(Результат.ПолноеИмяФайла) Тогда
		Результат.ДДФайла.Записать(Результат.ПолноеИмяФайла);
		ИмяВременногоФайлаPDF_A = СтрШаблон("%1%2.%3", КаталогВременныхФайлов(), Результат.НаименованиеФайла, "pdf");
		
		Попытка
			WordApp = Новый COMОбъект("Word.Application");
			DocApp = WordApp.Documents.Add(Результат.ПолноеИмяФайла);
			DocApp.ExportAsFixedFormat(ИмяВременногоФайлаPDF_A, 17);
			WordApp.Application.Quit();
			WordApp = Неопределено;
			
			УВМ_ПрикрепитьФайлНаКлиентеПоИмениФайла(Документ, ИмяВременногоФайлаPDF_A);
			
			УдалитьФайлы(ИмяВременногоФайлаPDF_A);
			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = СтрШаблон("Имя модуля:%1, исходная строка:%2, описание:%3, причина:%4", ИнформацияОбОшибке.ИмяМодуля, 
																			ИнформацияОбОшибке.ИсходнаяСтрока, 
																			ИнформацияОбОшибке.Описание, 
																			ИнформацияОбОшибке.Причина.Описание);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
		
		УдалитьФайлы(Результат.ПолноеИмяФайла);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УВМ_СформироватьИОтправитьПисьмаКлиентам(МассивДокументов) Экспорт
	
	ПисьмаИПолучатели = АБ_ВызовСервера.УВМ_ПолучателиПисем(МассивДокументов);
	
	Для Каждого ТекущееПисьмо Из ПисьмаИПолучатели Цикл
		//создаем письмо
		ПараметрыФормы = Новый Структура("Основание", ТекущееПисьмо.Ключ);
		ТекФормаДокумента = ОткрытьФорму("Документ.ИсходящееПисьмо.ФормаОбъекта", ПараметрыФормы,, Новый УникальныйИдентификатор);
		
		ТекФормаДокумента.УВМ_ТекстПисьма = ТекФормаДокумента.ТекстПисьма;
		
		//вложения
		МсвУдалитьВложения = Новый Массив;
		Для Каждого ТекВложение Из ТекФормаДокумента.Вложения Цикл
			Если Прав(ТекВложение.Представление, 4) = ".pdf" Тогда
				Продолжить;
			КонецЕсли;
			МсвУдалитьВложения.Добавить(ТекВложение);
		КонецЦикла;                                  
		
		Для Каждого ТекВложение из МсвУдалитьВложения Цикл
			ТекФормаДокумента.Вложения.Удалить(ТекВложение);
		КонецЦикла;
		
		Если ТекФормаДокумента.Вложения.Количество() = 0 Тогда
			ТекФормаДокумента = Неопределено;
			Продолжить;
		КонецЕсли;
		
		//получатели
		ТекФормаДокумента.Получатели.Очистить();
		Для Каждого ТекПолучатель Из ТекущееПисьмо.Значение Цикл
			НовыйПолучатель = ТекФормаДокумента.Получатели.Добавить();
			НовыйПолучатель.ТипАдреса = ПредопределенноеЗначение("Перечисление.ТипыАдресатов.Кому");
			НовыйПолучатель.Представление = ТекПолучатель;
			НовыйПолучатель.Адрес = ТекПолучатель;
			НовыйПолучатель.Внешний = Истина;
			НовыйПолучатель.ВидМаршрутизации = ПредопределенноеЗначение("Перечисление.ВидыМаршрутизацииПисем.Внешняя");			
		КонецЦикла;
		
		ТекФормаДокумента.ПродолжениеОтправки0(Истина, Неопределено);
		ТекФормаДокумента = Неопределено;
		
	КонецЦикла;
	
КонецПроцедуры	
//--dar 25.02.26 (309302)

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++dar 25.02.26 (309302)
&НаКлиенте
Процедура УВМ_ПрикрепитьФайлНаКлиентеПоИмениФайла(Документ, ПолноеИмяФайла)
	
	ПараметрыДобавления = Новый Структура;
	ПараметрыДобавления.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
	ПараметрыДобавления.Вставить("ВладелецФайла", Документ);
	ПараметрыДобавления.Вставить("ДобавлениеОригинала", Ложь);
	ПараметрыДобавления.Вставить("РольФайла", АБ_ВызовСервера.УВМ_РольФайлаДоговор());
	
	ФормаВладелец = Новый Структура;
	ФормаВладелец.Вставить("ИмяФормы", "");
	ФормаВладелец.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
	ПараметрыДобавления.Вставить("ФормаВладелец", ФормаВладелец);
	
	Результат = РаботаСФайламиКлиент.ДобавитьИзФайловойСистемыСРасширениемСинхронно(ПараметрыДобавления);
	
КонецПроцедуры
//--dar 25.02.26 (309302)

#КонецОбласти
