// @strict-types


#Область ПрограммныйИнтерфейс

// Вызывается при создании на сервере карточки контрагента
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма карточки контрагента
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
Процедура КарточкаКонтрагентаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
// ХОЛД Начало
	РаботаСКонтрагентамиДокументооборотХолдинг.КарточкаКонтрагентаПриСозданииНаСервере(
		Форма, Отказ, СтандартнаяОбработка);
// ХОЛД Конец
	
КонецПроцедуры

// Вызывается при чтении на сервере карточки контрагента
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма карточки контрагента:
//    * Объект - СправочникОбъект.Контрагенты
//  ТекущийОбъект - СправочникОбъект.Контрагенты
//
Процедура КарточкаКонтрагентаПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
// ХОЛД Начало
	РаботаСКонтрагентамиДокументооборотХолдинг.КарточкаКонтрагентаПриЧтенииНаСервере(Форма, ТекущийОбъект);
// ХОЛД Конец
	
КонецПроцедуры

#КонецОбласти

