
&Вместо("ПолучитьОбзорДокумента")
Функция АБ_ПолучитьОбзорДокумента(Форма)
	Результат = ПродолжитьВызов(Форма);
	
	//++dar 23.04.26 (324174)                        
	СтрокаВставкаHTML = СтрШаблон("%1%2",АБ_ВызовСервера.ПолучитьТекстHTMLПоРеквизитамДоговораАренды(Форма.Объект.Ссылка),"</body>");
	Если ЗначениеЗаполнено(СтрокаВставкаHTML) Тогда
		Результат = СтрЗаменить(Результат,"</body>",СтрокаВставкаHTML);
	КонецЕсли;
	//--dar 23.04.26 (324174)
	
	// +++ Миляев (295800) 2026-01-23
	СтрокаВставкаHTML = СтрШаблон("%1%2",АБ_ВызовСервера.ПолучитьТекстHTMLПоВнешнимНавигационнымСсылкам(Форма.Объект.Ссылка),"</body>");	
	Результат = СтрЗаменить(Результат,"</body>",СтрокаВставкаHTML);
	// --- Миляев (295800) 2026-01-23
	Возврат Результат;
КонецФункции

