#Область ПрограммныйИнтерфейс

// Сбрасывает признак необходимости верификации реквизита.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
//  УстановленноеЗначение - ЛюбаяСсылка
//  ЭлементФормы - ПолеФормы
Процедура СброситьПризнакВерификации(ДокументСсылка, Знач ИмяРеквизита, Знач УстановленноеЗначение, ЭлементФормы) Экспорт
	
	Сброшен = Ложь;
	РаспознаваниеДокументовВызовСервера.СброситьПризнакВерификации(ДокументСсылка, ИмяРеквизита, 
		УстановленноеЗначение, Сброшен);
	Если Сброшен = Истина Тогда
		ЭлементФормы.ЦветФона = Новый Цвет();
		ЭлементФормы.ПодсказкаВвода = ""; 
	КонецЕсли;
	
КонецПроцедуры

// Сбрасывает признак необходимости верификации реквизита ТЧ.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
//  ТабличнаяЧасть - Строка
//  ТекущиеДанные - ДанныеФормыЭлементКоллекции
Процедура СброситьПризнакВерификацииТЧ(ДокументСсылка, Знач ИмяРеквизита, Знач ТабличнаяЧасть, ТекущиеДанные) Экспорт
	
	УстановленноеЗначение = ТекущиеДанные[ИмяРеквизита];     
	НомерСтроки = ТекущиеДанные.НомерСтроки;  
	
	РаспознаваниеДокументовВызовСервера.СброситьПризнакВерификацииТЧ(ДокументСсылка, ИмяРеквизита, УстановленноеЗначение, 
		ТабличнаяЧасть, НомерСтроки); 
		
	ТекущиеДанные.НеобходимаВерификация = СтрЗаменить(ТекущиеДанные.НеобходимаВерификация, ИмяРеквизита, "");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак необходимости проверки.
// 
// Параметры:
//  ВерифицированныеРеквизиты - ТаблицаЗначений
// 
// Возвращаемое значение:
//  Булево
Функция ТребуетПроверки(Знач ВерифицированныеРеквизиты) Экспорт
	
	ТребуетПроверки = Ложь;
			
	Для Каждого Стр Из ВерифицированныеРеквизиты Цикл
		
		Если Стр.Проверен = Ложь Тогда
			ТребуетПроверки = Истина;
		    Прервать;
		КонецЕсли;
		
	КонецЦикла;
			
	Возврат ТребуетПроверки;
	
КонецФункции

#КонецОбласти