
&ИзменениеИКонтроль("ПолучитьДанныеФайловДляСписка")
Функция АБ_ПолучитьДанныеФайловДляСписка(Файлы, ВладелецФайла, ПоказыватьУдаленныеФайлы, ОтметитьЗахваченныеФайлы, МассивКомбинацийРолей, ЗаполнятьДанныеДляВизуализации, ВидДокумента)

	МассивКомбинацийРолей = Новый Массив;

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Файлы.Наименование КАК Наименование,
	|	Файлы.ВерсияДанных КАК ВерсияДанных,
	|	ПОДСТРОКА(Файлы.Описание, 0, 140) КАК Описание,
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.ВладелецФайла КАК ВладелецФайла,
	|	Файлы.ДатаСоздания КАК ДатаСоздания,
	|	Файлы.Автор КАК Автор,
	|	Файлы.Редактирует КАК Редактирует,
	|	Файлы.ХранитьВерсии КАК ХранитьВерсии,
	|	Файлы.ПометкаУдаления КАК ПометкаУдаления,
	|	Файлы.ТекущаяВерсияРазмер / 1024 КАК ТекущаяВерсияРазмер,
	|	Файлы.ТекущаяВерсияДатаСоздания КАК ТекущаяВерсияДатаСоздания,
	|	Файлы.ТекущаяВерсияАвтор КАК ТекущаяВерсияАвтор,
	|	ВЫБОР
	|		КОГДА Файлы.ПометкаУдаления
	|			ТОГДА Файлы.ИндексКартинки + 1
	|		ИНАЧЕ Файлы.ИндексКартинки
	|	КОНЕЦ КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА Файлы.Редактирует В (&ПользовательИЕгоСотрудники)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РедактируетТекущийПользователь,
	|	Файлы.ТекущаяВерсияРасширение КАК Расширение,
	|	Файлы.ТекущаяВерсияРасширение КАК ТекущаяВерсияРасширение,
	|	Файлы.ПодписанЭП КАК ПодписанЭП,
	|	ВЫБОР
	|		КОГДА Файлы.Зашифрован
	|			ТОГДА ВЫБОР
	|				КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписиНет)
	|					ТОГДА 0
	|				КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьНеПроверена)
	|					ТОГДА 2
	|				КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьДействительна)
	|					ТОГДА 4
	|				КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьНедействительна)
	|					ТОГДА 6
	|				ИНАЧЕ ВЫБОР
	|					КОГДА Файлы.ПодписанЭП
	|						ТОГДА 2
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписиНет)
	|				ТОГДА -1
	|			КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьНеПроверена)
	|				ТОГДА 1
	|			КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьДействительна)
	|				ТОГДА 3
	|			КОГДА КешИнформацииОбОбъектах.СтатусЭП = ЗНАЧЕНИЕ(Перечисление.СтатусПроверкиЭП.ПодписьНедействительна)
	|				ТОГДА 5
	|			ИНАЧЕ ВЫБОР
	|				КОГДА Файлы.ПодписанЭП
	|					ТОГДА 1
	|				ИНАЧЕ -1
	|			КОНЕЦ
	|		КОНЕЦ
	|	КОНЕЦ КАК СтатусПроверкиЭП,
	|	Файлы.Зашифрован КАК Зашифрован,
	|	ВЫБОР
	|		КОГДА Файлы.ШаблонОснованиеДляСоздания = ЗНАЧЕНИЕ(Справочник.Файлы.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СозданИзШаблона,
	|	ЕСТЬNULL(СведенияОФайлахДокументооборот.ЯвляетсяОригиналом, ЛОЖЬ) КАК Оригинал,
	#Вставка
	//++dar 11.03.26 (309302)
	|	ЕСТЬNULL(СведенияОФайлахДокументооборот.УВМ_ЯвляетсяКопией, ЛОЖЬ) КАК УВМ_ЯвляетсяКопией,
	//--dar 11.03.26 (309302)
	#КонецВставки
	|	ЕСТЬNULL(СведенияОФайлахДокументооборот.ПорядковыйНомерВложения, 0) КАК ПорядковыйНомерВложения,
	|	ЕСТЬNULL(ФайлыСозданныеПоШаблону.СозданПоШаблону, ЛОЖЬ) КАК СозданПоШаблонуДокумента,
	|	ЕСТЬNULL(НастройкиЗаполнения.Условие, ЗНАЧЕНИЕ(Справочник.АлгоритмыПроверки.ПустаяСсылка)) КАК Условие,
	|	0 КАК НомерРоли,
	|	НЕ (ПредпросмотрФайлов.Файл Есть NULL) КАК ПредпросмотрЕстьВБазе,
	|	ЕСТЬNULL(ТаймлистДанныеРаботыСервиса.Статус, ЗНАЧЕНИЕ(Перечисление.ТаймлистСтатусы.ПустаяСсылка)) КАК ТаймлистСтатус,
	|	ЕСТЬNULL(ТаймлистДанныеРаботыСервиса.СледующиеШаги, """") КАК ТаймлистСледующиеШаги,
	|	ЕСТЬNULL(ТаймлистФайлыВОбработке.Задание, ЗНАЧЕНИЕ(Перечисление.ТаймлистТипыЗаданий.ПустаяСсылка)) КАК ТаймлистЗадание,
	|	ЕСТЬNULL(ТекстыВерсийФайлов.СтатусРаспознаванияТекста, ЗНАЧЕНИЕ(Перечисление.СтатусыРаспознаванияТекста.ПустаяСсылка)) КАК СтатусРаспознаванияТекста
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФайлыСозданныеПоШаблону КАК ФайлыСозданныеПоШаблону
	|		ПО (ФайлыСозданныеПоШаблону.Файл = Файлы.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныДокументов.ПравилаАвтозаполнения КАК НастройкиЗаполнения
	|		ПО Файлы.ШаблонОснованиеДляСоздания = НастройкиЗаполнения.ШаблонФайла
	|		ИЛИ Файлы.Ссылка = НастройкиЗаполнения.ШаблонФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОФайлахДокументооборот КАК СведенияОФайлахДокументооборот
	|		ПО (СведенияОФайлахДокументооборот.Файл = Файлы.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КешИнформацииОбОбъектах КАК КешИнформацииОбОбъектах
	|		ПО Файлы.Ссылка = КешИнформацииОбОбъектах.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
	|		ПО (СлужебныеФайлыДокументов.Файл = Файлы.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредпросмотрФайлов КАК ПредпросмотрФайлов
	|		ПО (ПредпросмотрФайлов.Файл = Файлы.Ссылка
	|		И ПредпросмотрФайлов.ВерсияФайла = Файлы.ТекущаяВерсия И ПредпросмотрФайлов.НомерБлока = 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймлистДанныеРаботыСервиса КАК ТаймлистДанныеРаботыСервиса
	|		ПО (ТаймлистДанныеРаботыСервиса.ВерсияФайла = Файлы.ТекущаяВерсия)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймлистФайлыВОбработке КАК ТаймлистФайлыВОбработке
	|		ПО (ТаймлистФайлыВОбработке.ВерсияФайла = Файлы.ТекущаяВерсия)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекстыВерсийФайлов КАК ТекстыВерсийФайлов
	|		ПО (ТекстыВерсийФайлов.Версия = Файлы.ТекущаяВерсия)
	|ГДЕ
	|	Файлы.Ссылка В(&Файлы)
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");

	Если Файлы = Неопределено Тогда
		Если ПоказыватьУдаленныеФайлы Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"Файлы.Ссылка В(&Файлы)", "Файлы.ВладелецФайла = &ВладелецФайла И СлужебныеФайлыДокументов.Файл ЕСТЬ NULL");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"Файлы.Ссылка В(&Файлы)", "Файлы.ВладелецФайла = &ВладелецФайла И НЕ Файлы.ПометкаУдаления И СлужебныеФайлыДокументов.Файл ЕСТЬ NULL");
		КонецЕсли;
		Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	Иначе
		Запрос.УстановитьПараметр("Файлы", Файлы);
	КонецЕсли;
	ПользовательИЕгоСотрудники = СотрудникиВызовСервера.ПользовательИЕгоСотрудники(Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("ПользовательИЕгоСотрудники", ПользовательИЕгоСотрудники);

	ТаблицаФайлов = Запрос.Выполнить().Выгрузить();

	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.РолиФайлов"));
	ТаблицаФайлов.Колонки.Добавить("РольФайла", Новый ОписаниеТипов(Массив));
	#Вставка
	//++dar 16.04.26 (323545)
	ТаблицаФайлов.Колонки.Добавить("УВМ_ЕстьКопия", УВМ_РаботаСФормами.ОписаниеТипаБулево());
	ТаблицаФайлов.Колонки.Добавить("УВМ_ЕстьОригинал", УВМ_РаботаСФормами.ОписаниеТипаБулево());
	//--dar 16.04.26 (323545)
	#КонецВставки

	Массив = Новый Массив;
	Массив.Добавить(Тип("СписокЗначений"));
	ТаблицаФайлов.Колонки.Добавить("РолиФайлов", Новый ОписаниеТипов(Массив));

	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Файлы"));
	ТаблицаФайлов.Колонки.Добавить("ФайлВизуализации", Новый ОписаниеТипов(Массив));

	Массив = Новый Массив;
	Массив.Добавить(Тип("Булево"));
	ТаблицаФайлов.Колонки.Добавить("ФайлВизуализацииЗанятМной", Новый ОписаниеТипов(Массив));

	Если ОтметитьЗахваченныеФайлы Тогда
		ТаблицаФайлов.Колонки.Добавить("ПолноеИмяФайлаВРабочемКаталоге", Новый ОписаниеТипов("Строка"));
		ТаблицаФайлов.Колонки.Добавить("ДатаМодификацииУниверсальнаяВБазе", Новый ОписаниеТипов("Дата"));

		Для Каждого ФайлыПисьмаСтрока Из ТаблицаФайлов Цикл

			Если ФайлыПисьмаСтрока.РедактируетТекущийПользователь = Истина
				И ЗначениеЗаполнено(ФайлыПисьмаСтрока.Ссылка) Тогда

				ДанныеФайла = РаботаСФайламиВызовСервера.ДанныеФайла(ФайлыПисьмаСтрока.Ссылка);
				ФайлыПисьмаСтрока.ПолноеИмяФайлаВРабочемКаталоге = ДанныеФайла.ПолноеИмяФайлаВРабочемКаталоге;
				ФайлыПисьмаСтрока.ДатаМодификацииУниверсальнаяВБазе = ДанныеФайла.ДатаМодификацииУниверсальная;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;

	Если ЗаполнятьДанныеДляВизуализации Тогда

		ДокументПодписан = Ложь;
		Если Не ЗначениеЗаполнено(ВладелецФайла) И ТаблицаФайлов.Количество() <> 0 Тогда
			ВладелецФайла = ТаблицаФайлов[0].ВладелецФайла;
		КонецЕсли;

		Если ЗначениеЗаполнено(ВладелецФайла) Тогда
			ДокументПодписан = ДействияСервер.ДокументПодписан(ВладелецФайла);
		КонецЕсли;

		Для Каждого ФайлыПисьмаСтрока Из ТаблицаФайлов Цикл
			// Заполним данные для файла визуализации.

			Если (ФайлыПисьмаСтрока.ПодписанЭП = Истина Или ДокументПодписан)
				И ЗначениеЗаполнено(ФайлыПисьмаСтрока.Ссылка) Тогда

				Если РаботаСФайламиКлиентСервер.ЭтоРасширениеДляАвтовизуализации(ФайлыПисьмаСтрока.Расширение) Тогда

					ФайлыПисьмаСтрока.ФайлВизуализации = РегистрыСведений.СлужебныеФайлыДокументов.ПолучитьСлужебныйФайл(
					ФайлыПисьмаСтрока.ВладелецФайла,
					ФайлыПисьмаСтрока.Ссылка,
					Перечисления.ОтношенияСлужебныхФайлов.ВизуализацияЭП);
					Если ЗначениеЗаполнено(ФайлыПисьмаСтрока.ФайлВизуализации) Тогда
						Редактирует = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
						ФайлыПисьмаСтрока.ФайлВизуализации, "Редактирует");
						ФайлыПисьмаСтрока.ФайлВизуализацииЗанятМной =
						(ПользовательИЕгоСотрудники.Найти(Редактирует) <> Неопределено);
					КонецЕсли;

				КонецЕсли;

			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	ИспользованныеРоли = Новый Соответствие;

	Если ЗначениеЗаполнено(ВладелецФайла) И ДелопроизводствоКлиентСервер.ЭтоДокумент(ВладелецФайла) Тогда

		КэшДокументыПредприятияФормаЭлемента = КэшиНаВремяВызоваПовтИсп.КэшДокументыПредприятияФормаЭлемента();
		Если КэшДокументыПредприятияФормаЭлемента.Инициализирован
			И КэшДокументыПредприятияФормаЭлемента.КэшДокумента.Ссылка = ВладелецФайла Тогда
			ВидДокумента = КэшДокументыПредприятияФормаЭлемента.КэшДокумента.ВидДокумента;
			РолиФайлов = КэшДокументыПредприятияФормаЭлемента.КэшВидаДокумента.РолиФайлов;
		Иначе
			Если ВидДокумента = Неопределено Тогда
				ВидДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецФайла, "ВидДокумента");
			КонецЕсли;
			РолиФайлов = РолиФайловДляВидаДокументов(ВидДокумента);
		КонецЕсли;

		Порядок = 0;
		Для Каждого Стр Из РолиФайлов Цикл
			ИспользованныеРоли.Вставить(Стр.Роль, 1);
			МассивКомбинацийРолей.Добавить(Новый Структура("Роль, Обязательная", Стр.Роль, Стр.Обязательная));
		КонецЦикла;

	КонецЕсли;

	// Прочитаем РолиФайловДокументов для массива файлов.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РолиФайловДокументов.Файл КАК Файл,
	#Вставка
	//++dar 16.04.26 (323545)
	|	РолиФайловДокументов.Роль.УВМ_ЕстьКопия КАК УВМ_ЕстьКопия,
	|	РолиФайловДокументов.Роль.УВМ_ЕстьОригинал КАК УВМ_ЕстьОригинал,
	//--dar 16.04.26 (323545)
	#КонецВставки
	|	РолиФайловДокументов.Роль КАК Роль
	|ИЗ
	|	РегистрСведений.РолиФайловДокументов КАК РолиФайловДокументов
	|ГДЕ
	|	РолиФайловДокументов.Файл В(&Файлы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Файл");
	Запрос.УстановитьПараметр("Файлы", ТаблицаФайлов.ВыгрузитьКолонку("Ссылка"));
	ТаблРоли = Запрос.Выполнить().Выгрузить();

	ТаблРолиКопия = ТаблРоли.Скопировать();
	ТаблРолиКопия.Свернуть("Роль");
	Для Каждого Стр Из ТаблРолиКопия Цикл
		Если ИспользованныеРоли.Получить(Стр.Роль) = Неопределено Тогда
			ИспользованныеРоли.Вставить(Стр.Роль, 1);
			МассивКомбинацийРолей.Добавить(Новый Структура("Роль, Обязательная", Стр.Роль, Ложь));
		КонецЕсли;
	КонецЦикла;

	ЕстьНепустыеРоли = (ТаблРоли.Количество() <> 0)
	Или (МассивКомбинацийРолей.Количество() <> 0);

	ДобавленаВеткаБезРоли = Ложь;

	// Заполним у файлов (ТаблицаФайлов) РольФайла.
	Для Каждого ФайлыПисьмаСтрока Из ТаблицаФайлов Цикл

		ПараметрыОтбора = Новый Структура("Файл", ФайлыПисьмаСтрока.Ссылка);
		СтрокиРолей = ТаблРоли.НайтиСтроки(ПараметрыОтбора);

		Если СтрокиРолей.Количество() <> 0 Тогда

			ТекРоль = СтрокиРолей[0].Роль;
			ФайлыПисьмаСтрока.РольФайла = ТекРоль;
			#Вставка
			//++dar 16.04.26 (323545)
			ФайлыПисьмаСтрока.УВМ_ЕстьКопия = СтрокиРолей[0].УВМ_ЕстьКопия;
			ФайлыПисьмаСтрока.УВМ_ЕстьОригинал = СтрокиРолей[0].УВМ_ЕстьОригинал;
			//--dar 16.04.26 (323545)
			#КонецВставки

		Иначе // Создадим ветку для файлов без ролей.

			Если ЕстьНепустыеРоли И Не ДобавленаВеткаБезРоли Тогда

				ДобавленаВеткаБезРоли = Истина;

				МассивКомбинацийРолей.Добавить(
				Новый Структура("Роль, Обязательная", Справочники.РолиФайлов.ПустаяСсылка(), Ложь));

				ФайлыПисьмаСтрока.РольФайла = Справочники.РолиФайлов.ПустаяСсылка();

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	ТаблицаФайлов.Сортировать("НомерРоли, ПорядковыйНомерВложения, Наименование");

	Возврат ТаблицаФайлов;

КонецФункции

&ИзменениеИКонтроль("СохранитьСведенияОбОригиналахФайловИзКарточки")
Процедура АБ_СохранитьСведенияОбОригиналахФайловИзКарточки(Файлы, Документ, ОригиналПолученУстановленоВручную)

	УстановитьПривилегированныйРежим(Истина);

	Если Не ПолучитьФункциональнуюОпцию("ВестиУчетСканКопийОригиналовДокументов") Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		Для Каждого Строка Из Файлы.ПолучитьЭлементы() Цикл			
			Если Не Строка.ЭтоРольФайла И Не Строка.ЭтоДокументЭДО Тогда
				РегистрыСведений.СведенияОФайлахДокументооборот.УстановитьПризнак(
				Строка.Ссылка, "ЯвляетсяОригиналом", Строка.Оригинал);
				#Вставка
				//++dar 11.03.26 (309302)
				РегистрыСведений.СведенияОФайлахДокументооборот.УстановитьПризнак(
				Строка.Ссылка, "УВМ_ЯвляетсяКопией", Строка.УВМ_ЯвляетсяКопией);
				//--dar 11.03.26 (309302)
				#КонецВставки
			Иначе
				Для Каждого Подстрока Из Строка.ПолучитьЭлементы() Цикл
					РегистрыСведений.СведенияОФайлахДокументооборот.УстановитьПризнак(
					Подстрока.Ссылка, "ЯвляетсяОригиналом", Подстрока.Оригинал);
					#Вставка
					//++dar 11.03.26 (309302)
					РегистрыСведений.СведенияОФайлахДокументооборот.УстановитьПризнак(
					Подстрока.Ссылка, "УВМ_ЯвляетсяКопией", Подстрока.УВМ_ЯвляетсяКопией);
					//--dar 11.03.26 (309302)
					#КонецВставки
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		#Вставка
		//++dar 11.03.26 (309302) Удалим помеченые файлы из регистра
		АБ_ВызовСервера.УВМ_УдалитьПомеченныеФайлыИзСведений(Документ);
		//--dar 11.03.26 (309302)
		#КонецВставки
		ЗаписатьСодержитОригиналВРегистр(Файлы, Документ, ОригиналПолученУстановленоВручную);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

&ИзменениеИКонтроль("УстановитьДоступностьПоСостоянию")
Процедура АБ_УстановитьДоступностьПоСостоянию(Форма, Ссылка, ОбщиеДоступныеПоля, ОбщиеНедоступныеПоля)

	УстановитьПривилегированныйРежим(Истина);

	ОбщиеДоступныеПоля = "";
	ОбщиеНедоступныеПоля = "";

	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСостоянияДокументов") Тогда 
		Возврат;
	КонецЕсли;	

	Если ПолучитьФункциональнуюОпцию("ОграничиватьДоступностьПолейПоСостоянию") Тогда  

		Если ЗначениеЗаполнено(Ссылка) Тогда 
			ДокументОбъект = Ссылка.ПолучитьОбъект();
		Иначе	
			ДокументОбъект = Форма.РеквизитФормывЗначение("Объект");
		КонецЕсли;

		ДоступныеПоля = Новый Массив;
		НедоступныеПоля = Новый Массив;

		ПолучитьДоступныеИНедоступныеПоСостояниюПоля(ДокументОбъект, ДоступныеПоля, НедоступныеПоля);

		ИменаПолейИКомандДляНастройкиДоступности = ПолучитьИменаПолейИКомандДляНастройкиДоступности();	

		СтруктураРеквизитов = Новый Структура("Свойства_ИспользоватьДопРеквизиты", Ложь);
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Форма);
		Если СтруктураРеквизитов.Свойства_ИспользоватьДопРеквизиты = Истина Тогда 
			Для каждого ОписаниеСвойства Из Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
				Строка = ИменаПолейИКомандДляНастройкиДоступности.Добавить();
				Строка.ИмяПоляКоманды = "Ad." + XMLСтрока(ОписаниеСвойства.Свойство);
				Строка.ИменаПолейНаФорме = ОписаниеСвойства.ИмяРеквизитаЗначение;
				Строка.ИмяГруппыПоляКоманды = "ДопРеквизиты";
			КонецЦикла;
		КонецЕсли;

		ОбщиеНедоступныеПоля = Новый Структура;
		ОбщиеДоступныеПоля = Новый Структура;
		Для Каждого НастройкаПоля Из ИменаПолейИКомандДляНастройкиДоступности Цикл

			Если НастройкаПоля.ИмяПоляКоманды = "ДопРеквизиты" Тогда
				Продолжить;
			КонецЕсли;

			СтруктураПолей = Новый Структура(НастройкаПоля.ИменаПолейНаФорме);
			Для Каждого Поле Из СтруктураПолей Цикл
				ЭлементФормы = Форма.Элементы.Найти(Поле.Ключ);
				Если ЭлементФормы = Неопределено Тогда 

					Если Поле.Ключ = "ОтменяетДокументы" Тогда
						ОбщиеНедоступныеПоля.Вставить(Поле.Ключ);
					КонецЕсли;	

					Продолжить;
				КонецЕсли;

				Если ДоступныеПоля.Найти(НастройкаПоля.ИмяПоляКоманды) <> Неопределено
					Или ЗначениеЗаполнено(НастройкаПоля.ИмяГруппыПоляКоманды) И ДоступныеПоля.Найти(НастройкаПоля.ИмяГруппыПоляКоманды) <> Неопределено Тогда
					ОбщиеДоступныеПоля.Вставить(Поле.Ключ);
					Доступность = Истина;
				Иначе
					ОбщиеНедоступныеПоля.Вставить(Поле.Ключ);
					Доступность = Ложь;
				КонецЕсли;

				Если ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") Тогда 
					ЭлементФормы.Доступность = Доступность;
				Иначе
					ЭлементФормы.ТолькоПросмотр = Не Доступность;
				КонецЕсли;

			КонецЦикла;

		КонецЦикла;

		Если ДоступныеПоля.Найти("ДобавлениеОригиналов") <> Неопределено Тогда 
			ОбщиеДоступныеПоля.Вставить("СоздатьФайлОригинал");
		КонецЕсли;

		Если ДоступныеПоля.Найти("ДобавлениеФайлов") <> Неопределено Тогда 
			ОбщиеДоступныеПоля.Вставить("СоздатьФайлОбычный");
		КонецЕсли;

		Если ОбщиеНедоступныеПоля.Свойство("Редактировать") = Истина Тогда 
			ОбщиеНедоступныеПоля.Вставить("МенятьРолиФайловДрагДропом");
		КонецЕсли;

		Если ПолучитьФункциональнуюОпцию("ВестиУчетСканКопийОригиналовДокументов") Тогда 
			// поле Оригинал
			ДоступностьПоляОригинал = ОбщиеДоступныеПоля.Свойство("СоздатьФайлОригинал") И ОбщиеДоступныеПоля.Свойство("СоздатьФайлОбычный");

			Если Форма.Элементы.Найти("Оригинал") <> Неопределено Тогда 
				Форма.Элементы["Оригинал"].ТолькоПросмотр = Не ДоступностьПоляОригинал;
			КонецЕсли;	

			Если Форма.Элементы.Найти("ОригиналСоздание") <> Неопределено Тогда 
				Форма.Элементы["ОригиналСоздание"].ТолькоПросмотр = Не ДоступностьПоляОригинал;
			КонецЕсли;
			#Вставка
			//++dar 11.03.26 (309302)
			Если Форма.Элементы.Найти("УВМ_ЯвляетсяКопией") <> Неопределено Тогда 
				Форма.Элементы["УВМ_ЯвляетсяКопией"].ТолькоПросмотр = Не ДоступностьПоляОригинал;
			КонецЕсли;	

			Если Форма.Элементы.Найти("УВМ_ЯвляетсяКопиейСоздание") <> Неопределено Тогда 
				Форма.Элементы["УВМ_ЯвляетсяКопиейСоздание"].ТолькоПросмотр = Не ДоступностьПоляОригинал;
			КонецЕсли;
			//--dar 11.03.26 (309302)
			#КонецВставки
		КонецЕсли;	

		// список файлов
		Если ОбщиеДоступныеПоля.Количество() = 0 И ОбщиеНедоступныеПоля.Количество() = 0 Тогда 

			Если Форма.Элементы.Найти("Файлы") <> Неопределено Тогда 
				Форма.Элементы["Файлы"].ИзменятьСоставСтрок = Истина;
			КонецЕсли;	

			Если Форма.Элементы.Найти("ФайлыСоздание") <> Неопределено Тогда 
				Форма.Элементы["ФайлыСоздание"].ИзменятьСоставСтрок = Истина;
			КонецЕсли;	

		КонецЕсли;

	КонецЕсли;

	// доступность поля состояние зависит от настройки
	Если Форма.Элементы.Найти("СостояниеТекст") <> Неопределено Тогда 

		Если (Не Константы.РазрешитьРучноеИзменениеСостоянияДокументов.Получить() 
			И ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи"))
			Или (ДоступныеПоля <> Неопределено И ДоступныеПоля.Найти("Состояние") = Неопределено)
			Или (НедоступныеПоля <> Неопределено И НедоступныеПоля.Найти("Состояние") <> Неопределено) Тогда 
			Форма.Элементы.СостояниеТекст.ТолькоПросмотр = Истина;
			Форма.ЗапретитьРучноеИзменениеСостоянияДокументов = Истина;
		КонецЕсли;

		Если Форма.Элементы.СостояниеТекст.ТолькоПросмотр Тогда 
			Форма.Элементы.СостояниеТекст.КнопкаВыбора = Ложь;
			Форма.Элементы.СостояниеТекст.КнопкаОткрытия = Истина;
		Иначе
			Форма.Элементы.СостояниеТекст.КнопкаВыбора = Истина;
			Форма.Элементы.СостояниеТекст.КнопкаОткрытия = Ложь;
		КонецЕсли;

	КонецЕсли;

	// Доступность самого поля ДелаетНедействующимиСтрока зависит от настройки.
	Если Форма.Элементы.Найти("ДелаетНедействующимиСтрока") <> Неопределено Тогда 

		Если (ДоступныеПоля <> Неопределено И ДоступныеПоля.Найти("ОтменяетДокументы") = Неопределено)
			Или (НедоступныеПоля <> Неопределено И НедоступныеПоля.Найти("ОтменяетДокументы") <> Неопределено) Тогда 

			Попытка
				Форма.ЗапретитьМенятьСписокОтменяемыхДокументов = Истина;
			Исключение
			КонецПопытки;

		Иначе	

			Попытка
				Форма.ЗапретитьМенятьСписокОтменяемыхДокументов = Ложь;
			Исключение
			КонецПопытки;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&После("ПолучитьДоступныеИНедоступныеПоСостояниюПоля")
Процедура АБ_ПолучитьДоступныеИНедоступныеПоСостояниюПоля(ДокументОбъект, ДоступныеПоля, НедоступныеПоля)
	//++dar 07.05.26 (326008)	
	Если ЗначениеЗаполнено(ДокументОбъект.Тематика) Тогда
		УВМ_ФормаКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Тематика, "УВМ_ФормаКонтрагента");
		Если УВМ_ФормаКонтрагента Тогда
			ПолеТипНеустойки = "УВМ_ТипНеустойки";
			// Добавляем в доступные
			Если ДоступныеПоля.Найти(ПолеТипНеустойки) = Неопределено Тогда 
				ДоступныеПоля.Добавить(ПолеТипНеустойки);
			КонецЕсли;
			// Удаляем из недоступных, если оно там было
			Поз = НедоступныеПоля.Найти(ПолеТипНеустойки);
			Если Поз <> Неопределено Тогда 
				НедоступныеПоля.Удалить(Поз);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//--dar 07.05.26 (326008)	
КонецПроцедуры
