
// @strict-types

#Область ОбработчикиСобытий

// Обработчик команды.
//
// Параметры:
//	ПараметрКоманды - СправочникСсылка.УзлыКОД - Узел обмена данными.
//	ПараметрыВыполненияКоманды - Структура Из КлючИЗначение - Параметры выполнения команды.
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОстановкиВозобновления = ПараметрыОстановкиВозобновленияОбмена();
	ПараметрыОстановкиВозобновления.Узел = ПараметрКоманды;
	ПараметрыОстановкиВозобновления.Направление =
		ПредопределенноеЗначение("Перечисление.НаправленияПотоковКОД.Получение");
	
	Если ПолучениеДанныхОстановлено(ПараметрКоманды) Тогда
		ПараметрыОстановкиВозобновления.Остановлен = Ложь;
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ОстановитьВозобновитьОперативноеПолучениеЗавершение", ЭтотОбъект, ПараметрыОстановкиВозобновления);
		
		ОбщегоНазначенияДокументооборотКлиент.ПоказатьВопросДаНет(
			ОписаниеОповещения,
			СтрШаблон(НСтр("ru = 'Возобновить получение оперативных данных из узла ""%1""?'"), ПараметрКоманды));
	Иначе
		ПараметрыОстановкиВозобновления.Остановлен = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ОстановитьВозобновитьОперативноеПолучениеЗавершение", ЭтотОбъект, ПараметрыОстановкиВозобновления);
		
		ОбщегоНазначенияДокументооборотКлиент.ПоказатьВопросДаНет(
			ОписаниеОповещения,
			СтрШаблон(НСтр("ru = 'Остановить получение оперативных данных из узла ""%1""?'"), ПараметрКоманды));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор параметров остановки обмена данными.
//
// Возвращаемое значение:
//	см. КОДСервер.ПараметрыОстановкиВозобновленияОбмена.
//
&НаСервере
Функция ПараметрыОстановкиВозобновленияОбмена()
	
	Возврат КОДСервер.ПараметрыОстановкиВозобновленияОбмена();
	
КонецФункции

// Выполняет установку/снятие признака остановки обмена данными по направлению.
//
// Параметры:
//	Результат - КодВозвратаДиалога - Результат выбора пользователя.
//	Параметры - см. ПараметрыОстановкиВозобновленияОбмена.
//
&НаКлиенте
Процедура ОстановитьВозобновитьОперативноеПолучениеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОстановитьВозобновитьПолучениеДанных(Параметры);
		Оповестить("КОД_ИзменениеСтатусаОстановлен", Параметры.Узел);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет остановку получения данных из указанного узла.
//
// Параметры:
//	Параметры - см. ПараметрыОстановкиВозобновленияОбмена.
//
&НаСервере
Процедура ОстановитьВозобновитьПолучениеДанных(Параметры)
	
	КОДСервер.ОстановитьВозобновитьОбменДанными(Параметры);
	
КонецПроцедуры

// Определяет остановлено ли получение данных из указанного узла.
//
// Параметры:
//	Узел - СправочникСсылка.УзлыКОД - Узел обмена данными.
//
// Возвращаемое значение:
//	Булево - Истина, если получение данных приостановлено.
//
&НаСервере
Функция ПолучениеДанныхОстановлено(Узел)
	
	Возврат РегистрыСведений.СостоянияУзловКОД.ОбменСУзломОстановлен(
		Узел, Перечисления.НаправленияПотоковКОД.Получение);
	
КонецФункции

#КонецОбласти
