// @strict-types


#Область ПрограммныйИнтерфейс

#Область УчетныеЗаписиЭДО

// Вызывается при создании на сервере карточки учетной записи ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма карточки учетной записи
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура УчетнаяЗаписьЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.УчетнаяЗаписьЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.УчетнаяЗаписьЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
// ХОЛД Конец
	
КонецПроцедуры

// Вызывается при чтении на сервере карточки учетной записи ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма карточки учетной записи
//  ТекущийОбъект - РегистрСведенийМенеджерЗаписи
//
Процедура УчетнаяЗаписьЭДОПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.УчетнаяЗаписьЭДОПриЧтенииНаСервере(Форма, ТекущийОбъект);
// ХОЛД Конец
	
КонецПроцедуры

// Вызывается при создании на сервере формы списка учетных записей ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура УчетнаяЗаписьЭДОФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.УчетнаяЗаписьЭДОФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеДокументыЭДО

// Вызывается при настройки видимости действий исходящего документа ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ЭлектронныйДокументИсходящийЭДОПриНастройкеВидимостиДействий(Форма) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ЭлектронныйДокументИсходящийЭДОПриНастройкеВидимостиДействий(Форма);
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.ЭлектронныйДокументИсходящийЭДОПриНастройкеВидимостиДействий(Форма);
// ХОЛД Конец
	
	ОбменЭДОДокументооборот.ПриНастройкеВидимостиФормыИсходящегоЭДО(Форма);
	
КонецПроцедуры

// Вызывается при настройки видимости действий исходящего документа ЭДО
// 
// Параметры:
//  Объект - ДокументОбъект.ЭлектронныйДокументВходящийЭДО
//  ТолькоПросмотр - Булево
//
Процедура ЭлектронныйДокументВходящийЭДОПриНастройкеВидимостиДействий(Объект, ТолькоПросмотр) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ЭлектронныйДокументВходящийЭДОПриНастройкеВидимостиДействий(ТолькоПросмотр);
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.ЭлектронныйДокументВходящийЭДОПриНастройкеВидимостиДействий(Объект);
// ХОЛД Конец
	
КонецПроцедуры

// Вызывается при определении доступных по ЭДО действий для документа ЭДО
// 
// Параметры:
//  СостояниеДокумента - ПеречислениеСсылка.СостоянияДокументовЭДО - Состояние электронного документа.
//  СвойстваДокумента - ДокументОбъект.ЭлектронныйДокументВходящийЭДО, ДокументОбъект.ЭлектронныйДокументИсходящийЭДО, Структура - Свойства:
//    * Ссылка - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Ссылка на электронный документ.
//    * НаОзнакомлении - Булево - Признак необходимости ознакомиться с электронным документом.
//    * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД - Способ обмена электронным документом.
//    * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//  Действия - Соответствие Из КлючИЗначение:
//    * Ключ - ПеречислениеСсылка.ДействияПоЭДО
//    * Значение - Булево
//
Процедура ПриОпределенииДействийДоступныхПоЭДО(Знач СостояниеДокумента, Знач СвойстваДокумента, Действия) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПриОпределенииДействийДоступныхПоЭДО(СостояниеДокумента, СвойстваДокумента, Действия);
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.ПриОпределенииДействийДоступныхПоЭДО(СостояниеДокумента, СвойстваДокумента, Действия);
// ХОЛД Конец
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиЭДО

// Вызывается при создании на сервере формы настроек отражения документов в ДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура НастройкиОтраженияДокументовВУчетеПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.НастройкиОтраженияДокументовВУчетеПриСозданииНаСервере(
		Форма, Отказ, СтандартнаяОбработка);
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.НастройкиОтраженияДокументовВУчетеПриСозданииНаСервере(
		Форма, Отказ, СтандартнаяОбработка);
// ХОЛД Конец
	
КонецПроцедуры

// Вызывается при создании на сервере формы настроек отправки документов
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура НастройкиОтправкиДокументовПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.НастройкиОтправкиДокументовПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.НастройкиОтправкиДокументовПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
// ХОЛД Конец
	
КонецПроцедуры

// Вызывается при создании на сервере формы списка настроек ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура СписокНастроекЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.СписокНастроекЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Вызывается при создании на сервере формы "ОбщиеНастройки" обработки "ПанельАдминистрированияБЭД".
// 
// Параметры:
//  Форма - см. Обработка.ПанельАдминистрированияБЭД.Форма.ОбщиеНастройки
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
Процедура ПанельАдминистрированияБЭДПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.ПанельАдминистрированияБЭДПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
// ХОЛД Конец
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсДокументовЭДО

// Вызывается при создании на сервере формы текущих дел ЭДО
// 
// Параметры:
//  Форма - см. Обработка.ИнтерфейсДокументовЭДО.Форма.ТекущиеДелаПоЭДО
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура ТекущиеДелаЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ТекущиеДелаЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.ТекущиеДелаЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
// ХОЛД Конец
	
КонецПроцедуры

#КонецОбласти

#Область РегламентыеЗадания

// При получении запроса на обновление словаря сопоставления номенклатуры БЭД.
// 
// Параметры:
//  Запрос - Запрос
//
Процедура ПриПолученииЗапросаНаОбновлениеСловаряСопоставленияНоменклатурыБЭД(Запрос) Экспорт
	
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.ПриПолученииЗапросаНаОбновлениеСловаряСопоставленияНоменклатурыБЭД(Запрос);
// ХОЛД Конец
	
КонецПроцедуры

// При получении запроса на пометку на удаление устаревших траспортных контейнеров ЭДО
// 
// Параметры:
//  Запрос - Запрос
//
Процедура ПриПолученииЗапросаДляПометкиНаУдалениеТранспортныхКонтейнеровЭДО(Запрос) Экспорт
	
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.ПриПолученииЗапросаДляПометкиНаУдалениеТранспортныхКонтейнеровЭДО(Запрос);
// ХОЛД Конец
	
КонецПроцедуры

// Перед регламентной проверкой наличия новых документов в сервисе ЭДО.
// 
// Параметры:
//  УчетныеЗаписиЭДО - Неопределено, Массив Из Строка - Учетные записи ЭДО, по которым необходимо проверить
//                                                      наличие новых документов.
//                                                      Неопределено - отбора не будет.
//                                                      Массив - будет отбор по учетным записям в массиве.
//
Процедура ПередРегламентнойПроверкойНаличияНовыхДокументовВСервисеЭДО(УчетныеЗаписиЭДО) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПередРегламентнойПроверкойНаличияНовыхДокументовВСервисеЭДО(УчетныеЗаписиЭДО);
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.ПередРегламентнойПроверкойНаличияНовыхДокументовВСервисеЭДО(УчетныеЗаписиЭДО);
// ХОЛД Конец
	
КонецПроцедуры

// При получении запроса непроверенных контрагентов.
// 
// Параметры:
//  Запрос - Запрос
//
Процедура ПриПолученииЗапросаНепроверенныхКонтрагентов(Запрос) Экспорт
	
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.ПриПолученииЗапросаНепроверенныхКонтрагентов(Запрос);
// ХОЛД Конец
	
КонецПроцедуры

#КонецОбласти

// Вызывается перед проверкой контрагента в сервисе 1С-ЭДО при записи контрагента
// 
// Параметры:
//  Источник - СправочникОбъект.Контрагенты
//  Отказ - Булево
//  ПроводитьПроверку - Булево
//
Процедура ПередПроверкойКонтрагентаВ1СЭДОПриЗаписи(Источник, Отказ, ПроводитьПроверку) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПередПроверкойКонтрагентаВ1СЭДОПриЗаписи(Источник, Отказ, ПроводитьПроверку);
	
КонецПроцедуры

// Вызвается после получения данных для синхронизации ЭДО
// 
// Параметры:
//  ДанныеДляСинхронизации см. СинхронизацияЭДОСлужебный.ДанныеДляСинхронизации
//  КонтекстДиагностики см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ПереданыУчетныеЗаписи - Булево - Переданы ли учетные записи для получения данных для синхронизации
//
Процедура ПослеПолученияДанныхДляСинхронизацииЭДО(
		ДанныеДляСинхронизации,
		КонтекстДиагностики,
		Знач ПереданыУчетныеЗаписи) Экспорт
	
// ХОЛД Начало
	ОбменСКонтрагентамиДОХолдинг.ПослеПолученияДанныхДляСинхронизацииЭДО(
		ДанныеДляСинхронизации, КонтекстДиагностики, ПереданыУчетныеЗаписи);
// ХОЛД Конец
	
КонецПроцедуры

#КонецОбласти

