
&ИзменениеИКонтроль("ВыполнитьДействиеЗадачи")
Процедура АБ_ВыполнитьДействиеЗадачи(ДействияЗадач, РезультатДействия, ФормаВладелец, ВерсииДанных)

	Если ДействияЗадач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	АвтоЗавершение = Ложь;
	Если ДействияЗадач.Количество() = 1 Тогда
		КлючевыеОперации = "ВыполнитьДействиеЗадачиОднаЗадача";
		УИДЗамера = ОценкаПроизводительностиКлиент.ЗамерВремени(КлючевыеОперации,,АвтоЗавершение);
	Иначе
		КлючевыеОперации = "ВыполнитьДействиеЗадачиНесколькоЗадач";
		УИДЗамера = ОценкаПроизводительностиКлиент.ЗамерВремени(КлючевыеОперации,АвтоЗавершение);
	КонецЕсли;	

	Попытка

		ПараметрыВыполнения = РаботаСЗадачамиКлиентСервер.НовыйПараметрыВыполненияДействийЗадач();
		Если ВерсииДанных <> Неопределено Тогда
			ПараметрыВыполнения.ВерсииДанных = ВерсииДанных;
		КонецЕсли;
		ПараметрыВыполнения.ДанныеФормыВладельца.ИмяФормы = ФормаВладелец.ИмяФормы;
		ПараметрыВыполнения.ДанныеФормыВладельца.ИдентификаторФормы = ФормаВладелец.УникальныйИдентификатор;

		ДанныеВыполнения = РаботаСЗадачамиВызовСервера.ВыполнитьДействиеЗадачи(
		ДействияЗадач,
		РезультатДействия,
		ПараметрыВыполнения);
		#Вставка
		//++dar 25.02.26 (309302)
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеВыполнения, "УВМ_МассивДокументовНаОтправку") Тогда
			Для Каждого ТекущийДокументНаОтправку Из ДанныеВыполнения.УВМ_МассивДокументовНаОтправку Цикл
				УВМ_ОбщиеДоработкиКлиент.УВМ_ПрикрепитьФайлPDF(ТекущийДокументНаОтправку);
			КонецЦикла;
			УВМ_ОбщиеДоработкиКлиент.УВМ_СформироватьИОтправитьПисьмаКлиентам(ДанныеВыполнения.УВМ_МассивДокументовНаОтправку);
		КонецЕсли;
		//--dar 25.02.26 (309302)
		#КонецВставки

		КонтекстВыполненияЗадачи = НовыйКонтекстВыполненияЗадачи();
		КонтекстВыполненияЗадачи.ДействияЗадач = ДействияЗадач;
		КонтекстВыполненияЗадачи.РезультатДействия = РезультатДействия;
		КонтекстВыполненияЗадачи.ИдентификаторФормы = ФормаВладелец.УникальныйИдентификатор;
		КонтекстВыполненияЗадачи.ПараметрыВыполнения = ПараметрыВыполнения;
		КонтекстВыполненияЗадачи.ДанныеВыполнения = ДанныеВыполнения;
		КонтекстВыполненияЗадачи.УИДЗамера = УИДЗамера;

		ОбработатьДанныеВыполнения(КонтекстВыполненияЗадачи, ФормаВладелец);

	Исключение

		ОповеститьОбИсключении();
		ВызватьИсключение;

	КонецПопытки;

КонецПроцедуры
