
&ИзменениеИКонтроль("МеханизмРегистрацииОбъектовПередЗаписью")
Процедура АБ_МеханизмРегистрацииОбъектовПередЗаписью(ИмяПланаОбмена, Источник, Отказ)

	#Вставка
	//++dar 12.03.26 (309302)
	Возврат;
	//--dar 12.03.26 (309302)
	#КонецВставки
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов")
		И Не Источник.ДополнительныеСвойства.Свойство("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ") Тогда
		Возврат;
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда

		Модуль = ОбщегоНазначения.ОбщийМодуль("ЗащитаПерсональныхДанных");
		Если Модуль.ПропуститьРегистрациюОбъекта(ИмяПланаОбмена, Источник) Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;

	ЗарегистрироватьИзменениеОбъекта(ИмяПланаОбмена, Источник, Отказ);

КонецПроцедуры

&ИзменениеИКонтроль("МеханизмРегистрацииОбъектовПередЗаписьюРегистра")
Процедура АБ_МеханизмРегистрацииОбъектовПередЗаписьюРегистра(ИмяПланаОбмена, Источник, Отказ, Замещение)

	#Вставка
	//++dar 12.03.26 (309302)
	Возврат;
	//--dar 12.03.26 (309302)
	#КонецВставки
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов")
		И Не Источник.ДополнительныеСвойства.Свойство("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ") Тогда
		Возврат;
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда

		Модуль = ОбщегоНазначения.ОбщийМодуль("ЗащитаПерсональныхДанных");
		Если Модуль.ПропуститьРегистрациюОбъекта(ИмяПланаОбмена, Источник) Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("ЭтоРегистр,Замещение", Истина, Замещение);
	ЗарегистрироватьИзменениеОбъекта(ИмяПланаОбмена, Источник, Отказ, ДополнительныеПараметры);

КонецПроцедуры

&ИзменениеИКонтроль("МеханизмРегистрацииОбъектовПередУдалением")
Процедура АБ_МеханизмРегистрацииОбъектовПередУдалением(ИмяПланаОбмена, Источник, Отказ)

	#Вставка
	//++dar 12.03.26 (309302)
	Возврат;
	//--dar 12.03.26 (309302)
	#КонецВставки
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов")
		И Не Источник.ДополнительныеСвойства.Свойство("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ") Тогда
		Возврат;
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда

		Модуль = ОбщегоНазначения.ОбщийМодуль("ЗащитаПерсональныхДанных");
		Если Модуль.ПропуститьРегистрациюОбъекта(ИмяПланаОбмена, Источник) Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("ЭтоУдалениеОбъекта", Истина);
	ЗарегистрироватьИзменениеОбъекта(ИмяПланаОбмена, Источник, Отказ, ДополнительныеПараметры);

КонецПроцедуры
