
&ИзменениеИКонтроль("ВыполнитьДействиеЗадачи")
Функция АБ_ВыполнитьДействиеЗадачи(Знач ДействияЗадач, Знач РезультатДействия, Знач ПараметрыВыполнения)

	Если ДействияЗадач.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не указано действие задачи.'");
	КонецЕсли;

	ЧислоЗадач = ДействияЗадач.Количество();

	РеквизитыДействийЗадач = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
	ДействияЗадач,
	"Задача, ВидДействия, Источник, Исполнитель, ВерсияДанных, РезультатДействияТекстом");

	ПриложенияЗадач = Новый Соответствие;
	Для Каждого ДействиеЗадачи Из ДействияЗадач Цикл
		РеквизитыДействия = РеквизитыДействийЗадач[ДействиеЗадачи];
		ПриложенияЗадач[ДействиеЗадачи] = РаботаСЗадачами.ПриложенияЗадачи(
		РеквизитыДействия.Задача,
		ДействиеЗадачи);
	КонецЦикла;

	// Формирование возвращаемого значения.
	ДанныеВыполнения = РаботаСЗадачамиКлиентСервер.НовыйДанныеВыполненияДействийЗадач();

	ДанныеВыполнения.ЧислоЗадач = ЧислоЗадач;

	// Выбор исполнителя.
	ЗаполнитьФактическогоИсполнителя(
	ДействияЗадач,
	РеквизитыДействийЗадач,
	ПараметрыВыполнения,
	ДанныеВыполнения);

	// Выбор помощника при необходимости.
	ОтобразитьВыборПомощникаПриНеобходимости(ДействияЗадач, РезультатДействия, ПараметрыВыполнения, ДанныеВыполнения);

	// Проверка наличия подзадач.
	Если ПараметрыВыполнения.ЗакрыватьПодзадачи = Неопределено Тогда

		ДанныеПодзадачПодлежащихЗакрытию =
		РаботаСЗадачами.ПодзадачиПодлежащиеЗакрытию(ДействияЗадач);
		ЕстьНезавершенныеПодзадачи =	
		ДанныеПодзадачПодлежащихЗакрытию.ПодзадачиПодлежащиеЗакрытию.Количество() > 0;
		ДействияСПодзадачами = ДанныеПодзадачПодлежащихЗакрытию.ДействияСПодзадачами;

		Если ЕстьНезавершенныеПодзадачи Тогда

			ДанныеВыполнения.ПредложитьЗакрытьПодзадачи = Истина;
			ДанныеВыполнения.КоличествоНезавершенныхПодзадач =
			ДанныеПодзадачПодлежащихЗакрытию.ПодзадачиПодлежащиеЗакрытию.Количество();

			ДанныеВыполнения.ТребуетсяИнтерактивноеДействие = Истина;

			Если ЧислоЗадач > 1 Тогда
				Для Каждого ДействиеСПодзадачами Из ДействияСПодзадачами Цикл
					Причина = НСтр("ru = 'Есть невыполненные подзадачи.'");
					ДанныеВыполнения.ЗадачиНельзяВыполнить.Добавить(
					Новый Структура("Задача, Причина", 
					ДействиеСПодзадачами, Причина));
				КонецЦикла;
			КонецЕсли;	

		КонецЕсли;

	КонецЕсли;

	// Обязательное заполнение приложений.
	Для Каждого ДействиеЗадачи Из ДействияЗадач Цикл

		РеквизитыДействия = РеквизитыДействийЗадач[ДействиеЗадачи];
		ПриложенияЗадачи = ПриложенияЗадач[ДействиеЗадачи];

		Для Каждого ДанныеПриложенияЗадачи Из ПриложенияЗадачи Цикл

			Если Не ДанныеПриложенияЗадачи.ОбязательноеЗаполнение
				Или Не ЗначениеЗаполнено(ДанныеПриложенияЗадачи.ИмяПредмета)
				Или ЗначениеЗаполнено(ДанныеПриложенияЗадачи.Приложение) Тогда
				Продолжить;
			КонецЕсли;

			ДанныеВыполнения.ПоказатьПредупреждение = Истина;

			Если ДействияЗадач.Количество() = 1 Тогда
				ДанныеВыполнения.Предупреждения.Добавить(
				СтрШаблон(
				НСтр("ru = 'Не введен заполняемый предмет ""%1""'"),
				ДанныеПриложенияЗадачи.ИмяПредмета));
			Иначе
				ДанныеВыполнения.Предупреждения.Добавить(
				СтрШаблон(
				НСтр("ru = 'Не введен заполняемый предмет ""%1"" у задачи ""%2""'"),
				ДанныеПриложенияЗадачи.ИмяПредмета,
				ДействиеЗадачи));
			Конецесли;

			Если ЧислоЗадач > 1 Тогда
				Причина = СтрШаблон(
				НСтр("ru = 'Не введен заполняемый предмет ""%1""'"),
				ДанныеПриложенияЗадачи.ИмяПредмета);
				ДанныеВыполнения.ЗадачиНельзяВыполнить.Добавить(
				Новый Структура("Задача, Причина", 
				ДействиеЗадачи, Причина));
			КонецЕсли;	

			ДанныеВыполнения.ТребуетсяИнтерактивноеДействие = Истина;

		КонецЦикла;

	КонецЦикла;

	// Проверка занятых файлов.
	Если Не ПараметрыВыполнения.ЗанятыеФайлыПроверены Тогда

		ФайлыДляПроверки = Новый Массив;
		ВладельцыФайлов = Новый Массив;
		Для Каждого ДействиеЗадачи Из ДействияЗадач Цикл

			РеквизитыДействия = РеквизитыДействийЗадач[ДействиеЗадачи];
			ПриложенияЗадачи = ПриложенияЗадач[ДействиеЗадачи];

			Для Каждого ДанныеПриложениеЗадачи Из ПриложенияЗадачи Цикл

				Если ТипЗнч(ДанныеПриложениеЗадачи.Приложение) = Тип("СправочникСсылка.Файлы") Тогда
					ФайлыДляПроверки.Добавить(ДанныеПриложениеЗадачи.Приложение);
				Иначе
					ВладельцыФайлов.Добавить(ДанныеПриложениеЗадачи.Приложение);
				КонецЕсли;

			КонецЦикла;

		КонецЦикла;

		ФайлыПриложений = РаботаСЗадачами.ФайлыПриложений(ВладельцыФайлов);
		Для Каждого КлючИЗначение Из ФайлыПриложений Цикл
			ФайлыПриложения = КлючИЗначение.Значение;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ФайлыДляПроверки, ФайлыПриложения);
		КонецЦикла;

		ДанныеВыполнения.ФайлыДляПроверки =
		ОбщегоНазначенияКлиентСервер.СвернутьМассив(ФайлыДляПроверки);

		Если ДанныеВыполнения.ФайлыДляПроверки.Количество() > 0 Тогда

			КоличествоЗанятыхФайлов = РаботаСФайлами.ПолучитьКоличествоЗанятыхФайлов(
			Неопределено,
			Пользователи.ТекущийПользователь(),
			Истина,
			Сотрудники.ВсеСотрудникиТекущегоПользователя(),
			ФайлыДляПроверки);
			Если КоличествоЗанятыхФайлов > 0 Тогда

				ДанныеВыполнения.ПроверитьЗанятыеФайлы = Истина;

				Если ЧислоЗадач > 1 Тогда
					Причина = НСтр("ru = 'Есть занятые файлы.'");
					ДанныеВыполнения.ЗадачиНельзяВыполнить.Добавить(
					Новый Структура("Задача, Причина", 
					ДействиеЗадачи, Причина));
				КонецЕсли;	

				ДанныеВыполнения.ТребуетсяИнтерактивноеДействие = Истина;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	// Проверка изменения версии данных.
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ВерсииДанных) Тогда
		РаботаСЗадачами.ПередИнтерактивнымВыполнениемДействияПроверкаВерсииДанных(
		ДействиеЗадачи,
		ПараметрыВыполнения.ВерсииДанных,
		РеквизитыДействия,
		ДанныеВыполнения);
	КонецЕсли;

	// Проверка заполнения данных возврата на доработку.
	Для Каждого ДействиеЗадачи Из ДействияЗадач Цикл

		РеквизитыДействия = РеквизитыДействийЗадач[ДействиеЗадачи];

		Если ЗначениеЗаполнено(РеквизитыДействия.Источник) Тогда
			Продолжить;
		КонецЕсли;

		ВидЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДействия.Задача, "ВидЗадачи");
		ДанныеВидаЗадачи = РаботаСЗадачамиПовтИсп.ДанныеВидаЗадачи(ВидЗадачи);

		Если РезультатДействия <> ДанныеВидаЗадачи.РезультатПроверяющегоВозвращеноНаДоработку Тогда
			Продолжить;
		КонецЕсли;

		Если ДействияЗадач.Количество() > 1 Тогда
			ВызватьИсключение НСтр("ru = 'Массовый возврат на доработку не поддерживается.'");
		КонецЕсли;

		Если ПараметрыВыполнения.ДанныеВозвратаНаДоработку = Неопределено Тогда

			ДанныеВыполнения.ТребуетсяВвестиПричинуВозврата = Истина;
			ДанныеВыполнения.ОбщаяПричинаВозврата = РеквизитыДействия.РезультатДействияТекстом;
			ДанныеВыполнения.ЗадачаДляВозврата = РеквизитыДействия.Задача;
			ДанныеВыполнения.ТребуетсяИнтерактивноеДействие = Истина;

		КонецЕсли;

	КонецЦикла;

	// Проверка отчетов об исполнении.
	Для Каждого ДействиеЗадачи Из ДействияЗадач Цикл

		РеквизитыДействия = РеквизитыДействийЗадач[ДействиеЗадачи];

		Если ЗначениеЗаполнено(РеквизитыДействия.Источник) Тогда
			Продолжить;
		КонецЕсли;

		Если (РезультатДействия = Справочники.РезультатыДействийЗадач.СогласованоСЗамечаниями
			Или РезультатДействия = Справочники.РезультатыДействийЗадач.НеСогласовано)
			И Не ЗначениеЗаполнено(РеквизитыДействия.РезультатДействияТекстом) Тогда

			Причина = НСтр("ru = 'Поле ""Комментарий"" не заполнено'");

			ДанныеВыполнения.Предупреждения.Добавить(Причина);
			ДанныеВыполнения.ПоказатьПредупреждение = Истина;

			Если ДанныеВыполнения.ЧислоЗадач > 1 Тогда

				ДанныеВыполнения.ЗадачиНельзяВыполнить.Добавить(
				Новый Структура("Задача, Причина", 
				ДействиеЗадачи, Причина));
			КонецЕсли;	

			ДанныеВыполнения.ТребуетсяИнтерактивноеДействие = Истина;

		КонецЕсли;

	КонецЦикла;

	// Дополнительный вопрос для "опасного" действия.
	Если РезультатДействия = Справочники.РезультатыДействийЗадач.Завершил
		И СтрНайти(ПараметрыВыполнения.ДанныеФормыВладельца.ИмяФормы, "СогласованиеВРежимеЗамечаний") = 0 Тогда

		Если ПустаяСтрока(ПараметрыВыполнения.ОтветНаПроизвольныйВопрос) Тогда

			// Нужно задать вопрос.
			ВидЗадачи = НСтр("ru = 'действия'"); // если действий несколько.
			Если ДействияЗадач.Количество() = 1 Тогда
				// Если действие одно, то в уточняющем вопросе укажем, какое:
				ВидЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				РеквизитыДействийЗадач[ДействияЗадач[0]].Задача, "ВидЗадачи");
				Если ВидЗадачи = Справочники.ВидыЗадач.Регистрация Тогда
					// "Регистрация" в винительном падеже по-другому звучит, остальные виды задач одинаково:
					ВидЗадачи = НСтр("ru = 'регистрацию'");
				КонецЕсли;
				ВидЗадачи = НРег("" + ВидЗадачи);
			КонецЕсли;
			ДанныеВыполнения.ТребуетсяИнтерактивноеДействие = Истина;
			ДанныеВыполнения.ПроизвольныйВопрос.ЗадатьВопрос = Истина;
			ДанныеВыполнения.ПроизвольныйВопрос.Текст = СтрШаблон(НСтр("ru = 'Завершить %1, Вы уверены?'"), ВидЗадачи);
			ДанныеВыполнения.ПроизвольныйВопрос.Кнопки.Добавить(НСтр("ru = 'Да'"));
			ДанныеВыполнения.ПроизвольныйВопрос.Кнопки.Добавить(НСтр("ru = 'Нет'"));

		ИначеЕсли ПараметрыВыполнения.ОтветНаПроизвольныйВопрос = НСтр("ru = 'Да'") Тогда

			// Пользователь ответил утвердительно. Интерактивное действие не требуется.

		ИначеЕсли ПараметрыВыполнения.ОтветНаПроизвольныйВопрос = НСтр("ru = 'Нет'") Тогда

			// Пользователь ответил отрицательно. Нужно вернуться к задаче.
			ДанныеВыполнения.ТребуетсяИнтерактивноеДействие = Истина;
			ДанныеВыполнения.ВернутьсяКЗадаче = Истина;

		КонецЕсли;

	КонецЕсли;

	// Проверки, обусловленные источником действия.
	ИнтеграцияЗадач.ПередИнтерактивнымВыполнениемДействия(
	ДействияЗадач,
	РезультатДействия,
	ПараметрыВыполнения,
	ДанныеВыполнения,
	ПриложенияЗадач);

	ДанныеВыполнения.ПричинаЗапретаВыполнения =
	Новый ФорматированнаяСтрока(ДанныеВыполнения.ПричинаЗапретаВыполнения);

	Если ДанныеВыполнения.ТребуетсяИнтерактивноеДействие Тогда
		Возврат ДанныеВыполнения;
	КонецЕсли;
	
	#Вставка
	//++GIV 25032026 (320030) перенес ниже. сначала проверяем корректность заполнения, только потом отправляем
	//++dar 25.02.26 (309302)
	Если РезультатДействия = Справочники.РезультатыДействийЗадач.Согласовано ИЛИ РезультатДействия = Справочники.РезультатыДействийЗадач.СогласованоСЗамечаниями
		ИЛИ РезультатДействия = Справочники.РезультатыДействийЗадач.Выполнена Тогда
		МассивДокументовНаОтправку = Новый Массив;
		Для Каждого ТекущееПриложениеЗадачи Из ПриложенияЗадач Цикл
			РеквизитыДоговораКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущееПриложениеЗадачи.Ключ, "Источник.УВМ_ОтправитьДоговорКонтрагенту, Источник.УВМ_СформироватьДоговорВЕРП");
			ОтправитьДоговорКонтрагенту = РеквизитыДоговораКонтрагента.ИсточникУВМ_ОтправитьДоговорКонтрагенту;
			СформироватьДоговорВЕРП = РеквизитыДоговораКонтрагента.ИсточникУВМ_СформироватьДоговорВЕРП;
			
			Для Каждого ТекущееПриложение Из ТекущееПриложениеЗадачи.Значение Цикл
				Если ОтправитьДоговорКонтрагенту Тогда
					МассивДокументовНаОтправку.Добавить(ТекущееПриложение.Приложение);
				КонецЕсли;
				
				Если СформироватьДоговорВЕРП Тогда
					АБ_ВызовСервера.СоздатьДоговорВоВнешнейБазе(ТекущееПриложение.Приложение);
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		ДанныеВыполнения.Вставить("УВМ_МассивДокументовНаОтправку", МассивДокументовНаОтправку);
    КонецЕсли;
	//--dar 25.02.26 (309302)
	//--GIV 25032026 (320030)
	#КонецВставки

	// Выполнение задачи.
	СчетчикРезультатов = Новый Соответствие;
	ВсеРезультаты = Новый СписокЗначений;
	РеквизитыДействий = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДействияЗадач, "ВидДействия, Задача");
	Если ПараметрыВыполнения.ВыполнитьОтИмени <> Неопределено Тогда
		КтоОтметил = Сотрудники.ОсновнойСотрудникПользователя(ПараметрыВыполнения.ВыполнитьОтИмени);
	Иначе
		КтоОтметил = Сотрудники.ОсновнойСотрудник();
	КонецЕсли;

	Для Каждого ДействиеЗадачи Из ДействияЗадач Цикл

		РеквизитыДействия = РеквизитыДействий[ДействиеЗадачи];

		Если Не ЗначениеЗаполнено(РезультатДействия) Тогда
			Продолжить;
		КонецЕсли;

		Если ВсеРезультаты.НайтиПоЗначению(РезультатДействия) = Неопределено Тогда
			ВсеРезультаты.Добавить(РезультатДействия, Строка(РезультатДействия));
		КонецЕсли;

		Если СчетчикРезультатов[РезультатДействия] = Неопределено Тогда
			СчетчикРезультатов[РезультатДействия] = 0;
		КонецЕсли;
		СчетчикРезультатов[РезультатДействия] = СчетчикРезультатов[РезультатДействия] + 1;

		РаботаСЗадачами.ВыполнитьДействиеЗадачи(
		ДействиеЗадачи,
		РезультатДействия,
		КтоОтметил,
		ПараметрыВыполнения);

	КонецЦикла;

	// Представление результата.
	ВсеРезультаты.СортироватьПоПредставлению();
	МассивПредставлениеРезультата = Новый Массив;
	Для Каждого ОчереднойРезультат Из ВсеРезультаты.ВыгрузитьЗначения() Цикл

		Если ДействияЗадач.Количество() = 1 Тогда
			ПредставлениеРезультатаВарианта = Строка(ОчереднойРезультат);
		Иначе
			ПредставлениеРезультатаВарианта = СтрШаблон("%1 (%2)",
			ОчереднойРезультат,
			СчетчикРезультатов[ОчереднойРезультат]);
		КонецЕсли;

		МассивПредставлениеРезультата.Добавить(ПредставлениеРезультатаВарианта);

	КонецЦикла;
	ПредставлениеРезультата = СтрСоединить(МассивПредставлениеРезультата, " / ");

	// Формирование параметров учета времени.
	ДанныеВыполнения.ПараметрыУчетаВремени = УчетВремени.ПараметрыУчетаВремени(ДействияЗадач[0]);

	// Формирование возвращаемого значения.
	ДанныеВыполнения.ПредставлениеРезультата = ПредставлениеРезультата;

	Возврат ДанныеВыполнения;

КонецФункции
