
#Область ПрограммныйИнтерфейс

// Форма документа обработка выбора форма элемента.
// 
// Параметры:
//  Элемент - ПолеФормы - Элемент
//  ВыбранноеЗначение - Произвольный - Выбранное значение
//  ДополнительныеДанные - Произвольный - Дополнительные данные
//  СтандартнаяОбработка - Булево - Стандартная обработка
//  Форма - ФормаКлиентскогоПриложения
Процедура ФормаДокументаОбработкаВыбора_ФормаЭлемента(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка, Форма) Экспорт

// Локализация
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВариантыФормДокументов.Бумажная")
		И Форма.ШаблонУчаствуетВОтраженииДокументовЭДО Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = 
			НСтр("ru='Нельзя изменить форму на бумажную, так как этот шаблон используется при отражении документов ЭДО'");
		
		ПредупреждениеАсинх(ТекстСообщения);
		
	КонецЕсли;
// Конец Локализация

КонецПроцедуры

#КонецОбласти

