
&ИзменениеИКонтроль("ПолучитьПравилаРегистрацииОбъектов")
Функция АБ_ПолучитьПравилаРегистрацииОбъектов()

	// Возвращаемое значение функции.
	ПравилаРегистрацииОбъектов = ИнициализацияТаблицыПравилРегистрацииОбъектов();

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Правила.ПравилаЗачитанные КАК ПравилаЗачитанные,
	|	Правила.ИмяПланаОбмена КАК ИмяПланаОбмена,
	|	Правила.ИсточникПравил КАК ИсточникПравил,
	|	Правила.ИмяМенеджераРегистрации КАК ИмяМенеджераРегистрации
	|ИЗ
	|	РегистрСведений.ПравилаДляОбменаДанными КАК Правила
	|ГДЕ
	|	(Правила.ВидПравил = ЗНАЧЕНИЕ(Перечисление.ВидыПравилДляОбменаДанными.ПравилаРегистрацииОбъектов)
	|				И Правила.ПравилаЗагружены
	|			ИЛИ Правила.ИсточникПравил В (&ИсточникиПравилМенеджеры))";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	ИсточникиПравилМенеджеры = Новый Массив;
	ИсточникиПравилМенеджеры.Добавить(Перечисления.ИсточникиПравилДляОбменаДанными.МенеджерТиповой);
	ИсточникиПравилМенеджеры.Добавить(Перечисления.ИсточникиПравилДляОбменаДанными.МенеджерПользовательский);

	Запрос.УстановитьПараметр("ИсточникиПравилМенеджеры", ИсточникиПравилМенеджеры);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если Выборка.ИсточникПравил = Перечисления.ИсточникиПравилДляОбменаДанными.МенеджерТиповой
			Или Выборка.ИсточникПравил = Перечисления.ИсточникиПравилДляОбменаДанными.МенеджерПользовательский Тогда

			Если Выборка.ИсточникПравил = Перечисления.ИсточникиПравилДляОбменаДанными.МенеджерТиповой Тогда 
				ИмяМенеджераРегистрации = ОбменДаннымиПовтИсп.ИмяМенеджераРегистрации(Выборка.ИмяПланаОбмена);
			Иначе
				ИмяМенеджераРегистрации = Выборка.ИмяМенеджераРегистрации;	
			КонецЕсли;

			Менеджер = ОбщегоНазначения.ОбщийМодуль(ИмяМенеджераРегистрации);
			Менеджер.ИнициализацияПравилРегистрации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);

		Иначе

			ПравилаЗачитанные = Выборка.ПравилаЗачитанные.Получить();
			Если ПравилаЗачитанные = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			ЗаполнитьЗначенияСвойствДляТаблицыЗначенийПРО(ПравилаРегистрацииОбъектов, ПравилаЗачитанные);

		КонецЕсли;

	КонецЦикла;
	
	#Вставка
	//++dar 13.11.25 (291567)
	СтрокаШаблон = ПравилаРегистрацииОбъектов.Найти("РегистрСведений.ДокументыФизическихЛиц", "ОбъектМетаданныхИмя");
	Если СтрокаШаблон <> Неопределено Тогда
		НовСтр = ПравилаРегистрацииОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрокаШаблон);
		НовСтр.ОбъектМетаданныхИмя = "РегистрСведений.УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов";
		НовСтр.ОтборПоСвойствамОбъекта.Строки.Очистить();
	КонецЕсли;
	//--dar 13.11.25 (291567)
	#КонецВставки
	Возврат ПравилаРегистрацииОбъектов;

КонецФункции
