
&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++dar 24.02.26 (309302)                                                                                                        
	СвойстваОтправитьДоговор = Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_ОтправитьДоговорКонтрагенту", Элементы.ГруппаДополнительноПраво, Истина, , , СвойстваОтправитьДоговор);

	СвойстваСформироватьДоговор = Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_СформироватьДоговорВЕРП", Элементы.ГруппаДополнительноПраво, Истина, , , СвойстваСформироватьДоговор);
	//--dar 24.02.26 (309302)
КонецПроцедуры
