#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат;
	Конецесли;
	
	Документ = Параметры.ДокументСсылка;
	
	ЗаполнитьПроверяемыеРеквизиты();
	ЗаполнитьОсновнуюИнформацию();
	
	ПроверитьВсе = ПроверитьВсе();
	
	УстановитьВидимостьПоСостоянию();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизитыТребующиеПроверки

&НаКлиенте
Процедура РеквизитыТребующиеПроверкиЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РеквизитыТребующиеПроверки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ТекущееЗначение) Тогда
		ТекущиеДанные.Проверен = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ВерифицированныеРеквизиты = ВерифицированныеРеквизиты();
	
	Если ВерифицированныеРеквизиты.Количество() > 0 Тогда
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Предмет", Документ);
		ПараметрыОповещения.Вставить("ВерифицированныеРеквизиты", ВерифицированныеРеквизиты);
		
		Если ПроверитьВсе = Истина И ДокументПроверен = Истина Тогда
			ПараметрыОповещения.Вставить("ВсеРеквизиты", Истина);
		КонецЕсли;
		
		Оповестить("ИзменениеВерифицируемыхРеквизитов", ПараметрыОповещения); 
		
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрервать(Команда)
	
	ПрерватьРаспознавание();
	
КонецПроцедуры
	
&НаКлиенте
Процедура Повторить(Команда)
	
	ПовторитьРаспознавание();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПроверяемыеРеквизиты()
	
	Для Каждого Стр Из Параметры.ВерифицируемыеРеквизиты Цикл 
		
		НСтр = РеквизитыТребующиеПроверки.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ВерифицированныеРеквизиты()  
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Стр Из РеквизитыТребующиеПроверки Цикл    
		
		Если ПроверитьВсе = Истина И ДокументПроверен = Истина Тогда
			Стр.Проверен = Истина;
		ИначеЕсли Стр.Проверен = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("ИмяРеквизита", Стр.ИмяРеквизита);
		ДанныеСтроки.Вставить("ТекущееЗначение", Стр.ТекущееЗначение);
		ДанныеСтроки.Вставить("ТабличнаяЧасть", Стр.ТабличнаяЧасть);
		ДанныеСтроки.Вставить("НомерСтрокиТЧ", Стр.НомерСтрокиТЧ); 
		ДанныеСтроки.Вставить("НаименованиеРеквизита", Стр.НаименованиеРеквизита);
		МассивРеквизитов.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	Возврат МассивРеквизитов;

КонецФункции

&НаСервере
Процедура ЗаполнитьОсновнуюИнформацию()
	
	ТаблицаИстории = РаспознаваниеДокументов.ИсторияРаспознаванияДокумента(Параметры.ДокументСсылка);
	КоличествоЗаписей = ТаблицаИстории.Количество();
	Если КоличествоЗаписей > 0 Тогда
		
		СтатусУстановил = ТаблицаИстории[0].Ответственный;
		ДатаУстановкиСтатуса = ТаблицаИстории[0].Период;
		СтатусРаспознавания = ТаблицаИстории[0].СтатусРаспознавания;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоСостоянию()
	
	Распознан = СтатусРаспознавания = Перечисления.СтатусыРаспознаванияДокументов.Распознан;
	НаРаспознавании = СтатусРаспознавания = Перечисления.СтатусыРаспознаванияДокументов.НаРаспознавании;
	Прервано = СтатусРаспознавания = Перечисления.СтатусыРаспознаванияДокументов.Прервано;
	
	ЭтоОбъектЭтогоУзла = ОбщегоНазначенияДокументооборот.ЭтоОбъектЭтогоУзла(Параметры.ДокументСсылка);
	ВидимостьЗакладкиПроверка = (Распознан И РеквизитыТребующиеПроверки.Количество() > 0 
		И Пользователи.РолиДоступны("ПроверкаРаспознанныхДокументов"));
	
	Элементы.КомандаПрервать.Видимость = НаРаспознавании и ЭтоОбъектЭтогоУзла = Истина;
	
	Элементы.ДокументПроверен.Видимость = ПроверитьВсе;
	
	Элементы.КомандаПовторить.Видимость = Прервано И ЭтоОбъектЭтогоУзла = Истина;
	
	Элементы.КомандаПрименить.Видимость = ЭтоОбъектЭтогоУзла;
	
	Если ВидимостьЗакладкиПроверка = Ложь Тогда
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.ГруппаСтраницаПроверка.Видимость = Ложь;
		Элементы.КомандаПрименить.Видимость = Ложь;
	ИначеЕсли ПроверитьВсе = Истина Тогда
		Элементы.РеквизитыТребующиеПроверки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПрерватьРаспознавание()

	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Документ", Документ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОПрерывании", ЭтотОбъект, ПараметрыОбработчика);
	
	ТекстВопроса = НСтр("ru = 'Прервать распознавание документа?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте 
Процедура ПослеВопросаОПрерывании(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	
	ДокументСсылка = ДополнительныеПараметры.Документ;
	
	РаспознаваниеДокументовВызовСервера.ПрерватьРаспознаваниеДокумента(ДокументСсылка, ОписаниеОшибки);
	
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		ВызватьИсключение(ОписаниеОшибки);
	Иначе 
		ПараметрыОповещения = Новый Структура("Документ, СтатусРаспознавания", 
			ДокументСсылка, ПредопределенноеЗначение("Перечисление.СтатусыРаспознаванияДокументов.Прервано"));
		Оповестить("ИзменениеСтатусаРаспознаванияДокумента", ПараметрыОповещения);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 	
Процедура ПовторитьРаспознавание()

	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Документ", Документ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОбОтправке", ЭтотОбъект, ПараметрыОбработчика);
	
	ТекстВопроса = НСтр("ru = 'Документ будет повторно отправлен на распознавание. Продолжить?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры  
	
&НаКлиенте 
Процедура ПослеВопросаОбОтправке(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДокументСсылка = ДополнительныеПараметры.Документ;
	
	МассивФайлов = РаботаСФайламиВызовСервера.ПолучитьВсеПодчиненныеФайлы(ДокументСсылка, Ложь);  
	
	КоличествоФайлов = МассивФайлов.Количество();
	
	ФайлДляРаспознавания = Неопределено;	
	Если МассивФайлов.Количество() > 1 Тогда
		
		СписокФайлов = Новый СписокЗначений;
		СписокФайлов.ЗагрузитьЗначения(МассивФайлов);

			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("ДокументСсылка",ДокументСсылка);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПредложитьВыбратьФайлЗавершение", ЭтотОбъект, ПараметрыОповещения);
			ТекстЗаголовкаВыбора = НСтр("ru='Выберите файл'");
			СписокФайлов.ПоказатьВыборЭлемента(ОписаниеОповещения, ТекстЗаголовкаВыбора);
		
	ИначеЕсли КоличествоФайлов = 1 Тогда
		
		ФайлДляРаспознавания = МассивФайлов[0]; 
		
	КонецЕсли;
	
	Если ФайлДляРаспознавания <> Неопределено Тогда 
		
		РаспознаваниеДокументовВызовСервера.ОтправитьФайлДокументаНаРаспознавание(ФайлДляРаспознавания);    
		
		ПараметрыОповещения = Новый Структура("Документ, СтатусРаспознавания", 
			ДокументСсылка, ПредопределенноеЗначение("Перечисление.СтатусыРаспознаванияДокументов.НаРаспознавании"));
		
		Оповестить("ИзменениеСтатусаРаспознаванияДокумента", ПараметрыОповещения);
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьВыбратьФайлЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	Иначе
		
		РаспознаваниеДокументовВызовСервера.ОтправитьФайлДокументаНаРаспознавание(Результат.Значение);
		
		ПараметрыОповещения = Новый Структура("Документ, СтатусРаспознавания", 
			Документ, ПредопределенноеЗначение("Перечисление.СтатусыРаспознаванияДокументов.НаРаспознавании"));
		
		Оповестить("ИзменениеСтатусаРаспознаванияДокумента", ПараметрыОповещения);
		
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВсе()
	
	Если РеквизитыТребующиеПроверки.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если РеквизитыТребующиеПроверки[0].ИмяРеквизита = РаспознаваниеДокументов.ИмяРеквизитаВсе() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
