
// @strict-types

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииОрганизации();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииОрганизации()
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.БизнесСеть") Тогда
		ВызватьИсключение НСтр("ru = 'Для работы облачного ЭДО требуется встраивание подсистемы Бизнес-сеть'");
	КонецЕсли;
	
	МодульОбменБизнесСеть = ОбщегоНазначения.ОбщийМодуль("БизнесСеть");
	Запись.Идентификатор = МодульОбменБизнесСеть.ИдентификаторОрганизации(Запись.Организация);
	
КонецПроцедуры

#КонецОбласти
