
&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++dar 25.02.26 (309302)
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтотОбъект, "УВМ_ТекстПисьма", УВМ_РаботаСФормами.ОписаниеТипаСтрока());
	//--dar 25.02.26 (309302)
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьЗаписьHTML")
Процедура АБ_ВыполнитьЗаписьHTML()

	Если ВыполняетсяЗапись Тогда

		ТекстПисьмаHTMLПриЗаписи = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаHTMLПриЗаписи);
		ТекстПисьмаHTMLДляОтменыОтправки = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаHTMLДляОтменыОтправки);
		ТекстПисьмаПоследнегоАвтосохранения = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаПоследнегоАвтосохранения);
		ТекстПисьмаПриОткрытии  = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаПриОткрытии);

		Возврат;
	КонецЕсли;	

	HTMLДокумент = Элементы.ТекстПисьмаHTML.Документ; 

	ЗапомнитьПозициюHTML();

	ТекстПисьмаHTMLДляОтменыОтправки = "<html><body>" + HTMLДокумент.body.innerHTML + "</body></html>";

	Если ФайловыеФункцииСлужебныйКлиент.РасширениеРаботыСФайламиПодключено() Тогда

		// в веб клиенте  HTMLДокумент.images недоступен
		#Если Не ВебКлиент Тогда 

			ЧислоКартинок = HTMLДокумент.images.length;  
			Для Индекс = 0 По ЧислоКартинок - 1 Цикл  

				Изображение = HTMLДокумент.images.item(Индекс);		

				Попытка
					Если Найти(ВРег(Изображение.src), ВРег("file://")) = 1 Тогда

						ПутьФайла = Сред(Изображение.src, СтрДлина("file://") + 1);
						ПутьФайла = СтрЗаменить(ПутьФайла, "%20", " ");

						ПервыйСимвол = Лев(ПутьФайла, 1);
						ВторойСимвол = Сред(ПутьФайла, 2, 1);
						Если ПервыйСимвол = "/" Или ПервыйСимвол = "\" Тогда

							Если ВторойСимвол <> "/" И ВторойСимвол <> "\" Тогда
								ПутьФайла = Сред(ПутьФайла, 2);
							КонецЕсли;	

						КонецЕсли;	

						АдресВоВременномХранилище = "";

						ПомещаемыеФайлы = Новый Массив;
						Описание = Новый ОписаниеПередаваемогоФайла(ПутьФайла, "");
						ПомещаемыеФайлы.Добавить(Описание);
						ПомещенныеФайлы = Новый Массив;
						Если Не ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,, Ложь, УникальныйИдентификатор) Тогда
							ВызватьИсключение
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не удалось поместить файл: ""%1"" в хранилище'"),
							ПутьФайла);
						КонецЕсли;

						Если ПомещенныеФайлы.Количество() = 1 Тогда
							АдресВоВременномХранилище = ПомещенныеФайлы[0].Хранение;
						Иначе
							ВызватьИсключение
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не удалось поместить файл: ""%1"" в хранилище'"),
							ПутьФайла);
						КонецЕсли;

						УникальныйИдентификаторФайла = Новый УникальныйИдентификатор; 
						УникальныйИдентификаторФайла = Строка(УникальныйИдентификаторФайла);
						Изображение.src = "cid:" + УникальныйИдентификаторФайла;

						Файл = Новый Файл(ПутьФайла);

						ОписаниеФайла = Новый Структура("Адрес, УникальныйИдентификаторФайла, ВремяИзменения, ИмяФайла, Размер, Ссылка",
						АдресВоВременномХранилище, УникальныйИдентификаторФайла,
						Файл.ПолучитьВремяИзменения(), Файл.Имя, Файл.Размер(), 
						Неопределено);

						СписокДобавленныхФайлов.Добавить(ОписаниеФайла);

					КонецЕсли;	
				Исключение
					СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					Почта.ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке);
				КонецПопытки;

			КонецЦикла;	

		#КонецЕсли

	КонецЕсли;

	ТекстВПоле = HTMLДокумент.body.innerHTML;
	#Вставка
	Если НЕ ЗначениеЗаполнено(ТекстВПоле) И ЗначениеЗаполнено(ЭтотОбъект.УВМ_ТекстПисьма) Тогда
		//++dar 25.02.26 (309302)
		ТекстВПоле = ЭтотОбъект.УВМ_ТекстПисьма;
		//--dar 25.02.26 (309302)
	КонецЕсли;
	#КонецВставки
	ТекстПисьмаHTMLПриЗаписи = "<html><body>" + ТекстВПоле + "</body></html>";

	ТекстПисьмаHTMLПриЗаписи = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаHTMLПриЗаписи);
	ТекстПисьмаHTMLДляОтменыОтправки = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаHTMLДляОтменыОтправки);
	ТекстПисьмаПоследнегоАвтосохранения = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаПоследнегоАвтосохранения);
	ТекстПисьмаПриОткрытии  = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаПриОткрытии);

КонецПроцедуры
