////////////////////////////////////////////////////////////////////////////////
// Бронирование помещений (глобальный)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик ожидания, подключающий ожидания подтверждения бронирования.
//
Процедура ОперативноеПодтверждениеБронированияГлобальный() Экспорт
	
// ХОЛД Начало
	БронированиеПомещенийХолдингКлиент.ОжидатьЗавершениеОперативногоПодтвержденияБронирования();
// ХОЛД Конец
	
КонецПроцедуры

#КонецОбласти
