
&ИзменениеИКонтроль("СоздатьЗадачиОзнакомиться")
Функция АБ_СоздатьЗадачиОзнакомиться()

	УстановитьПривилегированныйРежим(Истина);

	// Если процесс завершился положительно, то задачу ознакомления не формируем.
	Если РезультатСогласования = Перечисления.РезультатыСогласования.Согласовано Тогда
		Возврат Неопределено;
	КонецЕсли;

	#Вставка
	//++dar 16.04.26 (323598)
	ДействиеСогласования = РегистрыСведений.ПроцессыДействий.ДействиеПоПроцессу(ЭтотОбъект.Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДействияСогласования.НастройкаДействия КАК НастройкаДействия
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	Справочник.ДействияСогласования КАК ДействияСогласования
	|ГДЕ
	|	ДействияСогласования.Ссылка = &ДействиеСогласования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиДействийСогласованияУчастники.Ссылка КАК Ссылка,
	|	НастройкиДействийСогласованияУчастники.Участник КАК Участник,
	|	НастройкиДействийСогласованияУчастники.ФункцияУчастника КАК ФункцияУчастника
	|ИЗ
	|	Справочник.НастройкиДействийСогласования.Участники КАК НастройкиДействийСогласованияУчастники
	|ГДЕ
	|	НастройкиДействийСогласованияУчастники.Ссылка В
	|			(ВЫБРАТЬ
	|				втДанные.НастройкаДействия
	|			ИЗ
	|				втДанные)
	|	И НастройкиДействийСогласованияУчастники.ФункцияУчастника = ЗНАЧЕНИЕ(Перечисление.ФункцииУчастниковСогласования.ОбрабатывающийРезультат)";
	Запрос.УстановитьПараметр("ДействиеСогласования", ДействиеСогласования);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	//--dar 16.04.26 (323598)
	#КонецВставки
	Задача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	ЗаполнитьЗадачуОзнакомиться(Задача);

	ЗадачаСсылка = Задачи.ЗадачаИсполнителя.ПолучитьСсылку();
	Задача.УстановитьСсылкуНового(ЗадачаСсылка);

	НоваяСтрока = РезультатыОзнакомлений.Добавить();
	НоваяСтрока.НомерИтерации 	  = НомерИтерации;
	НоваяСтрока.ЗадачаИсполнителя = ЗадачаСсылка;

	Возврат Задача;

КонецФункции
