
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ РомановНЕ 20240115 (161623)
	// свойства по умолчанию
	Элементы.ГруппаИзменений.Видимость = Ложь;
	ДоступКБлокировкеКонтрагентов = Истина;
	Контрагент = Параметры.Контрагент;
	
	ОпределитьДоступностьПользователя();
	Элементы.ГруппаЗапретРазрешениеОтгрузки.Доступность = ДоступКБлокировкеКонтрагентов;

	НаименованеКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование");
	ДополнительнаяИнформация = ПолучитьДополнительнуюИнформацию(Контрагент);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ДополнительнаяИнформация);
	
	Если ОтгрузкаРазрешенаЗапрещена = Перечисления.УВМ_СтатусыБлокировкиКонтрагентов.Заблокирован Тогда
		Элементы.ГруппаСтраницыЗапрета.ТекущаяСтраница = Элементы.ГруппаОтгрузкаЗапрещена;
	Иначе
		Элементы.ГруппаСтраницыЗапрета.ТекущаяСтраница = Элементы.ГруппаОтгрузкаРазрешена;
	КонецЕсли;

	Элементы.ДекорацияНадписьРазрешена.Заголовок = СтрЗаменить(Элементы.ДекорацияНадписьРазрешена.Заголовок, "%1%", НаименованеКонтрагента);
	Элементы.ДекорацияНадписьЗапрещена.Заголовок = СтрЗаменить(Элементы.ДекорацияНадписьЗапрещена.Заголовок, "%1%", НаименованеКонтрагента);
	//-- РомановНЕ 20240115 (161623)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтгрузкаРазрешенаЗапрещенаПриИзменении(Элемент)
	
	//++ РомановНЕ 20240115 (161623)
	Модифицированность = НЕ Модифицированность;
	Элементы.ГруппаИзменений.Видимость = Модифицированность;
	//-- РомановНЕ 20240115 (161623)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДополнительнуюИнформацию(Контрагент)
	
	//++ РомановНЕ 20240115 (161623)
	ДополнительнаяИнформация = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних.Период КАК Период,
		|	УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних.ПричинаБлокировкиРазблокировки КАК ПричинаБлокировкиРазблокировки,
		|	УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних.Автор КАК Автор,
		|	УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ДополнительнаяИнформация.Вставить("ОтгрузкаРазрешенаЗапрещена", Перечисления.УВМ_СтатусыБлокировкиКонтрагентов.Разблокирован);
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ДополнительнаяИнформация.Вставить("Дата", Выборка.Период);
		ДополнительнаяИнформация.Вставить("Причина", Выборка.ПричинаБлокировкиРазблокировки);
		ДополнительнаяИнформация.Вставить("Автор", Выборка.Автор);
		ДополнительнаяИнформация.Вставить("ОтгрузкаРазрешенаЗапрещена", Выборка.Статус);
		
	КонецЕсли;
	
	Возврат ДополнительнаяИнформация;
	//-- РомановНЕ 20240115 (161623)
	
КонецФункции

&НаСервере
Процедура ОпределитьДоступностьПользователя()
	
	ДоступКБлокировкеКонтрагентов = Ложь;
	
КонецПроцедуры

#КонецОбласти
