
&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++dar 17.02.26 (309302)
	СвойстваГруппаНомерСтрокой = Новый Структура("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	УВМ_ГруппаНомерСтрокой = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтотОбъект, "УВМ_ГруппаНомерСтрокой", Элементы.ГруппаПериодичностьИНазначение, ,,,,СвойстваГруппаНомерСтрокой);
	
	СвойствоНомерСтрокой = Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);
	СобытияНомерСтрокой = Новый Структура("ПриИзменении", "УВМ_НомерСтрокойПриИзменении");
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_НомерСтрокой", УВМ_ГруппаНомерСтрокой, Истина, "Номер строкой", 1, СвойствоНомерСтрокой, СобытияНомерСтрокой);
	
	СвойстваДлинаНомера = Новый Структура("Видимость", Объект.УВМ_НомерСтрокой);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ДлинаНомера", УВМ_ГруппаНомерСтрокой, Истина,,,,СвойстваДлинаНомера);
	//--dar 17.02.26 (309302)
КонецПроцедуры

//++dar 17.02.26 (309302)
&НаКлиенте
Процедура УВМ_НомерСтрокойПриИзменении(Элемент)
	Элементы["УВМ_ДлинаНомера"].Видимость = Объект.УВМ_НомерСтрокой;
КонецПроцедуры
//--dar 17.02.26 (309302)
