////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// Возвращает массив всех узлов для заданного плана обмена кроме предопределенного узла.
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена как оно задано в конфигураторе.
// 
// Возвращаемое значение:
//  Массив из ПланОбменаСсылка
//   * ПланОбмена.Ссылка
//
Функция УзлыПланаОбмена(ИмяПланаОбмена) Экспорт
	
	Возврат ОбменДаннымиСервер.УзлыПланаОбмена(ИмяПланаОбмена);
	
КонецФункции
#КонецЕсли

// Используется в редакции Докуменнтооборот Холдинга
// Проверяет, является ли этот узел центральным узлом КОД.
//
// Возвращаемое значение:
//	Булево - Истина - если текущий узел является главным узлом или используется редакция с одним узлом (КОРП).
//
Функция ЭтоЦентральныйУзелКОД() Экспорт

	ЭтоЦентральныйУзелКОД = Истина;

	// ХОЛД Начало	
	ЭтоЦентральныйУзелКОД = ПараметрыСеанса.ЭтоЦентральныйУзелКОД;
	// ХОЛД Конец	
	
	Возврат ЭтоЦентральныйУзелКОД;
	
КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Проверяет, является ли этот узел центральным.
//
// Возвращаемое значение:
//	Булево - Истина - если текущий узел является главным узлом Холдинга или используется редакция с одним узлом (КОРП).
//
Функция ЭтоЦентральныйУзел() Экспорт

	ЭтоЦентральныйУзел = Истина;

	// ХОЛД Начало	
	ЭтоЦентральныйУзел = КОДПовтИсп.ЭтоЦентральныйУзел();
	// ХОЛД Конец	
	
	Возврат ЭтоЦентральныйУзел;
	
КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Проверяет, является ли этот узел подчиненный.
//
// Возвращаемое значение:
//	Булево - Истина - если текущий узел является подчиненным узлом Холдинга или - Ложь - если используется редакция 
//  с одним узлом (КОРП).
Функция ЭтоПодчиненныйУзел() Экспорт

	ЭтоПодчиненныйУзел = Ложь;

	// ХОЛД Начало
	ЭтоПодчиненныйУзел = КОДПовтИсп.ЭтоПодчиненныйУзел();
	// ХОЛД Конец

	Возврат ЭтоПодчиненныйУзел;

КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Возвращает идентификатор текущего узла.
//
// Возвращаемое значение:
//	УникальныйИдентификатор
//
Функция ИдентификаторТекущегоУзла() Экспорт

	ИдентификаторТекущегоУзла = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	
	// ХОЛД Начало	
	ИдентификаторТекущегоУзла = КОДПовтИсп.ИдентификаторТекущегоУзла();
	// ХОЛД Конец

	Возврат ИдентификаторТекущегоУзла;
	
КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Возвращаемое значение:
//	Строка - Код текущего узла справочника УзлыКОД
Функция КодТекущегоУзла() Экспорт

	КодТекущегоУзла = "";

	// ХОЛД Начало
	КодТекущегоУзла = КОДПовтИсп.КодТекущегоУзла();
	// ХОЛД Конец

	Возврат КодТекущегоУзла;
	
КонецФункции	

// Используется в редакции Докуменнтооборот Холдинга
// Возвращает Истина, если текущая конфигурация является конфигурацией Документооборот Холдинга.
//
// Возвращаемое значение:
//	Булево - Истина - Если текущая конфигурация является конфигурацией Документооборот Холдинга.
//
Функция ЭтоДокументооборотХолдинга() Экспорт
	
	ЭтоДокументооборотХолдинга = Ложь;

	// ХОЛД Начало
	ЭтоДокументооборотХолдинга = ОбщегоНазначенияДокументооборотПовтИсп.ЭтоДокументооборотХолдинга();
	// ХОЛД Конец

	Возврат ЭтоДокументооборотХолдинга;
	
КонецФункции

// Проверяет, что изменение объекта выполняется процессе загрузки .
//
// Параметры:
//	Объект - КонстантаМенеджерЗначения -
//		   - СправочникОбъект -
//		   - ДокументОбъект -
//		   - БизнесПроцессОбъект -
//		   - ЗадачаОбъект -
//		   - ПланВидовХарактеристикОбъект -
//		   - РегистрСведенийНаборЗаписей -
//		   - РегистрНакопленияНаборЗаписей - Объект, который необходимо проверить.
//
// Возвращаемое значение:
//	Булево - Истина, если выполняется загрузка объекта.
//
Функция ЭтоЗагрузкаОбъекта(Объект) Экспорт

	ЭтоЗагрузкаОбъекта = Ложь;

	// ХОЛД Начало
	ЭтоЗагрузкаОбъекта = КОДСервер.ЭтоЗагрузкаОбъекта(Объект);
	// ХОЛД Конец

	Возврат ЭтоЗагрузкаОбъекта;

КонецФункции

// Проверяет, принадлежит ли объект этому узлу.
// 
// Параметры:
//  Объект - СправочникОбъект,
//			 ДокументОбъект,
//			 БизнесПроцессОбъект,
//			 ЗадачаОбъект - Объект, который необходимо проверить.
// 
// Возвращаемое значение:
//  Булево - Объект принадлежит этому узлу.
//
Функция ЭтоОбъектЭтогоУзла(Объект) Экспорт

	ЭтоОбъектЭтогоУзла = Истина;
	
	// ХОЛД Начало
	СтандартнаяОбработка = Истина;
	
	ЭтоОбъектЭтогоУзла =
		ОбщегоНазначенияДокументооборотХолдинг.ОбъектЭтогоУзла(Объект, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат ЭтоОбъектЭтогоУзла;
	КонецЕсли;
	// ХОЛД Конец
	
	Возврат ЭтоОбъектЭтогоУзла;
	
КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Проверяет, является ли этот узел основным для пользователя.
//
// Параметры:
//	Пользователь - СправочникСсылка.Пользователи - Пользователь, принадлежность которого необходимо проверить.
//
// Возвращаемое значение:
//	Булево - Истина - Этот узел является основным для пользователя.
//
Функция ЭтоОсновнойУзелПользователя(Пользователь) Экспорт
	
	ЭтоОсновнойУзелПользователя = Истина;
	
	// ХОЛД Начало
	ЭтоОсновнойУзелПользователя = КОДСервер.ЭтоОсновнойУзелПользователя(Пользователь);
	// ХОЛД Конец
	
	Возврат ЭтоОсновнойУзелПользователя;
	
КонецФункции

// Используется в редакции Докуменнтооборот Холдинга
// Проверяет, принадлежит ли объект этому узлу.
// 
// Параметры:
//  Объект - СправочникОбъект,
//			 ДокументОбъект,
//			 БизнесПроцессОбъект,
//			 ЗадачаОбъект - Объект, который необходимо проверить.
// 
// Возвращаемое значение:
//  Булево - Объект принадлежит этому узлу.
//
Функция ОбъектЭтогоУзла(Объект) Экспорт

	ОбъектЭтогоУзла = Истина;

	// ХОЛД Начало
	ОбъектЭтогоУзла = КОДСервер.ОбъектЭтогоУзла(Объект);
	// ХОЛД Конец
	
	Возврат ОбъектЭтогоУзла;

КонецФункции

#КонецОбласти