
&НаКлиенте
&ИзменениеИКонтроль("ОбзорHTMLПриНажатии")
Процедура АБ_ОбзорHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда 
		Возврат;
	КонецЕсли;	
	
	#Вставка
	// +++ Миляев 2026-01-23	
	Если СтрНачинаетсяС(ДанныеСобытия.Href, "http") или СтрНачинаетсяС(ДанныеСобытия.Href,"e1c://server/") тогда
		РаботаС_HTMLКлиент.ОткрытьСсылку(Элемент, ДанныеСобытия, СтандартнаяОбработка, ЭтотОбъект);
		Возврат;
	КонецЕсли;
	// --- Миляев 2026-01-23
	#КонецВставки
	
	ПрефиксСсылки = "v8doc:";
	ДлинаПрефикса = СтрДлина(ПрефиксСсылки);

	Если Лев(ДанныеСобытия.Href, ДлинаПрефикса) <> ПрефиксСсылки Тогда 
		Возврат;
	КонецЕсли;	

	НавигационнаяСсылкаПоля = Сред(ДанныеСобытия.Href, ДлинаПрефикса + 1);

	Если СтрНайти(НавигационнаяСсылкаПоля, "ShowLinks") > 0 Тогда

		ОбзорСпискаДокументовКлиент.ПоказатьСвязи(ДанныеСобытия.Href);

		Возврат;
	КонецЕсли;

	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаПоля);

КонецПроцедуры
