
//++dar 13.11.25 (291567)
#Область РегистрыСведений_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов

Процедура ДобавитьПОД_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.РегистрыСведений.УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации         = "ПоПолямПоиска";
	
	ПространствоРасширения = ПространствоРасширенияДО();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоРасширения);
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "ПериодОтбор", 1, , ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "", "КонтрагентОтбор", 1, "Справочник_Контрагенты_Получение", ПространствоРасширения);
	ПравилоКонвертации.ПоляПоиска.Добавить("Контрагент");
КонецПроцедуры

Процедура ПКО_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	ПолученныеДанные.ДополнительныеСвойства.Вставить("ПериодОтбор",
		ДанныеXDTO.ПериодОтбор);
	ПолученныеДанные.ДополнительныеСвойства.Вставить("КонтрагентОтбор",
		ДанныеXDTO.КонтрагентОтбор);
	ПолученныеДанные.ДополнительныеСвойства.Вставить("Записи",
		Неопределено);
	
	Если ДанныеXDTO.Свойство("Записи") И ЗначениеЗаполнено(ДанныеXDTO.Записи) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("Записи", ДанныеXDTO.Записи);
	КонецЕсли;
КонецПроцедуры

Процедура ПКО_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	ПКО_Контрагенты = ОбменДаннымиXDTOСервер.ПКОПоИмени(
		КомпонентыОбмена, "Справочник_Контрагенты_Получение");
	
	КонтрагентСсылка = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(
		КомпонентыОбмена,
		ПолученныеДанные.ДополнительныеСвойства.КонтрагентОтбор,
		ПКО_Контрагенты,
		"ПолучитьСсылку").Ссылка;
		
	ПКО_Пользователи = ОбменДаннымиXDTOСервер.ПКОПоИмени(
		КомпонентыОбмена, "Справочник_Пользователи");
	
	ПКПД_СтатусыБлокировки = КомпонентыОбмена.ПравилаКонвертацииПредопределенныхДанных.Найти("Перечисление_УВМ_СтатусыБлокировкиКонтрагентов", "ИмяПКПД");
		
	ПолученныеДанные.Отбор.Контрагент.Значение = КонтрагентСсылка;
	ПолученныеДанные.Отбор.Контрагент.Использование = Истина;
	
	Если ЗначениеЗаполнено(ПолученныеДанные.ДополнительныеСвойства.ПериодОтбор) Тогда
		ПолученныеДанные.Отбор.Период.Значение = ПолученныеДанные.ДополнительныеСвойства.ПериодОтбор;
		ПолученныеДанные.Отбор.Период.Использование = Истина;
	КонецЕсли;
	
	// Добавление записей в набор записей.
	Если ПолученныеДанные.ДополнительныеСвойства.Записи <> Неопределено Тогда
		Для Каждого Строка Из ПолученныеДанные.ДополнительныеСвойства.Записи Цикл
			СтрокаЗаписи = ПолученныеДанные.Добавить();
			СтрокаЗаписи.Контрагент = КонтрагентСсылка;
			Если ЗначениеЗаполнено(ПолученныеДанные.ДополнительныеСвойства.ПериодОтбор) Тогда
				СтрокаЗаписи.Период = ПолученныеДанные.ДополнительныеСвойства.ПериодОтбор;
			Иначе
				СтрокаЗаписи.Период = ТекущаяДатаСеанса();
			КонецЕсли;
			СтрокаЗаписи.ПричинаБлокировкиРазблокировки = Строка.ПричинаБлокировкиРазблокировки;
			СтрокаЗаписи.Автор = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(
				КомпонентыОбмена,
				Строка.Автор,
				ПКО_Пользователи,
				"ПолучитьСсылку").Ссылка;
			Если ТипЗнч(Строка.Статус) = Тип("Структура") Тогда
				ЗначениеСтатуса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Строка.Статус, "Значение", Неопределено);
				Если ЗначениеСтатуса <> Неопределено Тогда
					СтрокаЗаписи.Статус = Перечисления.УВМ_СтатусыБлокировкиКонтрагентов[ЗначениеСтатуса];
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Справочник_Организации

&ИзменениеИКонтроль("ДобавитьПКО_Справочник_Организации_Получение")
Процедура АБ_ДобавитьПКО_Справочник_Организации_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_Организации_Получение";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.Организации;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.Организации";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Справочник_Организации_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_Организации_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных      = "Организации_ПослеЗаписи";
	ПравилоКонвертации.ВариантИдентификации         = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "ИНН",                    "ИНН");
	ДобавитьПКС(СвойстваШапки, "КодПоОКПО",              "ОКПО");
	ДобавитьПКС(СвойстваШапки, "Комментарий",            "Комментарий");
	ДобавитьПКС(СвойстваШапки, "КПП",                    "КПП");
	ДобавитьПКС(СвойстваШапки, "Наименование",           "Наименование");
	ДобавитьПКС(СвойстваШапки, "НаименованиеПолное",     "НаименованиеПолное");
	ДобавитьПКС(СвойстваШапки, "ОГРН",                   "ОГРН");
	ДобавитьПКС(СвойстваШапки, "ОсновнойБанковскийСчет", "ОсновнойБанковскийСчет", 1, "Справочник_БанковскиеСчета_Получение");
	ДобавитьПКС(СвойстваШапки, "Префикс",                "Префикс");
	ДобавитьПКС(СвойстваШапки, "ЮрФизЛицо",              "", 1);
#Вставка  
	// + СБит 2026-03-26 #УВМ 317078  
	ПространствоИмен = ПространствоИменУВМ();
	ДобавитьПКС(СвойстваШапки, "УВМ_КрупнейшийНалогоплательщик",     "УВМ_КрупнейшийНалогоплательщик",,,ПространствоИмен);
	ДобавитьПКС(СвойстваШапки, "УВМ_КодНалоговогоОрганаПолучателя",     "УВМ_КодНалоговогоОрганаПолучателя",,,ПространствоИмен);
	ДобавитьПКС(СвойстваШапки, "УВМ_КрупнейшийНалогоплательщикКПП",     "УВМ_КрупнейшийНалогоплательщикКПП",,,ПространствоИмен);
	ДобавитьПКС(СвойстваШапки, "УВМ_КрупнейшийНалогоплательщикНаименованиеНалоговогоОргана",     
		"УВМ_КрупнейшийНалогоплательщикНаименованиеНалоговогоОргана",,,ПространствоИмен);
	ДобавитьПКС(СвойстваШапки, "УВМ_КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане", 
		"КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане", 
		1, 
		"Справочник_УВМ_РегистрацииВНалоговомОргане_Получение", 
		ПространствоИмен);
#КонецВставки

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ДополнительныеРеквизиты", "");
	ДобавитьПКС(СвойстваТЧ, "Значение", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Свойство", "", 1, "Справочник_ДополнительныеРеквизиты");

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "КонтактнаяИнформация",    "");
	ДобавитьПКС(СвойстваТЧ, "Вид",           "", 1);
	ДобавитьПКС(СвойстваТЧ, "ЗначенияПолей", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Представление", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Тип",           "", 1);

	ПравилоКонвертации.ПоляПоиска.Добавить("ИНН,КПП");
	ПравилоКонвертации.ПоляПоиска.Добавить("НаименованиеПолное");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Справочник_Организации_Получение_ПриКонвертацииДанныхXDTO")
Процедура АБ_ПКО_Справочник_Организации_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	// ЮрФизЛицо
	Если ДанныеXDTO.КлючевыеСвойства.ЮридическоеФизическоеЛицо.Значение = "ЮридическоеЛицо" Тогда
		ПолученныеДанные.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
	Иначе
		ПолученныеДанные.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель;
	КонецЕсли;

	Если ЭтоЗагрузкаКлючевыхСвойств(ДанныеXDTO) Тогда
		Возврат;
	КонецЕсли;

#Вставка
	// + СБит 2026-04-02 #УВМ 317078
	ПолученныеДанные.УВМ_КрупнейшийНалогоплательщик	= ?(ДанныеXDTO.Свойство("УВМ_КрупнейшийНалогоплательщик"), ДанныеXDTO.УВМ_КрупнейшийНалогоплательщик, "");
	//++GIV 09042026 (317078)
	ПолученныеДанные.УВМ_КодНалоговогоОрганаПолучателя	= ?(ДанныеXDTO.Свойство("УВМ_КодНалоговогоОрганаПолучателя"), ДанныеXDTO.УВМ_КодНалоговогоОрганаПолучателя, "");
	ПолученныеДанные.УВМ_КрупнейшийНалогоплательщикКПП	= ?(ДанныеXDTO.Свойство("УВМ_КрупнейшийНалогоплательщикКПП"), ДанныеXDTO.УВМ_КрупнейшийНалогоплательщикКПП, "");
	ПолученныеДанные.УВМ_КрупнейшийНалогоплательщикНаименованиеНалоговогоОргана	= ?(ДанныеXDTO.Свойство("УВМ_КрупнейшийНалогоплательщикНаименованиеНалоговогоОргана"), 
	ДанныеXDTO.УВМ_КрупнейшийНалогоплательщикНаименованиеНалоговогоОргана, "");
	//--GIV 09042026 (317078)
	тКрупнейшийНалогоплательщикРегистрацияВНалоговомОргане = Справочники.УВМ_РегистрацииВНалоговомОргане.ПустаяСсылка();
	Если ДанныеXDTO.Свойство("КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане") Тогда
		ПравилоКонвертацииРегистрация = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_УВМ_РегистрацииВНалоговомОргане_Получение");
		тКрупнейшийНалогоплательщикРегистрацияВНалоговомОргане = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, 
			ДанныеXDTO.КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане, ПравилоКонвертацииРегистрация, "ПолучитьСсылку");
 	КонецЕсли;
	ПолученныеДанные.УВМ_КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане	= тКрупнейшийНалогоплательщикРегистрацияВНалоговомОргане;
	// - СБит 2026-04-02 #УВМ
#КонецВставки
	ЗагрузитьДополнительныеРеквизиты(
	ПолученныеДанные,
	ДанныеXDTO,
	КомпонентыОбмена,
	Истина);
	ЗагрузитьКонтактнуюИнформацию(
	ДанныеXDTO,
	ПолученныеДанные,
	Справочники.ВидыКонтактнойИнформации.СправочникОрганизации);
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Справочник_Организации_Получение_ПередЗаписьюПолученныхДанных")
Процедура АБ_ПКО_Справочник_Организации_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	// Сделаем слияние полученной контактной информации и значений доп. реквизитов с уже имеющимися в ИБ данными.
	Если ДанныеИБ <> Неопределено Тогда
		ВыполнитьСлияниеТаблиц(ПолученныеДанные.КонтактнаяИнформация, ДанныеИБ.КонтактнаяИнформация, "Тип,Вид");
		ВыполнитьСлияниеТаблиц(ПолученныеДанные.ДополнительныеРеквизиты, ДанныеИБ.ДополнительныеРеквизиты, "Свойство");
	КонецЕсли;

	ЗагрузитьДополнительныеСведения(
	?(ДанныеИБ = Неопределено,
	ПолученныеДанные.ПолучитьСсылкуНового(),
	ДанныеИБ.Ссылка),
	ПолученныеДанные.ДополнительныеСвойства,
	КомпонентыОбмена);

	ДобавитьСвязьОбъектаДОИВнешнегоОбъекта(
	ДанныеИБ,
	ПолученныеДанные,
	"Справочник.Организации");

	#Вставка
	//++dar 30.01.26 (307770) 
	УВМ_СсылкаНаОрганизацию = ?(ДанныеИБ = Неопределено, ПолученныеДанные.ПолучитьСсылкуНового(), ДанныеИБ.Ссылка);
	Если ЗначениеЗаполнено(ПолученныеДанные.Префикс) Тогда 
		РегистрыСведений.ИндексыНумерации.ЗаписатьИндексНумерации(УВМ_СсылкаНаОрганизацию, ПолученныеДанные.Префикс);
	Иначе 
		РегистрыСведений.ИндексыНумерации.УдалитьИндексНумерации(УВМ_СсылкаНаОрганизацию);
	КонецЕсли;
	//--dar 30.01.26 (307770)
	#КонецВставки
	ДобавитьПризнакЭтоНовый(ПолученныеДанные, ДанныеИБ);

	// Обновление адресной книги
	ОбновитьДанныеОрганизацииВАдреснойКниге = Ложь;
	ОбновитьСловаПоискаПоОрганизацииВАдреснойКниге = Ложь;
	ОбновитьДанныеОтображенияОрганизацииВАдреснойКниге = Ложь;
	ОбновитьДоступностьВПоискеПоОрганизации = Ложь;

	Если ДанныеИБ = Неопределено Тогда

		ОбновитьДанныеОрганизацииВАдреснойКниге = Истина;
		ОбновитьСловаПоискаПоОрганизацииВАдреснойКниге = Истина;

		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"ОбновитьДанныеОрганизацииВАдреснойКниге",
		ОбновитьДанныеОрганизацииВАдреснойКниге);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"ОбновитьСловаПоискаПоОрганизацииВАдреснойКниге",
		ОбновитьСловаПоискаПоОрганизацииВАдреснойКниге);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"ОбновитьДанныеОтображенияОрганизацииВАдреснойКниге",
		ОбновитьДанныеОтображенияОрганизацииВАдреснойКниге);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"ОбновитьДоступностьВПоискеПоОрганизации",
		ОбновитьДоступностьВПоискеПоОрганизации);

	Иначе

		РеквизитыРолиПоСсылке = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДанныеИБ.Ссылка, "Наименование, ПометкаУдаления");

		Если РеквизитыРолиПоСсылке.ПометкаУдаления <> ПолученныеДанные.ПометкаУдаления Тогда
			ОбновитьДанныеОрганизацииВАдреснойКниге = Истина;
			ОбновитьДанныеОтображенияОрганизацииВАдреснойКниге = Истина;
			ОбновитьДоступностьВПоискеПоОрганизации = Истина;
		КонецЕсли;

		Если РеквизитыРолиПоСсылке.Наименование <> ПолученныеДанные.Наименование Тогда
			ОбновитьДанныеОрганизацииВАдреснойКниге = Истина;
			ОбновитьДанныеОтображенияОрганизацииВАдреснойКниге = Истина;
			ОбновитьСловаПоискаПоОрганизацииВАдреснойКниге = Истина;
		КонецЕсли;

		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"ОбновитьДанныеОрганизацииВАдреснойКниге",
		ОбновитьДанныеОрганизацииВАдреснойКниге);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"ОбновитьСловаПоискаПоОрганизацииВАдреснойКниге",
		ОбновитьСловаПоискаПоОрганизацииВАдреснойКниге);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"ОбновитьДанныеОтображенияОрганизацииВАдреснойКниге",
		ОбновитьДанныеОтображенияОрганизацииВАдреснойКниге);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"ОбновитьДоступностьВПоискеПоОрганизации",
		ОбновитьДоступностьВПоискеПоОрганизации);

	КонецЕсли;

	// Определим основной банковский счет.
	ОбновитьОсновнойБанковскийСчет(ПолученныеДанные, ДанныеИБ);
КонецПроцедуры

#КонецОбласти

#Область Справочник_УВМ_РегистрацииВНалоговомОргане

Процедура ДобавитьПОД_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_УВМ_РегистрацииВНалоговомОргане_Получение";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.УВМ_РегистрацииВНалоговомОргане;
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.РегистрацииВНалоговомОргане";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_УВМ_РегистрацииВНалоговомОргане_Получение");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоИменУВМ());

	ПравилоКонвертации.ИмяПКО                       = "Справочник_УВМ_РегистрацииВНалоговомОргане_Получение";
	ПравилоКонвертации.ПространствоИмен 			= ПространствоИменУВМ();
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.УВМ_РегистрацииВНалоговомОргане;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.РегистрацииВНалоговомОргане";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение_ПередЗаписьюПолученныхДанных";
	//++GIV 09042026 (317078)
	//ПравилоКонвертации.ПослеЗагрузкиВсехДанных      = "ОтложеннаяОбработка_ОтразитьВИсторииКПП;
	//--GIV 09042026 (317078)
	ПравилоКонвертации.ВариантИдентификации         = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска"; 
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Владелец");
	ПравилоКонвертации.ПоляПоиска.Добавить("Код");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");

	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Владелец",                                 "", 1);
	//ДобавитьПКС(СвойстваШапки, "ДатаПостановкиНаУчет",                     "", 1);
	//++GIV 09042026 (317078)
	ДобавитьПКС(СвойстваШапки, "ДатаПостановкиНаУчет",                     "ДатаПостановкиНаУчет");
	//--GIV 09042026 (317078)
	ДобавитьПКС(СвойстваШапки, "Код",                                      "КодНалоговогоОргана");
	ДобавитьПКС(СвойстваШапки, "КПП",                                      "КПП");
	ДобавитьПКС(СвойстваШапки, "Наименование",                             "КраткоеНаименованиеНалоговогоОргана");
	ДобавитьПКС(СвойстваШапки, "НаименованиеИФНС",                         "НаименованиеИФНС");
	ДобавитьПКС(СвойстваШапки, "НаименованиеОбособленногоПодразделения",   "НаименованиеОбособленногоПодразделения", 1);
	ДобавитьПКС(СвойстваШапки, "",                                         "Организация", 1);
	//++GIV 09042026 (317078)
	ДобавитьПКС(СвойстваШапки, "ДатаСнятияСУчета",                     "ДатаСнятияСУчета");
	ДобавитьПКС(СвойстваШапки, "КодРегиона",                     "КодРегиона");
	//--GIV 09042026 (317078)
	//++GIV 14042026 (бн)
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "КонтактнаяИнформация", "");
	ДобавитьПКС(СвойстваТЧ, "Вид",           "", 1);
	ДобавитьПКС(СвойстваТЧ, "ЗначенияПолей", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Представление", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Тип",           "", 1);
	//--GIV 14042026 (бн)
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Владелец,Код,КПП");
	ПравилоКонвертации.ПоляПоиска.Добавить("Владелец,Код");
КонецПроцедуры

Процедура ПКО_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	Организация = Неопределено;
	Если ДанныеXDTO.Свойство("КлючевыеСвойства") Тогда
		ДанныеXDTO.КлючевыеСвойства.Свойство("Организация", Организация);
	Иначе
		ДанныеXDTO.Свойство("Организация", Организация);
	КонецЕсли;
	ПолученныеДанные.ДополнительныеСвойства.Вставить("Владелец", Новый Структура("Значение, ИмяПКО", Организация, "Справочник_Организации_Получение"));
	//++GIV 09042026 (317078)
	Если ДанныеXDTO.Свойство("ДатаПостановкиНаУчет") Тогда
		ПолученныеДанные.ДатаПостановкиНаУчет = ПрочитатьДатуJSON(ДанныеXDTO.ДатаПостановкиНаУчет, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если ДанныеXDTO.Свойство("ДатаСнятияСУчета") Тогда
		ПолученныеДанные.ДатаСнятияСУчета = ПрочитатьДатуJSON(ДанныеXDTO.ДатаСнятияСУчета, ФорматДатыJSON.ISO);
	КонецЕсли;  
	
	ПолученныеДанные.ДополнительныеСвойства.Вставить("ЗаписатьИсториюКПП", AdditionalInfoПолучить(ДанныеXDTO, "ЗаписатьИсториюКПП", Ложь));
	//--GIV 09042026 (317078)
	//++GIV 14042026 (бн)
	Если ДанныеXDTO.Свойство("КонтактнаяИнформация") Тогда
		Для каждого СтрокаДанныхXDTOКонтактная Из ДанныеXDTO.КонтактнаяИнформация Цикл
			Если СтрокаДанныхXDTOКонтактная.ВидКонтактнойИнформации = "ПользовательскаяКИАдрес" Тогда 
				ТекВидКИ = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
			ИначеЕсли СтрокаДанныхXDTOКонтактная.ВидКонтактнойИнформации = "ЮридическийАдрес" Тогда
				ТекВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИдентификаторДляФормул", "АдресНалоговогоОргана");
			ИначеЕсли СтрокаДанныхXDTOКонтактная.ВидКонтактнойИнформации = "Телефон" Тогда
				ТекВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
			Иначе
				ТекВидКИ = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации;
			КонецЕсли;
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(
			ПолученныеДанные,
			СокрЛП(СтрокаДанныхXDTOКонтактная.ЗначенияПолей),
			ТекВидКИ);
		КонецЦикла;
	КонецЕсли;
	//ЗагрузитьКонтактнуюИнформацию(
	//ДанныеXDTO,
	//ПолученныеДанные,
	//Справочники.ВидыКонтактнойИнформации.СправочникОрганизации);
	//--GIV 14042026 (бн)
КонецПроцедуры

Процедура ПКО_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	//++GIV 09042026 (317078)
	Если ПолученныеДанные.ДополнительныеСвойства.Свойство("ЗаписатьИсториюКПП")  Тогда
		Если ЗначениеЗаполнено(ПолученныеДанные.ДополнительныеСвойства.ЗаписатьИсториюКПП) Тогда 
			мЗаписи = РегистрыСведений.ИсторияКППЮрлиц.СоздатьМенеджерЗаписи();
			мЗаписи.КПП = ПолученныеДанные.КПП;
			мЗаписи.Юрлицо = ПолученныеДанные.Владелец;
			мЗаписи.Период = ПолученныеДанные.ДатаПостановкиНаУчет;
			Попытка
				мЗаписи.Записать(Истина);
			Исключение
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обмен данными", УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Справочники.УВМ_РегистрацииВНалоговомОргане, 
				"Ошибка записи истории КПП", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	//--GIV 09042026 (317078)
	//++GIV 14042026 (бн)
	Если ДанныеИБ <> Неопределено Тогда
		ВыполнитьСлияниеТаблиц(ПолученныеДанные.КонтактнаяИнформация, ДанныеИБ.КонтактнаяИнформация, "Тип,Вид");
	КонецЕсли;
	//--GIV 14042026 (бн)
КонецПроцедуры

#КонецОбласти

#Область РегистрыСведений_УВМ_ИсторияРегистрацийВНалоговомОргане

Процедура ДобавитьПОД_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение";
	ПравилоОбработки.ПриОбработке            = "ПОД_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПриОбработке";
	ПравилоОбработки.ОбъектВыборкиФормат     = "РегистрСведений.КрупнейшийНалогоплательщикИсторияРегистрацийВНалоговомОргане";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение");
КонецПроцедуры

Процедура ДобавитьПКО_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение(ПравилаКонвертации) 
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);

	ПравилоКонвертации.ИмяПКО                       = "РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение";
	ПравилоКонвертации.ПространствоИмен				= ПространствоИменУВМ();
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.РегистрыСведений.УВМ_ИсторияРегистрацийВНалоговомОргане;
	ПравилоКонвертации.ОбъектФормата                = "РегистрСведений.КрупнейшийНалогоплательщикИсторияРегистрацийВНалоговомОргане";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации         = "ПоПолямПоиска";
	
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоИменУВМ());
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Период");
	ПравилоКонвертации.ПоляПоиска.Добавить("Организация");

	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "ПериодОтбор", 1, , ПространствоИменУВМ());
	ДобавитьПКС(СвойстваШапки, "", "СтруктурнаяЕдиницаОтбор", 1, "Справочник_Организации_Получение");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Записи");
	ДобавитьПКС(СвойстваТЧ, "", "Период", 			1);
	ДобавитьПКС(СвойстваТЧ, "Организация", "СтруктурнаяЕдиница", 		1, "Справочник_Организации_Получение");
	ДобавитьПКС(СвойстваТЧ, "", "РегистрацияВНалоговомОргане",	1, "Справочник_УВМ_РегистрацииВНалоговомОргане_Получение"); 
	
КонецПроцедуры

Процедура ПОД_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПриОбработке(ДанныеXDTO, ИспользованиеПКО, КомпонентыОбмена)
	
	СвойстваОтбор = ДанныеXDTO;
	Если ДанныеXDTO.Свойство("КлючевыеСвойства") Тогда
		СвойстваОтбор = ДанныеXDTO.КлючевыеСвойства;
	КонецЕсли;
	Если ДанныеXDTO.Свойство("Записи") Тогда
		Записи = ДанныеXDTO.Записи;
	Иначе
		Записи = Новый ТаблицаЗначений;
	КонецЕсли;
	
	тПериод         = Дата(1,1,1);
	тОрганизация   	= Справочники.Организации.ПустаяСсылка();
	ПериодОтбор         = Неопределено; 
	ОрганизацияОтбор   	= Неопределено;
	
	СвойстваОтбор.Свойство("ПериодОтбор",       	ПериодОтбор);
	СвойстваОтбор.Свойство("СтруктурнаяЕдиницаОтбор",  	ОрганизацияОтбор);
	
	Если ЗначениеЗаполнено(ОрганизацияОтбор) Тогда
		ПравилоКонвертацииОрганизация = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Организации_Получение");
		тОрганизация = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, ОрганизацияОтбор, ПравилоКонвертацииОрганизация, "ПолучитьСсылку");
	КонецЕсли;
	тПериод = ПериодОтбор;
	
	ИсторияРегистраций = РегистрыСведений.УВМ_ИсторияРегистрацийВНалоговомОргане.СоздатьНаборЗаписей();
	ИсторияРегистраций.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	ИсторияРегистраций.Отбор.Период.Установить(тПериод);
	ИсторияРегистраций.Отбор.Организация.Установить(тОрганизация);
	
	Для Каждого Запись Из Записи Цикл
		ЗаписьИсторияРегистраций = ИсторияРегистраций.Добавить();
		
		ЗаписьИсторияРегистраций.Период = тПериод;
		ЗаписьИсторияРегистраций.Организация = тОрганизация;  
		
		Если ЗначениеЗаполнено(Запись.РегистрацияВНалоговомОргане) Тогда
			ПравилоКонвертацииНалог = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_УВМ_РегистрацииВНалоговомОргане_Получение");
			ЗаписьИсторияРегистраций.РегистрацияВНалоговомОргане = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Запись.РегистрацияВНалоговомОргане, ПравилоКонвертацииНалог, "ПолучитьСсылку");
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(тОрганизация.Ссылка) Тогда
		ИсторияРегистраций.ОбменДанными.Загрузка = Истина;  
		ИсторияРегистраций.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПКО_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	ПолученныеДанные.ДополнительныеСвойства.Вставить("ПериодОтбор",		ДанныеXDTO.ПериодОтбор);
	ПолученныеДанные.ДополнительныеСвойства.Вставить("ОрганизацияОтбор",ДанныеXDTO.СтруктурнаяЕдиницаОтбор);
	ПолученныеДанные.ДополнительныеСвойства.Вставить("Записи",          Неопределено);
	
	Если ДанныеXDTO.Свойство("Записи") И ЗначениеЗаполнено(ДанныеXDTO.Записи) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("Записи", ДанныеXDTO.Записи);
	КонецЕсли;
КонецПроцедуры

Процедура ПКО_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)

	ОрганизацияСсылка = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(
		КомпонентыОбмена,
		ПолученныеДанные.ДополнительныеСвойства.ОрганизацияОтбор,
		ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Организации_Получение"),
		"ПолучитьСсылку").Ссылка;
		
	ПолученныеДанные.Отбор.Организация.Значение = ОрганизацияСсылка;
	ПолученныеДанные.Отбор.Организация.Использование = Истина;
	
	Если ЗначениеЗаполнено(ПолученныеДанные.ДополнительныеСвойства.ПериодОтбор) Тогда
		ПолученныеДанные.Отбор.Период.Значение = ПолученныеДанные.ДополнительныеСвойства.ПериодОтбор;
		ПолученныеДанные.Отбор.Период.Использование = Истина;
	КонецЕсли;
	
	// Добавление записей в набор записей.
	Если ПолученныеДанные.ДополнительныеСвойства.Записи <> Неопределено Тогда
		Для Каждого Строка Из ПолученныеДанные.ДополнительныеСвойства.Записи Цикл
			СтрокаЗаписи = ПолученныеДанные.Добавить();
			СтрокаЗаписи.Организация = ОрганизацияСсылка;
			Если ЗначениеЗаполнено(ПолученныеДанные.ДополнительныеСвойства.ПериодОтбор) Тогда
				СтрокаЗаписи.Период = ПолученныеДанные.ДополнительныеСвойства.ПериодОтбор;
			Иначе
				СтрокаЗаписи.Период = ТекущаяДатаСеанса();
			КонецЕсли;
			СтрокаЗаписи.РегистрацияВНалоговомОргане = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(
				КомпонентыОбмена,
				Строка.РегистрацияВНалоговомОргане,
				ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_УВМ_РегистрацииВНалоговомОргане_Получение"),
				"ПолучитьСсылку").Ссылка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

// - СБит 2026-03-24 #УВМ

// + СБит 2026-03-26 #УВМ 317078
Функция ПространствоИменУВМ()
	Возврат "http://v8.1c.ru/edi/edi_stnd/ED_Ext_UVM/1.17";
КонецФункции	

#Область ПроцедурыКонвертации

&После("ЗаполнитьПравилаОбработкиДанных")
Процедура АБ_ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных)
	Если НаправлениеОбмена = "Отправка" Тогда
		//++dar 12.03.26 (309302)
		ДобавитьПОД_Справочник_Файлы_Отправка(ПравилаОбработкиДанных);
		//--dar 12.03.26 (309302)
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда
		ДобавитьПОД_Справочник_Сотрудники_Получение(ПравилаОбработкиДанных);
		//++dar 13.11.25 (291567)
		ДобавитьПОД_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение(ПравилаОбработкиДанных);
		//--dar 13.11.25 (291567)
		
		//++dar 03.02.26 (307331)
		ДобавитьПОД_Справочник_КонтактныеЛицаКонтрагентов_Получение(ПравилаОбработкиДанных);
		//--dar 03.02.26 (307331)
		// +++ Миляев (293293) 2026.02.04
		ДобавитьПОД_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение(ПравилаОбработкиДанных);
		// --- Миляев (293293) 2026.02.04
        // + СБит 2026-03-24 #УВМ 317078 
		ДобавитьПОД_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение(ПравилаОбработкиДанных);
		// - СБит 2026-03-24 #УВМ
	КонецЕсли;
КонецПроцедуры

&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура АБ_ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации)
	Если НаправлениеОбмена = "Отправка" Тогда
		//++dar 12.03.26 (309302)
		ДобавитьПКО_Справочник_Файлы_Отправка(ПравилаКонвертации);
		//--dar 12.03.26 (309302)
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда
		ДобавитьПКО_Справочник_Сотрудники_Получение(ПравилаКонвертации);
		//++dar 13.11.25 (291567)
		ДобавитьПКО_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение(ПравилаКонвертации);
		//--dar 13.11.25 (291567)
		
		//++dar 03.02.26 (307331)
		ДобавитьПКО_Справочник_КонтактныеЛицаКонтрагентов_Получение(ПравилаКонвертации);
		//--dar 03.02.26 (307331)
		// +++ Миляев (293293) 2026.02.04
		ДобавитьПКО_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение(ПравилаКонвертации);
		// --- Миляев (293293) 2026.02.04
		// + СБит 2026-03-24 #УВМ 317078 
		ДобавитьПКО_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение(ПравилаКонвертации);
		ДобавитьПКО_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение(ПравилаКонвертации);
		// - СБит 2026-03-24 #УВМ
	КонецЕсли;

КонецПроцедуры

&После("ЗаполнитьПравилаКонвертацииПредопределенныхДанных")
Процедура АБ_ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации)
	
	//++dar 13.11.25 (291567)
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_УВМ_СтатусыБлокировкиКонтрагентов";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.УВМ_СтатусыБлокировкиКонтрагентов;
	ПравилоКонвертации.ТипXDTO   = "УВМ_СтатусыБлокировкиКонтрагентов";
	
	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.УВМ_СтатусыБлокировкиКонтрагентов.Заблокирован, "Заблокирован");
	ЗначенияДляОтправки.Вставить(Перечисления.УВМ_СтатусыБлокировкиКонтрагентов.Разблокирован, "Разблокирован");
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляОтправки;
	//--dar 13.11.25 (291567)

КонецПроцедуры

&После("ВыполнитьПроцедуруМодуляМенеджера")
Процедура АБ_ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры)

	Если ИмяПроцедуры = "ПКО_Справочник_Сотрудники_ПриКонвертацииДанныхXDTO" Тогда 
		АБ_ПКО_Справочник_Сотрудники_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена); 
	//++dar 13.11.25 (291567)
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Справочник_УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	//--dar 13.11.25 (291567)
	
	// + СБит 2026-03-24 #УВМ 317078
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Справочник_УВМ_РегистрацииВНалоговомОргане_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПриОбработке" Тогда 
		ПОД_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПриОбработке(
		Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_РегистрСведений_УВМ_ИсторияРегистрацийВНалоговомОргане_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	// - СБит 2026-03-24 #УВМ
	
	// +++ Миляев (293293) 2026.02.04
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение_ПриКонвертацииДанныхXDTO" тогда
		ПКО_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	// --- Миляев (293293) 2026.02.04
		
	//++dar 03.02.26 (307331)
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_КонтактныеЛицаКонтрагентов_Получение_ПриКонвертацииДанныхXDTO" Тогда
		ПКО_Справочник_КонтактныеЛицаКонтрагентов_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_КонтактныеЛицаКонтрагентов_Получение_ПередЗаписьюПолученныхДанных" Тогда		
		ПКО_Справочник_КонтактныеЛицаКонтрагентов_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	//--dar 03.02.26 (307331)
		
	//++dar 12.03.26 (309302)
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Файлы_Отправка_ПриОтправкеДанных" Тогда
		ПКО_Справочник_Файлы_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	//--dar 12.03.26 (309302)
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Справочники

#Область Справочник_Сотрудники

Процедура ДобавитьПОД_Справочник_Сотрудники_Получение(ПравилаОбработкиДанных)
	
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_Сотрудники_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.Сотрудники";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Сотрудники_Получение");
	
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Сотрудники_Получение(ПравилаКонвертации)	

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	
	ПравилоКонвертации.ВариантИдентификации         = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации.ИмяПКО            = "Справочник_Сотрудники_Получение";
	ПравилоКонвертации.ОбъектФормата     = "Справочник.Сотрудники";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.Сотрудники;
	ПравилоКонвертации.ПространствоИмен  = "http://v8.1c.ru/edi/AB_edi_stnd/EnterpriseData/1.17";
	
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Справочник_Сотрудники_ПриКонвертацииДанныхXDTO";

	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, "http://v8.1c.ru/edi/AB_edi_stnd/EnterpriseData/1.17");
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование",   "Наименование");
	ДобавитьПКС(СвойстваШапки, "Должность", 	 "Должность", 	   , "Справочник_Должности_Получение", "http://v8.1c.ru/edi/AB_edi_stnd/EnterpriseData/1.17");
	ДобавитьПКС(СвойстваШапки, "Владелец", 		 "Владелец",  	   , "Справочник_ФизическиеЛица_Получение", "http://v8.1c.ru/edi/AB_edi_stnd/EnterpriseData/1.17");
	ДобавитьПКС(СвойстваШапки, "Подразделение",  "Подразделение", 1, "Справочник_СтруктураПредприятия_Получение");
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование,Владелец");

КонецПроцедуры

Процедура АБ_ПКО_Справочник_Сотрудники_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	
	Подразделение = ОбменДаннымиXDTOСервер.СсылкаОбъектаПоУИДОбъектаXDTO(
							ДанныеXDTO.Подразделение,
							Тип("СправочникСсылка.СтруктураПредприятия"),
							КомпонентыОбмена);
			
	ПолученныеДанные.Подразделение = Подразделение;

КонецПроцедуры

#КонецОбласти

#Область Справочник_СтруктураПредприятия

&После("ДобавитьПКО_Справочник_СтруктураПредприятия_Получение")
Процедура АБ_ДобавитьПКО_Справочник_СтруктураПредприятия_Получение(ПравилаКонвертации)
	
	ПравилоКонвертации = ПравилаКонвертации.Найти("Справочник_СтруктураПредприятия_Получение", "ИмяПКО");
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Руководитель",   "Руководитель", 1, "Справочник_Сотрудники_Получение");
	
	//++dar 30.01.26 (307770)
	ПространствоРасширения = ПространствоРасширенияДО();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоРасширения);	
	ДобавитьПКС(СвойстваШапки, "УВМ_ПрефиксПодразделения",  "УВМ_ПрефиксПодразделения", , "Справочник_СтруктураПредприятия_Получение", ПространствоРасширения);
	//--dar 30.01.26 (307770)
	
КонецПроцедуры

&После("ПКО_Справочник_СтруктураПредприятия_Получение_ПриКонвертацииДанныхXDTO")
Процедура АБ_ПКО_Справочник_СтруктураПредприятия_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	
	Если ДанныеXDTO.Свойство("AdditionalInfo") И ТипЗнч(ДанныеXDTO.AdditionalInfo)=Тип("Структура") Тогда //ED
		
		ДопДанные = ДанныеXDTO.AdditionalInfo;
		
		Если ДопДанные.Свойство("Руководитель") Тогда
			
			Руководитель = ОбменДаннымиXDTOСервер.СсылкаОбъектаПоУИДОбъектаXDTO(
							ДопДанные.Руководитель,
							Тип("СправочникСсылка.Сотрудники"),
							КомпонентыОбмена);
			
			ПолученныеДанные.Руководитель = Руководитель;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Справочник_СтруктураПредприятия_Получение_ПередЗаписьюПолученныхДанных")
Процедура АБ_ПКО_Справочник_СтруктураПредприятия_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	// Сделаем слияние полученной контактной информации и значений доп. реквизитов с уже имеющимися в ИБ данными.
	Если ДанныеИБ <> Неопределено Тогда
		ВыполнитьСлияниеТаблиц(ПолученныеДанные.ДополнительныеРеквизиты, ДанныеИБ.ДополнительныеРеквизиты, "Свойство");
	КонецЕсли;

	ДобавитьПризнакЭтоНовый(ПолученныеДанные, ДанныеИБ);

	ЗагрузитьДополнительныеСведения(
	?(ДанныеИБ = Неопределено,
	ПолученныеДанные.ПолучитьСсылкуНового(),
	ДанныеИБ.Ссылка),
	ПолученныеДанные.ДополнительныеСвойства,
	КомпонентыОбмена);

	Если ДанныеИБ = Неопределено Тогда
		УказанОсобыйРанг = ПолученныеДанные.УказанОсобыйРанг;
		Ранг = ПолученныеДанные.Ранг;
	Иначе
		РеквизитыПодразделенияПоСсылке = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДанныеИБ.Ссылка,
		"Руководитель, Родитель, ПометкаУдаления, Наименование, Ранг, УказанОсобыйРанг");
		УказанОсобыйРанг = РеквизитыПодразделенияПоСсылке.УказанОсобыйРанг;
		Ранг = РеквизитыПодразделенияПоСсылке.Ранг;
		#Вставка
		//++dar 29.01.26 (308318)
		Если НЕ ЗначениеЗаполнено(ПолученныеДанные.Руководитель) И ЗначениеЗаполнено(РеквизитыПодразделенияПоСсылке.Руководитель) Тогда
			ПолученныеДанные.Руководитель = РеквизитыПодразделенияПоСсылке.Руководитель;
		КонецЕсли;
		//--dar 29.01.26 (308318)
		#КонецВставки
	КонецЕсли;
	#Вставка
	//++dar 30.01.26 (307770)
	УВМ_СсылкаНаПодразделение = ?(ДанныеИБ = Неопределено, ПолученныеДанные.ПолучитьСсылкуНового(), ДанныеИБ.Ссылка);
	Если ЗначениеЗаполнено(ПолученныеДанные.УВМ_ПрефиксПодразделения) Тогда 
		РегистрыСведений.ИндексыНумерации.ЗаписатьИндексНумерации(УВМ_СсылкаНаПодразделение, ПолученныеДанные.УВМ_ПрефиксПодразделения);
	Иначе 
		РегистрыСведений.ИндексыНумерации.УдалитьИндексНумерации(УВМ_СсылкаНаПодразделение);
	КонецЕсли;
	//--dar 30.01.26 (307770)
	#КонецВставки
	
	Если Не ЗначениеЗаполнено(ПолученныеДанные.Ранг) Тогда
		Если УказанОсобыйРанг Тогда
			ПолученныеДанные.Ранг = Ранг;
		ИначеЕсли Не ЗначениеЗаполнено(ПолученныеДанные.Родитель) Тогда
			ПолученныеДанные.Ранг = 1;
		Иначе
			ПолученныеДанные.Ранг = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ПолученныеДанные.Родитель, "Ранг") + 1;
		КонецЕсли;
	КонецЕсли;

	// Обновление адресной книги
	ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге = Ложь;
	ОбновитьДанныеСотрудниковПодразделенияВАдреснойКниге = Истина;
	ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге = Ложь;
	ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге = Ложь;
	ОбновитьДоступностьВПоискеПоСтруктуреПредприятия = Ложь;
	ИзмененРанг = Ложь;

	Если ДанныеИБ = Неопределено Тогда

		ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге = Истина;
		ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге = Истина;
		ИзмененРанг = Истина;

		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге",
		ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"ОбновитьДанныеСотрудниковПодразделенияВАдреснойКниге",
		ОбновитьДанныеСотрудниковПодразделенияВАдреснойКниге);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге",
		ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге",
		ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"ОбновитьДоступностьВПоискеПоСтруктуреПредприятия",
		ОбновитьДоступностьВПоискеПоСтруктуреПредприятия);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"ИзмененРанг",
		ИзмененРанг);

		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"СтарыйРуководитель",
		Неопределено);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"СтарыйРодитель",
		Неопределено);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"СтараяПометкаУдаления",
		Неопределено);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"СтарыйРанг",
		Неопределено);
		ПолученныеДанные.ДополнительныеСвойства.Вставить(
		"СтарыйУказанОсобыйРанг",
		Неопределено);

	Иначе

		Если РеквизитыПодразделенияПоСсылке.Родитель <> ПолученныеДанные.Родитель Тогда
			ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге = Истина;
		КонецЕсли;
		Если РеквизитыПодразделенияПоСсылке.ПометкаУдаления <> ПолученныеДанные.ПометкаУдаления Тогда
			ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге = Истина;
			ОбновитьДанныеСотрудниковПодразделенияВАдреснойКниге = Истина;
			ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге = Истина;
			ОбновитьДоступностьВПоискеПоСтруктуреПредприятия = Истина;
		КонецЕсли;
		Если РеквизитыПодразделенияПоСсылке.Наименование <> ПолученныеДанные.Наименование Тогда
			ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге = Истина;
			ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге = Истина;
			ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге = Истина;
		КонецЕсли;

		Если РеквизитыПодразделенияПоСсылке.Ранг <> ПолученныеДанные.Ранг Тогда
			ИзмененРанг = Истина;
		КонецЕсли;

		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге",
		ОбновитьДанныеСтруктурыПредприятияВАдреснойКниге);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"ОбновитьДанныеСотрудниковПодразделенияВАдреснойКниге",
		ОбновитьДанныеСотрудниковПодразделенияВАдреснойКниге);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге",
		ОбновитьДанныеОтображенияСтруктурыПредприятияВАдреснойКниге);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге",
		ОбновитьСловаПоискаПоСтруктуреПредприятияВАдреснойКниге);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"ОбновитьДоступностьВПоискеПоСтруктуреПредприятия",
		ОбновитьДоступностьВПоискеПоСтруктуреПредприятия);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"ИзмененРанг",
		ИзмененРанг);

		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"СтарыйРуководитель",
		РеквизитыПодразделенияПоСсылке.Руководитель);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"СтарыйРодитель",
		РеквизитыПодразделенияПоСсылке.Родитель);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"СтараяПометкаУдаления",
		РеквизитыПодразделенияПоСсылке.ПометкаУдаления);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"СтарыйРанг",
		РеквизитыПодразделенияПоСсылке.Ранг);
		ДанныеИБ.ДополнительныеСвойства.Вставить(
		"СтарыйУказанОсобыйРанг",
		РеквизитыПодразделенияПоСсылке.УказанОсобыйРанг);

	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Справочник_ФизическиеЛица

&После("ДобавитьПКО_Справочник_ФизическиеЛица_Получение")
Процедура АБ_ДобавитьПКО_Справочник_ФизическиеЛица_Получение(ПравилаКонвертации)
	
	ПравилоКонвертации = ПравилаКонвертации.Найти("Справочник_ФизическиеЛица_Получение", "ИмяПКО");
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "",   "АБ_СоздатьПользователя", 1);  
	
КонецПроцедуры

&После("ПКО_Справочник_ФизическиеЛица_Получение_ПриКонвертацииДанныхXDTO")
Процедура АБ_ПКО_Справочник_ФизическиеЛица_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	
	Если ДанныеXDTO.Свойство("AdditionalInfo") И ТипЗнч(ДанныеXDTO.AdditionalInfo)=Тип("Структура") Тогда //ED
		
		ДопДанные = ДанныеXDTO.AdditionalInfo;
		
		Если ДопДанные.Свойство("АБ_СоздатьПользователя") Тогда
			
			ПолученныеДанные.ДополнительныеСвойства.Вставить("АБ_СоздатьПользователя");
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&После("ПКО_Справочник_ФизическиеЛица_Получение_ПередЗаписьюПолученныхДанных")
Процедура АБ_ПКО_Справочник_ФизическиеЛица_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	
	Если ПолученныеДанные.ДополнительныеСвойства.Свойство("АБ_СоздатьПользователя") Тогда
		
		СсылкаФизЛицо = ?(ДанныеИБ = Неопределено,   ПолученныеДанные.ПолучитьСсылкуНового(), ДанныеИБ.Ссылка);   
	    АБ_СоздатьПользователяФизЛицу(СсылкаФизЛицо, ПолученныеДанные.Наименование);
		
	КонецЕсли;


КонецПроцедуры

Процедура АБ_СоздатьПользователяФизЛицу(СсылкаФизЛицо, ФИО)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ первые 1
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", СсылкаФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	
	НовПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовПользователь.ФизЛицо 			= СсылкаФизЛицо;
	НовПользователь.Наименование 		= ФИО;
	НовПользователь.ОбменДанными.Загрузка = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СпрСотрудники.Ссылка КАК СотрудникФизЛица
	               |ИЗ
	               |	Справочник.Сотрудники КАК СпрСотрудники ГДЕ СпрСотрудники.Владелец = &ФизЛицо И НЕ СпрСотрудники.ПометкаУдаления" ;
	
 	Запрос.УстановитьПараметр("ФизЛицо", СсылкаФизЛицо);
	
	ВыборкаСотрудники = Запрос.Выполнить().Выбрать(); 
	
	ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    ПользовательИБ.Имя = ФИО;
    ПользовательИБ.ПолноеИмя = ФИО;
    ПользовательИБ.АутентификацияСтандартная = Истина;

	//++dar 27.10.25 (права на общий гриф)
	РГВсеСотрудники = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ", "УВМ_РабочаяГруппаВсеСотрудники"));	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДескрипторыДоступаОбъектов.Ссылка КАК Дескриптор,
	|	ДескрипторыДоступаОбъектов.КонтейнерСотрудников КАК КонтейнерСотрудников,
	|	ДескрипторыДоступаОбъектов.Изменение КАК Изменение
	|ИЗ
	|	Справочник.ДескрипторыДоступаОбъектов КАК ДескрипторыДоступаОбъектов
	|ГДЕ
	|	ДескрипторыДоступаОбъектов.КонтейнерСотрудников = &ВсеСотрудники";
	Запрос.УстановитьПараметр("ВсеСотрудники", РГВсеСотрудники);
	ТаблДескрипторов = Запрос.Выполнить().Выгрузить();
	//--dar 27.10.25 (права на общий гриф)
	
	НачатьТранзакцию();
	Попытка
		
		ПользовательИБ.Записать();
		НовПользователь.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;

		НовПользователь.Записать();
				
		//Полномочие пользователь
		НовЗапись = РегистрыСведений.ПолномочияСотрудников.СоздатьМенеджерЗаписи();
		НовЗапись.Владелец 		= НовПользователь.Ссылка;
		НовЗапись.Полномочия 	= Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию("Пользователи", Истина);
		НовЗапись.Записать();
		
		//флаг запросить пароль
		НовЗапись = РегистрыСведений.СведенияОПользователях.СоздатьМенеджерЗаписи();
		НовЗапись.Пользователь = НовПользователь.Ссылка; 
		//НовЗапись.ПотребоватьСменуПароляПриВходе = Истина;
		НовЗапись.Имя =  ФИО;
		НовЗапись.ВходВПрограммуРазрешен =  Истина;
		НовЗапись.ДатаРазрешенияВходаВПрограмму =  ТекущаяДатаСеанса();
		НовЗапись.Записать(); 	
		
		Пока ВыборкаСотрудники.Следующий() Цикл
		
			ТекЗапись = РегистрыСведений.СотрудникиПользователей.СоздатьМенеджерЗаписи();
			ТекЗапись.Пользователь = НовПользователь.Ссылка;
			ТекЗапись.Сотрудник    = ВыборкаСотрудники.СотрудникФизЛица;
			ТекЗапись.Записать();
			
			//++dar 03.10.25 (281921)
			ТекЗапись = РегистрыСведений.СотрудникиВКонтейнерах.СоздатьМенеджерЗаписи();
			ТекЗапись.Контейнер = ВыборкаСотрудники.СотрудникФизЛица;
			ТекЗапись.Сотрудник = ВыборкаСотрудники.СотрудникФизЛица;
			ТекЗапись.Записать();
			//--dar 03.10.25 (281921)
			
			//++dar 27.10.25 (права на общий гриф)
			Для Каждого СтрокаТЧ Из ТаблДескрипторов Цикл
				МенеджерЗаписи = РегистрыСведений.ПраваПоДескрипторамДоступаОбъектов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Дескриптор = СтрокаТЧ.Дескриптор;
				МенеджерЗаписи.Сотрудник = ВыборкаСотрудники.СотрудникФизЛица;
				МенеджерЗаписи.Добавление = СтрокаТЧ.Изменение;
				МенеджерЗаписи.Изменение = СтрокаТЧ.Изменение;
				МенеджерЗаписи.Удаление = СтрокаТЧ.Изменение;
				МенеджерЗаписи.Чтение = Истина;               
				МенеджерЗаписи.Записать();
			КонецЦикла;
			
			ТекЗапись = РегистрыСведений.СотрудникиВКонтейнерах.СоздатьМенеджерЗаписи();
			ТекЗапись.Контейнер = РГВсеСотрудники;
			ТекЗапись.Сотрудник = ВыборкаСотрудники.СотрудникФизЛица;
			ТекЗапись.Записать();
			//--dar 27.10.25 (права на общий гриф)
			
		КонецЦикла;
			
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();  
	КонецПопытки;			
	
КонецПроцедуры   	

#КонецОбласти

#Область Справочник_КонтактныеЛица

//++dar 03.02.26 (307331)
Процедура ДобавитьПОД_Справочник_КонтактныеЛицаКонтрагентов_Получение(ПравилаОбработкиДанных)
	
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_КонтактныеЛица_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.КонтактныеЛица"; //@NON-NLS-1
	
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_КонтактныеЛицаКонтрагентов_Получение");
	
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_КонтактныеЛицаКонтрагентов_Получение(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_КонтактныеЛицаКонтрагентов_Получение";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.КонтактныеЛица;                       
	ПравилоКонвертации.ОбъектФормата                = "Справочник.КонтактныеЛица";
	ПравилоКонвертации.ВариантИдентификации         = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Справочник_КонтактныеЛицаКонтрагентов_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_КонтактныеЛицаКонтрагентов_Получение_ПередЗаписьюПолученныхДанных";
	
	// +++ Миляев (293293) 2026.02.18
	ПространствоРасширения = ПространствоРасширенияДО();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоРасширения);	
	// --- Миляев (293293) 2026.02.18
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "ФИО");
	ДобавитьПКС(СвойстваШапки, "Должность", "ОписаниеДолжности", 1);
	ДобавитьПКС(СвойстваШапки, "Владелец", "Субъект", , "Справочник_Контрагенты_Получение");
	
	// +++ Миляев (293293) 2026.02.18
	ДобавитьПКС(СвойстваШапки, "УВМ_ОснованиеПодписи","УВМ_ОснованиеПодписи", 0,, ПространствоРасширения);
	// --- Миляев (293293) 2026.02.18
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "КонтактнаяИнформация",    "");
	ДобавитьПКС(СвойстваТЧ, "Вид",           "", 1);
	ДобавитьПКС(СвойстваТЧ, "ЗначенияПолей", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Представление", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Тип",           "", 1);
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
	
КонецПроцедуры

Процедура ПКО_Справочник_КонтактныеЛицаКонтрагентов_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	
	Если ДанныеXDTO.Свойство("ОписаниеДолжности") Тогда
		Если ЗначениеЗаполнено(ДанныеXDTO.ОписаниеДолжности) Тогда
			НайденнаяДолжность = Справочники.ДолжностиКонтактныхЛиц.НайтиПоНаименованию(ДанныеXDTO.ОписаниеДолжности, Истина);
			Если НЕ ЗначениеЗаполнено(НайденнаяДолжность) Тогда
				НоваяДКЛ = Справочники.ДолжностиКонтактныхЛиц.СоздатьЭлемент();
				НоваяДКЛ.Наименование = ДанныеXDTO.ОписаниеДолжности;
				НоваяДКЛ.Записать(); 
				НайденнаяДолжность = НоваяДКЛ.Ссылка;
			КонецЕсли;	
			ПолученныеДанные.Должность = НайденнаяДолжность;
		КонецЕсли;
	КонецЕсли;

	ЗагрузитьКонтактнуюИнформацию(
		ДанныеXDTO,
		ПолученныеДанные,
		Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛица);
		
КонецПроцедуры

Процедура ПКО_Справочник_КонтактныеЛицаКонтрагентов_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	
	Если ДанныеИБ <> Неопределено И ЗначениеЗаполнено(ПолученныеДанные.Должность) Тогда
		ДанныеИБ.Должность = ПолученныеДанные.Должность;
	КонецЕсли;
	
КонецПроцедуры
//--dar 03.02.26 (307331)

#КонецОбласти

#Область Справочник_Файлы
//++dar 12.03.26 (309302)

Процедура ДобавитьПОД_Справочник_Файлы_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_Файлы_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Файлы;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Файлы_Отправка");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Файлы_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_Файлы_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.Файлы;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Файлы_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ОбъектФормата     = "Справочник.Файлы"; //@NON-NLS-1
	
	ПространствоРасширения = ПространствоРасширенияДО();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоРасширения);	
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Имя");
	ДобавитьПКС(СвойстваШапки, "ТекущаяВерсияРасширение",   "Расширение");
	ДобавитьПКС(СвойстваШапки, "ТекущаяВерсияПутьКФайлу",   "ПутьКФайлу",,, ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ТекущаяВерсияПутьКФайлу",   "ХранимыйФайл",,, ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "",			   				"ПутьКТому", 1,, ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "", 			   				"УВМ_УИДВладельца", 1, , ПространствоРасширения);
	
КонецПроцедуры

Процедура ПКО_Справочник_Файлы_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	
	ОтменитьВыгрузкуФайла = Ложь;
	
	ВыгружаемыеДанныеДоп = Новый Структура;
	ВыгружаемыеДанныеДоп.Вставить("БазаИсточник", "Документооборот");
	
	Если ЗначениеЗаполнено(ДанныеИБ.ТекущаяВерсияТом) Тогда
		ПутьКТому = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.ТекущаяВерсияТом, "ПолныйПутьWindows");
		ДанныеXDTO.Вставить("ПутьКТому", ПутьКТому);
	Иначе
		ОтменитьВыгрузкуФайла = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеИБ.ВладелецФайла) Тогда
		ИДДоговораЕРП = "";
		ТипВнешнегоОбъекта = "";
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СсылкаНаОбъектДО", ДанныеИБ.ВладелецФайла);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СвязиОбъектовИнтегрированныхСистем.УзелИнтегрированнойСистемы КАК УзелИнтегрированнойСистемы,
		|	СвязиОбъектовИнтегрированныхСистем.СсылкаНаОбъектДО КАК СсылкаНаОбъектДО,
		|	СвязиОбъектовИнтегрированныхСистем.ТипВнешнегоОбъекта КАК ТипВнешнегоОбъекта,
		|	СвязиОбъектовИнтегрированныхСистем.ИДВнешнегоОбъекта КАК ИДВнешнегоОбъекта
		|ИЗ
		|	РегистрСведений.СвязиОбъектовИнтегрированныхСистем КАК СвязиОбъектовИнтегрированныхСистем
		|ГДЕ
		|	СвязиОбъектовИнтегрированныхСистем.СсылкаНаОбъектДО = &СсылкаНаОбъектДО
		|	И (СвязиОбъектовИнтегрированныхСистем.ТипВнешнегоОбъекта = ""Справочник.ДоговорыКонтрагентов""
		|			ИЛИ СвязиОбъектовИнтегрированныхСистем.ТипВнешнегоОбъекта = ""Справочник.ДоговорыАренды"")";		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ИДДоговораЕРП = Выборка.ИДВнешнегоОбъекта;
			ТипВнешнегоОбъекта = Выборка.ТипВнешнегоОбъекта;
		КонецЕсли;
		
		ДанныеXDTO.Вставить("УВМ_УИДВладельца", ИДДоговораЕРП); 	
		ВыгружаемыеДанныеДоп.Вставить("ТипВнешнегоОбъекта", ТипВнешнегоОбъекта);
		
		Если НЕ ЗначениеЗаполнено(ИДДоговораЕРП) Тогда
			ОтменитьВыгрузкуФайла = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТипВнешнегоОбъекта) Тогда
			ОтменитьВыгрузкуФайла = Истина;
		КонецЕсли;
		
	Иначе
		ОтменитьВыгрузкуФайла = Истина;
	КонецЕсли;

	
	ДанныеОФайлах = Делопроизводство.ПолучитьДанныеФайловДляСписка(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеИБ.Ссылка));
	Если ДанныеОФайлах.Количество() > 0 Тогда
		ДанныеОФайле = ДанныеОФайлах[0];
		
		ВидДокументаЕРП = ВидДокументаВЕРП(ДанныеОФайле.РольФайла);
		Если НЕ ЗначениеЗаполнено(ВидДокументаЕРП) Тогда
			ОтменитьВыгрузкуФайла = Истина;
		КонецЕсли;
		
		ВыгружаемыеДанныеДоп.Вставить("ВидДокумента", ВидДокументаЕРП);
		ВыгружаемыеДанныеДоп.Вставить("ЯвляетсяОригиналом", ДанныеОФайле.Оригинал);
		ВыгружаемыеДанныеДоп.Вставить("ЯвляетсяКопией", ДанныеОФайле.УВМ_ЯвляетсяКопией);
		ВыгружаемыеДанныеДоп.Вставить("ПометкаУдаления", ДанныеОФайле.ПометкаУдаления);
	Иначе
		ОтменитьВыгрузкуФайла = Истина;
	КонецЕсли;
	
	AdditionalInfoВставитьДопДанные(ДанныеXDTO, ВыгружаемыеДанныеДоп);
	
	Если ОтменитьВыгрузкуФайла Тогда
		ДанныеXDTO = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Функция ВидДокументаВЕРП(РольФайла)
	
	Результат = "";
	
	ВидДоговорПоставки = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ, КлючДополнительный", "УВМ_РольФайлаДляОбмена", "ДоговорПоставки"));
	ВидСоглашениеОбЭДО = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ, КлючДополнительный", "УВМ_РольФайлаДляОбмена", "СоглашениеОбЭДО"));
	ВидОригиналДоговора = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ, КлючДополнительный", "УВМ_РольФайлаДляОбмена", "ОригиналДоговора"));
	
	Если РольФайла = ВидДоговорПоставки Тогда
		Результат = "Договор поставки";
	ИначеЕсли РольФайла = ВидСоглашениеОбЭДО Тогда
		Результат = "Соглашение об ЭДО";
	ИначеЕсли РольФайла = ВидОригиналДоговора Тогда
		Результат = "Оригинал договора, соглашение об ЭДО";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//--dar 12.03.26 (309302)
#КонецОбласти

#Область Справочник_Контрагенты
//++dar 04.05.26 (326149)

&ИзменениеИКонтроль("ДобавитьПКО_Справочник_Контрагенты_Получение")
Процедура АБ_ДобавитьПКО_Справочник_Контрагенты_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_Контрагенты_Получение";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.Контрагенты;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.Контрагенты";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Справочник_Контрагенты_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_Контрагенты_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации         = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "ИНН",                    "ИНН");
	ДобавитьПКС(СвойстваШапки, "КодПоОКПО",              "ОКПО");
	ДобавитьПКС(СвойстваШапки, "Комментарий",            "Комментарий");
	ДобавитьПКС(СвойстваШапки, "КПП",                    "КПП");
	ДобавитьПКС(СвойстваШапки, "Наименование",           "Наименование");
	ДобавитьПКС(СвойстваШапки, "НаименованиеПолное",     "НаименованиеПолное");
	ДобавитьПКС(СвойстваШапки, "ОсновнойБанковскийСчет", "ОсновнойБанковскийСчет", 1, "Справочник_БанковскиеСчета_Получение");
	ДобавитьПКС(СвойстваШапки, "Ответственный",          "Ответственный", , "Справочник_СотрудникиИзПользователя");
	ДобавитьПКС(СвойстваШапки, "РегистрационныйНомер",   "РегистрационныйНомер");
	ДобавитьПКС(СвойстваШапки, "Родитель",               "Группа", , "Справочник_КонтрагентыГруппа_Получение");
	ДобавитьПКС(СвойстваШапки, "ФизЛицо",                "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Получение");
	ДобавитьПКС(СвойстваШапки, "ЮрФизЛицо",              "ЮридическоеФизическоеЛицо", , "Перечисление_ЮрФизЛицо_Получение");
	#Вставка
	//++dar 04.05.26 (326149)
	ПространствоРасширения = ПространствоРасширенияДО();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоРасширения);	
	
	ДобавитьПКС(СвойстваШапки, "УВМ_Клиент"                ,"УВМ_Клиент",0,,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "УВМ_Конкурент"             ,"УВМ_Конкурент",0,,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "УВМ_Перевозчик"            ,"УВМ_Перевозчик",0,,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "УВМ_Подрядчик"             ,"УВМ_Подрядчик",0,,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "УВМ_Поставщик"             ,"УВМ_Поставщик",0,,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "УВМ_ПрочиеОтношения"       ,"УВМ_ПрочиеОтношения",0,,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "УВМ_Хранитель_Арендодатель","УВМ_Хранитель_Арендодатель",0,,ПространствоРасширения);
	//--dar 04.05.26 (326149)
	#КонецВставки

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ДополнительныеРеквизиты", "");
	ДобавитьПКС(СвойстваТЧ, "Значение", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Свойство", "", 1, "Справочник_ДополнительныеРеквизиты");

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "КонтактнаяИнформация",    "");
	ДобавитьПКС(СвойстваТЧ, "Вид",           "", 1);
	ДобавитьПКС(СвойстваТЧ, "ЗначенияПолей", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Представление", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Тип",           "", 1);

	ПравилоКонвертации.ПоляПоиска.Добавить("ИНН,КПП,ЭтоГруппа");
	ПравилоКонвертации.ПоляПоиска.Добавить("НаименованиеПолное,ЭтоГруппа");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование,ЭтоГруппа");
КонецПроцедуры

//--dar 04.05.26 (326149)
#КонецОбласти

#КонецОбласти

#Область РегистрыСведений
//--dar 13.11.25 (291567)

#КонецОбласти

#Область Ответственные_лица_организации
// +++ Миляев (293293) 2026.02.04
Процедура ДобавитьПКО_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.АБ_ОтветственныеЛицаОрганизаций;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.УВМ_ОтветственныеЛицаОрганизаций"; //@NON-NLS-1
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации         = "ПоУникальномуИдентификатору";
	
	ПространствоРасширения = ПространствоРасширенияДО();
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ПространствоРасширения);	
	
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Владелец"                  ,"Организация",0,"Справочник_Организации_Получение",ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "Наименование"              ,"Наименование",0,                                 ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ОтветственноеЛицо"         , "ОтветственноеЛицоПредставление", 0,             ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ФизическоеЛицо"            ,"", 1,                                            ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "Должность"                 ,"ДолжностьДляПечати", 0,                          ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ДатаНачала"                ,"ДатаНачала", 0,                                  ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ДатаОкончания"             ,"ДатаОкончания", 0,                               ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ПравоПодписиПоДоверенности","ПравоПодписиПоДоверенности", 0,                  ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ДокументПраваПодписи"      ,"ДокументПраваПодписи"      , 0,                  ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "НомерДокументаПраваПодписи","НомерДокументаПраваПодписи", 0,                  ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ДатаДокументаПраваПодписи" ,"ДатаДокументаПраваПодписи" , 0,                  ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ОснованиеПраваПодписи"     ,"ОснованиеПраваПодписи"     , 0,                  ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ДолжностьСсылка"           ,"", 1,                                            ,ПространствоРасширения);
	ДобавитьПКС(СвойстваШапки, "ЕстьПравоПодписиИсходящихДоговоров","ЕстьПравоПодписиИсходящихДоговоров", 0,  ,ПространствоРасширения);

КонецПроцедуры

Процедура ДобавитьПОД_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.УВМ_ОтветственныеЛицаОрганизаций"; //@NON-NLS-1
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение");
КонецПроцедуры

Процедура ПКО_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	
	Если ТипЗнч(ДанныеXDTO) = Тип("Структура") И ДанныеXDTO.Свойство("ФизическоеЛицо") 
		и ТипЗнч(ДанныеXDTO.ФизическоеЛицо)=Тип("Структура") тогда
		
		ПараметрФИО = "";
		ДанныеXDTO.ФизическоеЛицо.Свойство("ФИО",ПараметрФИО);
		ПараметрИНН = "";
		ДанныеXDTO.ФизическоеЛицо.Свойство("ИНН",ПараметрИНН);
		ПараметрДатаРождения = '00010101';
		ДанныеXDTO.ФизическоеЛицо.Свойство("ДатаРождения",ПараметрДатаРождения);
		
		ЗапросФЛ = Новый Запрос;
		ЗапросФЛ.УстановитьПараметр("ФИО",ПараметрФИО);
		ЗапросФЛ.УстановитьПараметр("ИНН",ПараметрИНН);
		ЗапросФЛ.УстановитьПараметр("ДатаРождения",ПараметрДатаРождения);
		ЗапросФЛ.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛица.Ссылка КАК ФЛСсылка,
		|	ВЫБОР
		|		КОГДА ФизическиеЛица.ИНН = &ИНН
		|				И &ИНН <> """"
		|				И (ФизическиеЛица.ДатаРождения = &ДатаРождения
		|					И &ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1))
		|			ТОГДА 1
		|		КОГДА ФизическиеЛица.ИНН = &ИНН
		|				И &ИНН <> """"
		|			ТОГДА 2
		|		КОГДА ФизическиеЛица.ДатаРождения = &ДатаРождения
		|				И &ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование = &ФИО
		|	И &ФИО <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
		
		ВыборкаФЛ = ЗапросФЛ.Выполнить().Выбрать();
		Если ВыборкаФЛ.Следующий() тогда
			ПолученныеДанные.ДополнительныеСвойства.Вставить("ФизическоеЛицо",ВыборкаФЛ.ФЛСсылка);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеXDTO) = Тип("Структура") И ДанныеXDTO.Свойство("Должность") и ТипЗнч(ДанныеXDTO.Должность)=Тип("Структура") тогда
		
		ПараметрНаименование = "";
		ДанныеXDTO.Должность.Свойство("Наименование",ПараметрНаименование);
		ПараметрНаименованиеДляПечати = "";
		ДанныеXDTO.Свойство("ДолжностьДляПечати",ПараметрНаименованиеДляПечати);

		ЗапросДолжности = Новый Запрос();
		ЗапросДолжности.УстановитьПараметр("Наименование",ПараметрНаименование);
		ЗапросДолжности.УстановитьПараметр("НаименованиеДляПечати",ПараметрНаименованиеДляПечати);
		ЗапросДолжности.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Должности.Ссылка КАК ДолжностьСсылка
		|ИЗ
		|	Справочник.Должности КАК Должности
		|ГДЕ
		|	Должности.Наименование = &Наименование
		|	И &Наименование <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Должности.Ссылка
		|ИЗ
		|	Справочник.Должности КАК Должности
		|ГДЕ
		|	Должности.Наименование = &НаименованиеДляПечати
		|	И &НаименованиеДляПечати <> """" ";
		ВыборкаДолжности = ЗапросДолжности.Выполнить().Выбрать();
		Если ВыборкаДолжности.Следующий() тогда
			ПолученныеДанные.ДополнительныеСвойства.Вставить("ДолжностьСсылка",ВыборкаДолжности.ДолжностьСсылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПКО_Справочник_УВМ_ОтветственныеЛицаОрганизаций_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если не ЗначениеЗаполнено(ПолученныеДанные.ФизическоеЛицо) тогда
		ПолученныеДанные = Неопределено;
	КонецЕсли;
КонецПроцедуры
// --- Миляев (293293) 2026.02.04
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++dar 30.01.26 (307770)
Функция ПространствоРасширенияДО()
	
	Возврат "http://v8.1c.ru/edi/edi_stnd/ED_Ext_UVM/1.17";
	
КонецФункции
//--dar 30.01.26 (307770)

&ИзменениеИКонтроль("ВидКонтактнойИнформацииИзСтроки")
Функция АБ_ВидКонтактнойИнформацииИзСтроки(ВидКИСтрокой, НаименованиеКИ, ГруппаВидовКИ)
	ТекВидКИ = Неопределено;
	ПрефиксПользовательскойКИ = "ПользовательскаяКИ";

	Если СтрНачинаетсяС(ВидКИСтрокой, ПрефиксПользовательскойКИ) Тогда

		ИмяТипаКИ = СтрЗаменить(ВидКИСтрокой, ПрефиксПользовательскойКИ, "");

		ТекВидКИ  = ВидПользовательскойКонтактнойИнформации(
		НаименованиеКИ,
		ГруппаВидовКИ,
		Перечисления.ТипыКонтактнойИнформации[ИмяТипаКИ]);

	Иначе

		СправочникВидыКИ = Справочники.ВидыКонтактнойИнформации;

		Если ГруппаВидовКИ = СправочникВидыКИ.СправочникКонтрагенты Тогда
			Если ВидКИСтрокой = "АдресЭлектроннойПочты" Тогда
				ТекВидКИ = СправочникВидыКИ.EmailКонтрагента;

			ИначеЕсли ВидКИСтрокой = "ПочтовыйАдрес" Тогда
				ТекВидКИ = СправочникВидыКИ.ПочтовыйАдресКонтрагента;

			ИначеЕсли ВидКИСтрокой = "ВебСтраница" Тогда
				ТекВидКИ = СправочникВидыКИ.СайтКонтрагента;

			ИначеЕсли ВидКИСтрокой = "Телефон" Тогда
				ТекВидКИ = СправочникВидыКИ.ТелефонКонтрагента;

			ИначеЕсли ВидКИСтрокой = "Факс" Тогда
				ТекВидКИ = СправочникВидыКИ.ФаксКонтрагента;

			ИначеЕсли ВидКИСтрокой = "ФактическийАдрес" Тогда
				ТекВидКИ = СправочникВидыКИ.ФактическийАдресКонтрагента;

			ИначеЕсли ВидКИСтрокой = "ЮридическийАдрес" Тогда
				ТекВидКИ = СправочникВидыКИ.ЮридическийАдресКонтрагента;

			КонецЕсли;

		ИначеЕсли ГруппаВидовКИ = СправочникВидыКИ.СправочникОрганизации Тогда
			Если ВидКИСтрокой = "АдресЭлектроннойПочты" Тогда
				ТекВидКИ = СправочникВидыКИ.EmailОрганизации;

			ИначеЕсли ВидКИСтрокой = "ПользовательскаяКИДругое" Тогда
				ТекВидКИ = СправочникВидыКИ.ДругаяИнформацияОрганизации;

			ИначеЕсли ВидКИСтрокой = "ПочтовыйАдрес" Тогда
				ТекВидКИ = СправочникВидыКИ.ПочтовыйАдресОрганизации;

			ИначеЕсли ВидКИСтрокой = "Телефон" Тогда
				ТекВидКИ = СправочникВидыКИ.ТелефонОрганизации;

			ИначеЕсли ВидКИСтрокой = "Факс" Тогда
				ТекВидКИ = СправочникВидыКИ.ФаксОрганизации;

			ИначеЕсли ВидКИСтрокой = "ФактическийАдрес" Тогда
				ТекВидКИ = СправочникВидыКИ.ФактАдресОрганизации;

			ИначеЕсли ВидКИСтрокой = "ЮридическийАдрес" Тогда
				ТекВидКИ = СправочникВидыКИ.ЮрАдресОрганизации;

			КонецЕсли;

		ИначеЕсли ГруппаВидовКИ = СправочникВидыКИ.СправочникФизическиеЛица Тогда
			Если ВидКИСтрокой = "АдресЭлектроннойПочты" Тогда
				ТекВидКИ = СправочникВидыКИ.EmailФизическогоЛица;

			ИначеЕсли ВидКИСтрокой = "ПочтовыйАдрес" Тогда
				ТекВидКИ = СправочникВидыКИ.ДомашнийАдресФизическогоЛица;

			ИначеЕсли ВидКИСтрокой = "ТелефонДомашний" Тогда
				ТекВидКИ = СправочникВидыКИ.ДомашнийТелефонФизическогоЛица;

			ИначеЕсли ВидКИСтрокой = "Телефон" Тогда
				ТекВидКИ = СправочникВидыКИ.МобильныйТелефонФизическогоЛица;

			КонецЕсли;

		#Вставка
		//++dar 05.02.26 (307331)
		ИначеЕсли ГруппаВидовКИ = СправочникВидыКИ.СправочникКонтактныеЛица Тогда
			Если ВидКИСтрокой = "АдресЭлектроннойПочты" Тогда
				ТекВидКИ = СправочникВидыКИ.EmailКонтактногоЛица;

			ИначеЕсли ВидКИСтрокой = "Телефон" Тогда
				ТекВидКИ = СправочникВидыКИ.ТелефонКонтактногоЛица;

			КонецЕсли;
		
		//--dar 05.02.26 (307331)
		#КонецВставки
		КонецЕсли;

	КонецЕсли;

	Возврат ТекВидКИ;
КонецФункции

//++dar 12.03.26 (309302)
Процедура AdditionalInfoВставитьДопДанные(ДанныеXDTO, ВыгружаемыеДанные);
	
	Если ДанныеXDTO.Свойство("AdditionalInfo") И ТипЗнч(ДанныеXDTO.AdditionalInfo) = Тип("Структура") Тогда
	    ДопДанные = ДанныеXDTO.AdditionalInfo;
	Иначе
	    ДопДанные = Новый Структура;
	КонецЕсли;                                       
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДопДанные, ВыгружаемыеДанные, Истина);
	ДанныеXDTO.Вставить("AdditionalInfo", ДопДанные);
	
КонецПроцедуры
//--dar 12.03.26 (309302)

//++GIV 09042026 (317078)
Функция AdditionalInfoПолучить(ДанныеXDTO, ИмяРеквизита, ЗначениеПоУмолчанию = Неопределено)
	Если ДанныеXDTO.Свойство("AdditionalInfo")
            И ТипЗнч(ДанныеXDTO.AdditionalInfo)=Тип("Структура") Тогда
        
        ДопДанные = ДанныеXDTO.AdditionalInfo;
        
        Если ДопДанные.Свойство(ИмяРеквизита) Тогда
			Возврат ДопДанные[ИмяРеквизита];
		Иначе
			Возврат ЗначениеПоУмолчанию;			
        КонецЕсли;
    КонецЕсли;
КонецФункции
//--GIV 09042026 (317078)
#КонецОбласти


