
#Область ПрограммныйИнтерфейс

// См. ОбзорСпискаДокументов.ПолучитьДанныеМиникарточки
// 
// Параметры:
//  ТекущийДокумент - СправочникСсылка.ДокументыПредприятия - Текущий документ
//  ДанныеМиникарточки - Структура - Данные миникарточки, которые нужно дополнить
//  ДопПараметры - Структура, Неопределено
Процедура ДополнитьДанныеМиникарточки(ТекущийДокумент, ДанныеМиникарточки, ДопПараметры = Неопределено) Экспорт
	
	// Локализация
	ДанныеМиникарточки.Вставить("СостояниеЭДОСсылка", Неопределено);
	ДанныеМиникарточки.Вставить("ДокументЭДО", Неопределено);
	
	Если ЗначениеЗаполнено(ТекущийДокумент) Тогда
		
		МассивЭД = ОбменЭДОДокументооборот.ЭлектронныеДокументыОбъектаУчета(ТекущийДокумент);
		Если МассивЭД.Количество() <> 0 Тогда
			ДанныеМиникарточки.ДокументЭДО = МассивЭД[0];
		КонецЕсли;
	
	КонецЕсли;
	// Конец Локализация
	
КонецПроцедуры

#КонецОбласти
