
&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++dar 02.04.26 (321152)
	СвойстваОтправитьДоговор = Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_ОтправитьДоговорКонтрагенту", Элементы.ГруппаУчастникиДополнительноПраво, Истина, , , СвойстваОтправитьДоговор);
	//--dar 02.04.26 (321152)
	//++GIV 07042026 (320030)
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_СформироватьДоговорВЕРП", Элементы.ГруппаУчастникиДополнительноЛево, Истина, , , СвойстваОтправитьДоговор);
	//--GIV 07042026 (320030)
КонецПроцедуры
