
&ИзменениеИКонтроль("ПолучитьДанныеМиникарточки")
Функция АБ_ПолучитьДанныеМиникарточки_ИК(ТекущийДокумент, ДопПараметры)

	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ОбзорОбъектовКлиентСервер.НовыйДопПараметрыМиникарточки();
	КонецЕсли;

	ДанныеМиникарточки = Новый Структура();
	ДанныеМиникарточки.Вставить("Обзор", "");
	ДанныеМиникарточки.Вставить("Файлы", Новый Массив);
	ДанныеМиникарточки.Вставить("МассивКомбинацийРолей", Новый Массив);
	ДанныеМиникарточки.Вставить("Задачи", Новый Массив);
	ДанныеМиникарточки.Вставить("ДоступныеПоля", "");
	ДанныеМиникарточки.Вставить("НедоступныеПоля", "");
	ДанныеМиникарточки.Вставить("НеизменяемыеПоля", "");
	ДанныеМиникарточки.Вставить("ЗапретитьРедактироватьФайлы", Ложь);
	ДанныеМиникарточки.Вставить("ЗапретитьУдалятьФайлы", Ложь);
	ДанныеМиникарточки.Вставить("ПолныеПрава", Ложь);
	ДанныеМиникарточки.Вставить("ИспользоватьСостоянияДокументов", Ложь);
	ДанныеМиникарточки.Вставить("ОграничиватьДоступностьПолейПоСостоянию", Ложь);
	ДанныеМиникарточки.Вставить("ВестиУчетСканКопийОригиналовДокументов", Ложь);
	ДанныеМиникарточки.Вставить("ИменаПолейИКомандДляНастройкиДоступности", Новый Массив);
	ДанныеМиникарточки.Вставить("СостояниеТекст", "");
	ДанныеМиникарточки.Вставить("СостояниеОбработки", Неопределено);
	ДанныеМиникарточки.Вставить("ЭтоОбъектИзДругойСистемы", Ложь);
	ДанныеМиникарточки.Вставить("ТекущийЧислоРолейФайлов", 0);
	ДанныеМиникарточки.Вставить("ВидДокументаКэш", Неопределено);  
	ДанныеМиникарточки.Вставить("ДокументПодписан", Ложь);  

	Если ЗначениеЗаполнено(ТекущийДокумент) Тогда 

		РеквизитыДокумента = ОбщегоНазначенияДокументооборот.ЗначенияРеквизитовОбъектаВПривилегированномРежиме(
		ТекущийДокумент, "Шаблон, ИсточникДанных");  

		ДанныеМиникарточки.ДокументПодписан = ДействияСервер.ДокументПодписан(ТекущийДокумент);		

		Шаблон = РеквизитыДокумента.Шаблон;
		ИсточникДанных = РеквизитыДокумента.ИсточникДанных;

		ЭтоОбъектИзДругойСистемы = МиграцияДанныхИзВнешнихСистемСервер.ЭтоОбъектИзДругойСистемы(ИсточникДанных); 
		ДанныеМиникарточки.ЭтоОбъектИзДругойСистемы = ЭтоОбъектИзДругойСистемы;

		ДанныеМиникарточки.ПолныеПрава = Пользователи.ЭтоПолноправныйПользователь();
		ДанныеМиникарточки.ИспользоватьСостоянияДокументов = Константы.ИспользоватьСостоянияДокументов.Получить();
		ДанныеМиникарточки.ОграничиватьДоступностьПолейПоСостоянию = Константы.ОграничиватьДоступностьПолейПоСостоянию.Получить();
		ДанныеМиникарточки.ВестиУчетСканКопийОригиналовДокументов = Константы.ВестиУчетСканКопийОригиналовДокументов.Получить();
		ДанныеМиникарточки.СостояниеТекст = Делопроизводство.ПолучитьСтроковоеПредставлениеСостояний(ТекущийДокумент);

		ИменаПолейИКомандДляНастройкиДоступности = Делопроизводство.ПолучитьИменаПолейИКомандДляНастройкиДоступности();
		Для Каждого Строка Из ИменаПолейИКомандДляНастройкиДоступности Цикл
			СтрокаТаблицы = ОбщегоНазначенияДокументооборот.НовыйСтруктураИзКолонокОбъекта(
			ИменаПолейИКомандДляНастройкиДоступности);
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Строка);
			ДанныеМиникарточки.ИменаПолейИКомандДляНастройкиДоступности.Добавить(СтрокаТаблицы);
		КонецЦикла;

		РезультатыЗапросов = РезультатыЗапросовДляМиникарточки(ТекущийДокумент, ДопПараметры.ПоказыватьУдаленныеФайлы);
		ДанныеМиникарточки.Файлы = ПолучитьДанныеФайлов(РезультатыЗапросов[0], 
		ТекущийДокумент, ДанныеМиникарточки.МассивКомбинацийРолей);
		ДанныеМиникарточки.Задачи = ПолучитьДанныеЗадач(РезультатыЗапросов[1]);

		ДанныеОбзора = ДанныеОбзора(РезультатыЗапросов[2]);
		ДанныеМиникарточки.Обзор = ДанныеОбзора.HtmlТекст;

		РолиФайлов = Делопроизводство.РолиФайловДляВидаДокументов(ДанныеОбзора.ВидДокумента);
		ДанныеМиникарточки.ТекущийЧислоРолейФайлов = РолиФайлов.Количество();

		МассивДоступныеПоля = Новый Массив;
		МассивНедоступныеПоля = Новый Массив;

		Делопроизводство.ПолучитьДоступныеИНедоступныеПоСостояниюПоля(ТекущийДокумент.ПолучитьОбъект(), 
		МассивДоступныеПоля, МассивНедоступныеПоля);

		ДанныеМиникарточки.ДоступныеПоля = МассивДоступныеПоля;
		ДанныеМиникарточки.НедоступныеПоля = МассивНедоступныеПоля;

		СозданПоШаблону = ЗначениеЗаполнено(Шаблон) И ТипЗнч(Шаблон) = Тип("СправочникСсылка.ШаблоныДокументов");

		ИспользоватьЗапретРедактированияИзШаблона = Ложь;
		Если СозданПоШаблону И Не ДанныеМиникарточки.ПолныеПрава Тогда
			РеквизитыШаблона = ОбщегоНазначенияДокументооборот.ЗначенияРеквизитовОбъектаВПривилегированномРежиме(
			Шаблон, "ЗапретитьРедактироватьФайлы, ЗапретитьУдалятьФайлы");
			ИспользоватьЗапретРедактированияИзШаблона = Истина;
		КонецЕсли;

		ДанныеМиникарточки.ЗапретитьРедактироватьФайлы = ?(ИспользоватьЗапретРедактированияИзШаблона,
		РеквизитыШаблона.ЗапретитьРедактироватьФайлы, Ложь) Или ЭтоОбъектИзДругойСистемы;
		ДанныеМиникарточки.ЗапретитьУдалятьФайлы = ?(ИспользоватьЗапретРедактированияИзШаблона,
		РеквизитыШаблона.ЗапретитьУдалятьФайлы, Ложь) Или ЭтоОбъектИзДругойСистемы;

		СостояниеОбработки = Неопределено;
		ТекущаяОбработкаОбъекта = Справочники.ОбработкиОбъектов.ОбработкаОбъекта(ТекущийДокумент);
		Если ЗначениеЗаполнено(ТекущаяОбработкаОбъекта) Тогда 
			СостояниеОбработки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяОбработкаОбъекта, "Состояние");
		КонецЕсли;
		ДанныеМиникарточки.СостояниеОбработки = СостояниеОбработки;

		Если ДанныеОбзора.ВидДокумента <> ДопПараметры.ПредыдущийВидДокумента Тогда
			ВидДокументаКэш = Делопроизводство.КэшВидаДокумента(ДанныеОбзора.ВидДокумента);
			ДанныеМиникарточки.Вставить("ВидДокументаКэш", ВидДокументаКэш);
		КонецЕсли;

	КонецЕсли;

	ОбзорСпискаДокументовЛокализация.ДополнитьДанныеМиникарточки(ТекущийДокумент, ДанныеМиникарточки, ДопПараметры);
	#Вставка
	// +++ Миляев (295800) 2026-01-23
	СтрокаВставкаHTML = СтрШаблон("%1%2",АБ_ВызовСервера.ПолучитьТекстHTMLПоВнешнимНавигационнымСсылкам(ТекущийДокумент),"</body>");
	ДанныеМиникарточки.Обзор = СтрЗаменить(ДанныеМиникарточки.Обзор,"</body>",СтрокаВставкаHTML);
	// --- Миляев (295800) 2026-01-23
	#КонецВставки
	Возврат ДанныеМиникарточки; //@skip-check constructor-function-return-section

КонецФункции

&ИзменениеИКонтроль("ДанныеФайловДляОбновленияФайлов")
Функция АБ_ДанныеФайловДляОбновленияФайлов(РезультатЗапроса, ТекущийДокумент, МассивКомбинацийРолей, ПоказыватьУдаленныеФайлы)

	Файлы = Новый Массив;

	МассивФайлов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");

	ТаблицаФайлы = Делопроизводство.ПолучитьДанныеФайловДляСписка(МассивФайлов,
	ТекущийДокумент, ПоказыватьУдаленныеФайлы, Истина, МассивКомбинацийРолей);

	ИспользоватьРолиФайлов = ПолучитьФункциональнуюОпцию("ИспользоватьРолиФайлов");
	Если Не ИспользоватьРолиФайлов Тогда
		МассивКомбинацийРолей.Очистить();
	КонецЕсли;	

	Для Каждого Строка Из ТаблицаФайлы Цикл
		СтрокаФайлы = Новый Структура(
		"ПодписанЭП,
		|Зашифрован,
		|ИндексКартинки,
		|Наименование,
		|Описание,
		|ДатаСоздания,
		|Автор,
		|Редактирует,
		|ТекущаяВерсияРазмер,
		|ТекущаяВерсияАвтор,
		|ТекущаяВерсияДатаСоздания,
		|ХранитьВерсии,
		|СозданИзШаблона,
		|Условие,
		|РедактируетТекущийПользователь,
		|Ссылка,
		|Расширение,
		|ПометкаУдаления,
		|Оригинал,
		#Вставка
		//++dar 11.03.26 (309302)
		|УВМ_ЯвляетсяКопией,
		//--dar 11.03.26 (309302)
		//++dar 16.04.26 (323545)
		|УВМ_ЕстьКопия,
		|УВМ_ЕстьОригинал,
		//--dar 16.04.26 (323545)
		#КонецВставки
		|СтатусПроверкиЭП,
		|СозданПоШаблонуДокумента,
		|ПолноеИмяФайлаВРабочемКаталоге,
		|ДатаМодификацииУниверсальнаяВБазе,
		|РольФайла,
		|ЭтоРольФайла,
		|РольОбязательная,
		|ФайлВизуализации,
		|ФайлВизуализацииЗанятМной,
		|ЭтоДокумент,
		|ПредпросмотрЕстьВБазе,
		|ТаймлистЗадание,
		|ТаймлистСтатус,
		|ТаймлистСледующиеШаги,
		|СтатусРаспознаванияТекста");

		ЗаполнитьЗначенияСвойств(СтрокаФайлы, Строка);
		Файлы.Добавить(СтрокаФайлы);
	КонецЦикла;

	Возврат Файлы;

КонецФункции

&ИзменениеИКонтроль("ПолучитьДанныеФайлов")
Функция АБ_ПолучитьДанныеФайлов(РезультатЗапроса, ТекущийДокумент, МассивКомбинацийРолей)

	Файлы = Новый Массив;

	МассивФайлов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");

	ТаблицаФайлы = Делопроизводство.ПолучитьДанныеФайловДляСписка(МассивФайлов,
	ТекущийДокумент,,,МассивКомбинацийРолей);

	ИспользоватьРолиФайлов = ПолучитьФункциональнуюОпцию("ИспользоватьРолиФайлов");
	Если Не ИспользоватьРолиФайлов Тогда
		МассивКомбинацийРолей.Очистить();
	КонецЕсли;	

	Для Каждого Строка Из ТаблицаФайлы Цикл
		СтрокаФайлы = Новый Структура(
		"Наименование, 
		|ИндексКартинки, 
		|Описание, 
		|Оригинал, 
		#Вставка
		//++dar 11.03.26 (309302)
		|УВМ_ЯвляетсяКопией, 
		//--dar 11.03.26 (309302)
		//++dar 16.04.26 (323545)
		|УВМ_ЕстьКопия,
		|УВМ_ЕстьОригинал,
		//--dar 16.04.26 (323545)
		#КонецВставки
		|Ссылка,
		|СозданИзШаблона,
		|Редактирует,
		|Автор,
		|РедактируетТекущийПользователь,
		|Расширение,
		|ПометкаУдаления,
		|ПодписанЭП,
		|Зашифрован,
		|СозданПоШаблонуДокумента,
		|ХранитьВерсии,
		|РольФайла,
		|РолиФайлов");

		ЗаполнитьЗначенияСвойств(СтрокаФайлы, Строка);
		Файлы.Добавить(СтрокаФайлы);
	КонецЦикла;	

	Возврат Файлы;

КонецФункции
