
#Область ПрограммныйИнтерфейс

// Сбросить признак верификации.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
//  УстановленноеЗначение - ЛюбаяСсылка
//  Выполнено - Булево
Процедура СброситьПризнакВерификации(ДокументСсылка, Знач ИмяРеквизита, Знач УстановленноеЗначение, 
		Знач Выполнено) Экспорт
		
	РаспознаваниеДокументовСлужебный.СброситьПризнакВерификацииПриНеобходимости(ДокументСсылка, ИмяРеквизита, 
		УстановленноеЗначение, , , Выполнено);
	
КонецПроцедуры


// Сбросить признак верификации ТЧ.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ИмяРеквизита - Строка
//  УстановленноеЗначение - ЛюбаяСсылка
//  ТабличнаяЧасть -Строка
//  НомерСтроки - число
Процедура СброситьПризнакВерификацииТЧ(ДокументСсылка, Знач ИмяРеквизита, Знач УстановленноеЗначение, 
		Знач ТабличнаяЧасть, Знач НомерСтроки) Экспорт
	
	РаспознаваниеДокументовСлужебный.СброситьПризнакВерификацииПриНеобходимости(ДокументСсылка, ИмяРеквизита, УстановленноеЗначение, 
		ТабличнаяЧасть, НомерСтроки);
		
КонецПроцедуры


// Отправить файл документа на распознавание.
// 
// Параметры:
//  Файл - СправочникСсылка.Файлы
Процедура ОтправитьФайлДокументаНаРаспознавание(Файл) Экспорт
	
	РаспознаваниеДокументов.ОтправитьФайлДокументаНаРаспознавание(Файл);
	
КонецПроцедуры


// Прервать распознавание документа.
// 
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//  ОписаниеОшибки - Строка
Процедура ПрерватьРаспознаваниеДокумента(ДокументСсылка, ОписаниеОшибки = "") Экспорт
	
	РаспознаваниеДокументов.ПрерватьРаспознаваниеДокумента(ДокументСсылка, ОписаниеОшибки);
	
КонецПроцедуры

#КонецОбласти



