
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//++dar 01.06.26 (330575)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Контрагент") Тогда
			Контрагент = ДанныеЗаполнения.Контрагент;
		КонецЕсли;
	КонецЕсли;
	//--dar 01.06.26 (330575)
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//++dar 01.06.26 (330575)
	Индекс = ПроверяемыеРеквизиты.Найти("Наименование");
	Если Индекс <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
	//--dar 01.06.26 (330575)
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	//++dar 01.06.26 (330575)
	АдресПредставление = "";
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес
			И ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
			АдресПредставление = СтрокаКИ.Представление;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(АдресПредставление) Тогда
		НаименованиеПоАдресу = СокрЛП(СтрЗаменить(СтрЗаменить(АдресПредставление, Символы.ПС, " "), Символы.ВК, " "));
		Если СтрДлина(НаименованиеПоАдресу) > 150 Тогда
			НаименованиеПоАдресу = Лев(НаименованиеПоАдресу, 150);
		КонецЕсли;
		Наименование = НаименованиеПоАдресу;
	КонецЕсли;
	//--dar 01.06.26 (330575)
КонецПроцедуры

#КонецОбласти