
&ИзменениеИКонтроль("СоздатьПроцессСогласованияПоДействию")
Функция АБ_СоздатьПроцессСогласованияПоДействию(Действие, ПроцессОбработки)

	ПроцессОбъект = БизнесПроцессы.Согласование.СоздатьБизнесПроцесс();
	СтруктураДляЗаполнения = ПроцессОбъект.СтруктураДанныхДляЗаполнения();

	ВедущаяЗадача = Неопределено;
	Если ПроцессОбработки <> Неопределено Тогда
		ШаблонНаименования = НСтр("ru = 'Обработка действия ""%1""'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		НаименованиеЗадачи = СтрШаблон(ШаблонНаименования, Действие.Ссылка);
		#Удаление
		ВедущаяЗадача = БизнесПроцессы.КомплексныйПроцесс.СоздатьЗадачуОбработкиЭлементаСхемы(
		НаименованиеЗадачи, ПроцессОбработки);
		#КонецУдаления
		#Вставка
		//++dar 25.02.26 (309302)
		Если ТипЗнч(Действие) = Тип("СправочникОбъект.ДействияСогласования") Тогда
			УВМ_ФормаДокумента = Неопределено;
			УВМ_ОтправитьДоговорКонтрагенту = Ложь;
			УВМ_СформироватьДоговорВЕРП = Ложь;
			
			Если ТипЗнч(Действие.Предмет) = Тип("СправочникСсылка.ДокументыПредприятия") Тогда
				УВМ_ФормаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Действие.Предмет, "ФормаДокумента");
				РеквизитыНастройкиДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Действие.НастройкаДействия, "УВМ_ОтправитьДоговорКонтрагенту, УВМ_СформироватьДоговорВЕРП");
				//++GIV 30032026 (320030)
				УВМ_ОтправитьДоговорКонтрагенту = (РеквизитыНастройкиДействия.УВМ_ОтправитьДоговорКонтрагенту = Истина И УВМ_ФормаДокумента = Перечисления.ВариантыФормДокументов.Бумажная);
				//--GIV 30032026 (320030)
				УВМ_СформироватьДоговорВЕРП = РеквизитыНастройкиДействия.УВМ_СформироватьДоговорВЕРП;
			КонецЕсли;
			
			ВедущаяЗадача = БизнесПроцессы.КомплексныйПроцесс.УВМ_СоздатьЗадачуОбработкиЭлементаСхемы(
				НаименованиеЗадачи, ПроцессОбработки, УВМ_ОтправитьДоговорКонтрагенту, УВМ_СформироватьДоговорВЕРП);
			
		Иначе
			ВедущаяЗадача = БизнесПроцессы.КомплексныйПроцесс.СоздатьЗадачуОбработкиЭлементаСхемы(
				НаименованиеЗадачи, ПроцессОбработки);
		КонецЕсли
		//--dar 25.02.26 (309302)
		#КонецВставки
	КонецЕсли;

	ДопустимыеУчастники = ДопустимыеУчастникиДействияСогласования(Действие, ПроцессОбъект);

	ЗаполнитьСтруктуруДляПроцессаСогласования(
	СтруктураДляЗаполнения, Действие, ДопустимыеУчастники, ВедущаяЗадача);

	ПроцессОбъект.Заполнить(СтруктураДляЗаполнения);

	Если ПроцессОбъект.КоличествоИтераций = 0 Тогда
		ПроцессОбъект.КоличествоИтераций = 1;
	КонецЕсли;

	Возврат ПроцессОбъект;

КонецФункции

&ИзменениеИКонтроль("СоздатьПроцессИсполненияПоДействию")
Функция АБ_СоздатьПроцессИсполненияПоДействию(Действие, ПроцессОбработки)

	Отбор = Новый Структура;
	Отбор.Вставить("ФункцияУчастника",
	Перечисления.ФункцииУчастниковИсполнения.Исполнитель);
	Отбор.Вставить("ВышестоящийУчастник", УникальныйИдентификаторПустой());

	Если Действие.Участники.НайтиСтроки(Отбор).Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПроцессОбъект = БизнесПроцессы.Исполнение.СоздатьБизнесПроцесс();
	СтруктураДляЗаполнения = ПроцессОбъект.СтруктураДанныхДляЗаполнения();

	ДопустимыеУчастники = ДопустимыеИсполнителиДействияИсполнения(Действие, ПроцессОбъект);
	Если Не ЕстьДопустимыеИсполнителиДействияИсполнения(ДопустимыеУчастники) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ВедущаяЗадача = Неопределено;
	Если ПроцессОбработки <> Неопределено Тогда
		ШаблонНаименования = НСтр("ru = 'Обработка действия ""%1""'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		НаименованиеЗадачи = СтрШаблон(ШаблонНаименования, Действие.Ссылка);   
		#Удаление
		ВедущаяЗадача = БизнесПроцессы.КомплексныйПроцесс.СоздатьЗадачуОбработкиЭлементаСхемы(
		НаименованиеЗадачи, ПроцессОбработки);
		#КонецУдаления
		#Вставка
		//++GIV 30032026 (320030)
		Если ТипЗнч(Действие) = Тип("СправочникОбъект.ДействияИсполнения") Тогда
			УВМ_ФормаДокумента = Неопределено;
			УВМ_ОтправитьДоговорКонтрагенту = Ложь;
			УВМ_СформироватьДоговорВЕРП = Ложь;
			
			Если ТипЗнч(Действие.Предмет) = Тип("СправочникСсылка.ДокументыПредприятия") Тогда
				УВМ_ФормаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Действие.Предмет, "ФормаДокумента");
				РеквизитыНастройкиДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Действие.НастройкаДействия, "УВМ_ОтправитьДоговорКонтрагенту, УВМ_СформироватьДоговорВЕРП");
				УВМ_ОтправитьДоговорКонтрагенту = (РеквизитыНастройкиДействия.УВМ_ОтправитьДоговорКонтрагенту = Истина И УВМ_ФормаДокумента = Перечисления.ВариантыФормДокументов.Бумажная);
				УВМ_СформироватьДоговорВЕРП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Действие.НастройкаДействия, "УВМ_СформироватьДоговорВЕРП");
			КонецЕсли;
			
			ВедущаяЗадача = БизнесПроцессы.КомплексныйПроцесс.УВМ_СоздатьЗадачуОбработкиЭлементаСхемы(
				НаименованиеЗадачи, ПроцессОбработки, УВМ_ОтправитьДоговорКонтрагенту, УВМ_СформироватьДоговорВЕРП);
			
		Иначе
			ВедущаяЗадача = БизнесПроцессы.КомплексныйПроцесс.СоздатьЗадачуОбработкиЭлементаСхемы(
				НаименованиеЗадачи, ПроцессОбработки);
		КонецЕсли
		//--GIV 30032026 (320030)
		#КонецВставки
	КонецЕсли;

	ЗаполнитьСтруктуруДляПроцессаИсполнения(
	СтруктураДляЗаполнения, Действие, ДопустимыеУчастники, ВедущаяЗадача);

	ПроцессОбъект.Заполнить(СтруктураДляЗаполнения);

	Возврат ПроцессОбъект;

КонецФункции
