
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Протокол = РегистрыСведений.ПротоколВыполненияЗаданий.ПрочитатьЛог(Объект.Ссылка);
	
	ОписаниеТипа = Перечисления.ТипыЗаданий.ОписаниеТипаЗадания(Объект.Тип);
	
	ДолгоеЗадание = ОписаниеТипа.ДолгоеЗадание;
	Сеанс = ОписаниеТипа.Сеанс; 
	
// ХОЛД Начало
	УстановитьПривилегированныйРежим(Истина);
	УзелОбработки = КОДПовтИсп.УзелКОДПоИдентификатору(Строка(Объект.УзелОбработки));
	Если Не ОбщегоНазначения.СсылкаСуществует(УзелОбработки) Тогда
		УзелОбработки = Строка(Объект.УзелОбработки);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
// ХОЛД Конец
	
КонецПроцедуры

#КонецОбласти
