#Область ПрограммныйИнтерфейс

// Проверяет, является ли переданный тип договора договором продажи.
//
// Параметры:
//  ТипДоговора - ПеречислениеСсылка.ТипыДоговоров - тип договора, который необходимо проверить.
//
// Возвращаемое значение:
//  Булево - Истина, если тип договора относится к договорам продажи.
//
Функция ЭтоДоговорПродажи(ТипДоговора) Экспорт
	
	Если ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем
		Или ТипДоговора = Перечисления.ТипыДоговоров.СКомиссионером
		Или ТипДоговора = Перечисления.ТипыДоговоров.СХранителем
		//++ Устарело_Переработка24
		Или ТипДоговора = Перечисления.ТипыДоговоров.СДавальцем
		//-- Устарело_Переработка24
		Или ТипДоговора = Перечисления.ТипыДоговоров.СДавальцем2_5
		Или ТипДоговора = Перечисления.ТипыДоговоров.ПередачаВАренду
		Или ТипДоговора = Перечисления.ТипыДоговоров.Субаренда Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Проверяет, является ли переданный тип договора договором закупки.
//
// Параметры:
//  ТипДоговора - ПеречислениеСсылка.ТипыДоговоров - тип договора, который необходимо проверить.
//
// Возвращаемое значение:
//  Булево - Истина, если тип договора относится к договорам закупки.
//
Функция ЭтоДоговорЗакупки(ТипДоговора) Экспорт
	
Если ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком
	//++ Устарело_Переработка24
	ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком
	//-- Устарело_Переработка24
	ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком2_5
	ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком2_5_ЕАЭС
	ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СПоклажедателем
	ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СКомитентом
	ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.ВвозИзЕАЭС
	ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СКомитентомНаЗакупку
	ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.Импорт Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	//++dar 18.03.26 (317077)
	Если НЕ ЗначениеЗаполнено(Параметры.Отбор) И Параметры.СтрокаПоиска = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ТипыДоговоров.СПокупателем);
		ДанныеВыбора.Добавить(Перечисления.ТипыДоговоров.СПоставщиком);
		ДанныеВыбора.Добавить(Перечисления.ТипыДоговоров.ВвозИзЕАЭС);
		ДанныеВыбора.Добавить(Перечисления.ТипыДоговоров.СПереработчиком2_5);
		ДанныеВыбора.Добавить(Перечисления.ТипыДоговоров.СХранителем);
		ДанныеВыбора.Добавить(Перечисления.ТипыДоговоров.СДавальцем2_5);
		ДанныеВыбора.Добавить(Перечисления.ТипыДоговоров.СПоклажедателем);
	КонецЕсли;
	//--dar 18.03.26 (317077)
КонецПроцедуры

#КонецОбласти
