////////////////////////////////////////////////////////////////////////////////
// Модуль для переопределения особенностей конфигурации для холдинга (вызов сервера).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ТолькоХолдинг

// Формирует данные выбора справочника "Узлы КОД".
// 
// Параметры:
//  ВыбранныйУзелОбмена - УникальныйИдентификатор.
// 
// Возвращаемое значение:
//  СписокЗначений из СправочникСсылка.УзлыКОД -- Данные выбора справочника "Узлы КОД".
//
Функция УзлыКОДДанныеВыбора(ВыбранныйУзелОбмена) Экспорт
	
	ДанныеВыбора = Справочники.УзлыКОД.ПолучитьДанныеВыбора(Новый Структура);
	
	Для Каждого ЭлементВыбора Из ДанныеВыбора Цикл
		
		Если ЭлементВыбора.Значение = Справочники.УзлыКОД.ЭтотУзел Тогда
			ЭлементВыбора.Представление = СтрШаблон("%1 (%2)", ЭлементВыбора.Представление, НСтр("ru = 'этот узел'"));
		КонецЕсли;
		
		Если ЭлементВыбора.Значение.УникальныйИдентификатор() = ВыбранныйУзелОбмена Тогда
			ЭлементВыбора.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеВыбора;
	
КонецФункции

// Проверяет, существуют ли узлы, которые не имеют доступа к томам этого узла.
//
// Возвращаемое значение:
//	Булево - Истина, если существуют узлы не имеющие доступа к томам этого узла.
//
Функция ЕстьУзлыНеИмеющиеДоступаКТомамЭтогоУзла() Экспорт
	
	Возврат ОбщегоНазначенияДокументооборотХолдинг.ЕстьУзлыНеИмеющиеДоступаКТомамЭтогоУзла();
	
КонецФункции

#КонецОбласти

#КонецОбласти