
// +++ Миляев (295800) 2026-02-11 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВнешнийАдресБазы = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","АдресСервераВнешнийДоступ_ЕРПОсн"),Неопределено);
	
	ЭтаФорма.ТолькоПросмотрСписокДоговоров = Истина;
	ЭтаФорма.Контрагент = Параметры.Контрагент;
	ЭтаФорма.Заголовок = СтрШаблон("Действующие договоры: %1",Строка(ЭтаФорма.Контрагент));
	Если ЗначениеЗаполнено(Параметры.АдресРезультата) тогда
		СтруктураВнешДоговоров = ПолучитьИзВременногоХранилища(Параметры.АдресРезультата);
		СписокДоговоров = Неопределено;
		Если ТипЗнч(СтруктураВнешДоговоров) = Тип("Структура") И СтруктураВнешДоговоров.Свойство("ДоговорыНавСсылки",СписокДоговоров) тогда
			Для Каждого ЭлДоговор из СписокДоговоров цикл
				НовЗапись = Договоры.Добавить();
				ЗаполнитьЗначенияСвойств(НовЗапись,ЭлДоговор);
				НовЗапись.НавигационнаяСсылка = СтрШаблон("%1#%2",ВнешнийАдресБазы,НовЗапись.НавигационнаяСсылка);
			КонецЦикла;
		КонецЕсли;
		АБ_ВызовСервера.ВнестиИнформациюОВнешнихСсылкахПоВнешнимДоговорам(СтруктураВнешДоговоров,Параметры.ВидДокумента);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.НавигационнаяСсылка) тогда
		ПерейтиПоНавигационнойСсылке(Элемент.ТекущиеДанные.НавигационнаяСсылка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Отказ = Истина;
КонецПроцедуры

// --- Миляев (295800) 2026-02-11

