
#Область ПрограммныйИнтерфейс

// Вызывается из ПриСозданииНаСервере формы СозданиеДокументаПоШаблону
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения 
//  Отказ - Булево 
//  СтандартнаяОбработка - Булево
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

// Локализация
	Параметры = Форма.Параметры;
	Элементы = Форма.Элементы;
	
	Если Параметры.ПоказыватьТолькоДокументыПригодныеДляЭДО = Истина Тогда 
		Форма.ПоказыватьТолькоДокументыПригодныеДляЭДО = Истина;
	Иначе
		Форма.ПоказыватьТолькоДокументыПригодныеДляЭДО = Ложь;
	КонецЕсли;
	
	// Регламентированный учет обращений
	Если Форма.РегламентированныйУчетОбращений И Не Форма.ПоказыватьТолькоДокументыПригодныеДляЭДО Тогда 
		Элементы.Далее.Видимость = Истина;
		Элементы.Далее.КнопкаПоУмолчанию = Истина;
		Элементы.СоздатьПоШаблону.Видимость = Ложь;
	Иначе 
		Элементы.Далее.Видимость = Ложь;
		Элементы.СоздатьПоШаблону.КнопкаПоУмолчанию = Истина;
		Элементы.СоздатьПоШаблону.Видимость = Истина;
	КонецЕсли;
// Конец Локализация

КонецПроцедуры

// Вызывается из ПолучитьВсеШаблоныДокументов формы СозданиеДокументаПоШаблону
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - 
//  Запрос - Запрос
Процедура ДополнитьЗапросШаблоновДокументов(Форма, Запрос) Экспорт
	
// Локализация
	Если Форма.ПоказыватьТолькоДокументыПригодныеДляЭДО Тогда
		
		Запрос.Текст = Запрос.Текст + "
			|	И ШаблоныДокументов.ФормаДокумента <> Значение(Перечисление.ВариантыФормДокументов.Бумажная)
			|	И Не ВидыДокументов.ЯвляетсяОбращениемОтГраждан";
		
	КонецЕсли;
// Конец Локализация

КонецПроцедуры

#КонецОбласти
