
// @strict-types

#Область ОбработчикиСобытий

// Обработчик команды.
//
// Параметры:
//	ПараметрКоманды - СправочникСсылка.УзлыКОД - Узел обмена данными.
//	ПараметрыВыполненияКоманды -Структура Из КлючИЗначение - Параметры выполнения команды.
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОстановкиВозобновления = ПараметрыОстановкиВозобновленияОбмена();
	ПараметрыОстановкиВозобновления.Узел = ПараметрКоманды;
	ПараметрыОстановкиВозобновления.Направление =
		ПредопределенноеЗначение("Перечисление.НаправленияПотоковКОД.Отправка");
	
	Если ОтправкаДанныхОстановлена(ПараметрКоманды) Тогда
		ПараметрыОстановкиВозобновления.Остановлен = Ложь;
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ОстановитьВозобновитьОперативнуюОтправкуЗавершение", ЭтотОбъект, ПараметрыОстановкиВозобновления);
		
		ОбщегоНазначенияДокументооборотКлиент.ПоказатьВопросДаНет(
			ОписаниеОповещения,
			СтрШаблон(НСтр("ru = 'Возобновить отправку оперативных данных в узел ""%1""?'"), ПараметрКоманды));
	Иначе
		ПараметрыОстановкиВозобновления.Остановлен = Истина;
		ПараметрыОстановкиВозобновления.ГраницаОстановки = ГраницаОстановки();
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ОстановитьВозобновитьОперативнуюОтправкуЗавершение", ЭтотОбъект, ПараметрыОстановкиВозобновления);
		
		ОбщегоНазначенияДокументооборотКлиент.ПоказатьВопросДаНет(
			ОписаниеОповещения,
			СтрШаблон(НСтр("ru = 'Остановить отправку оперативных данных в узел ""%1""?'"), ПараметрКоманды));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор параметров остановки обмена данными.
//
// Возвращаемое значение:
//	см. КОДСервер.ПараметрыОстановкиВозобновленияОбмена.
//
&НаСервере
Функция ПараметрыОстановкиВозобновленияОбмена()
	
	Возврат КОДСервер.ПараметрыОстановкиВозобновленияОбмена();
	
КонецФункции

// Возвращает границу остановки обмена данными по направлению.
//
// Возвращаемое значение:
//	Число - Граница остановки.
//
&НаСервере
Функция ГраницаОстановки()
	
	Возврат Мин(Константы.ГраницаРассмотренияКОД.Получить(), ОтметкиВремени.Текущая());
	
КонецФункции

// Выполняет установку/снятие признака остановки обмена данными по направлению.
//
// Параметры:
//	Результат - КодВозвратаДиалога - Результат выбора пользователя.
//	Параметры - см. ПараметрыОстановкиВозобновленияОбмена.
//
&НаКлиенте
Процедура ОстановитьВозобновитьОперативнуюОтправкуЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОстановитьВозобновитьОтправкуДанных(Параметры);
		Оповестить("КОД_ИзменениеСтатусаОстановлен", Параметры.Узел);
	КонецЕсли;
	
КонецПроцедуры

// Определяет остановлена ли отправка данных в указанный узел.
//
// Параметры:
//	Параметры - см. ПараметрыОстановкиВозобновленияОбмена.
//
&НаСервере
Процедура ОстановитьВозобновитьОтправкуДанных(Параметры)
	
	КОДСервер.ОстановитьВозобновитьОбменДанными(Параметры);
	
КонецПроцедуры

// Определяет остановлена ли отправка данных в указанный узел.
//
// Параметры:
//	Узел - СправочникСсылка.УзлыКОД - Узел обмена данными.
//
// Возвращаемое значение:
//	Булево - Истина, если отправка данных приостановлена.
//
&НаСервере
Функция ОтправкаДанныхОстановлена(Узел)
	
	Возврат РегистрыСведений.СостоянияУзловКОД.ОбменСУзломОстановлен(
		Узел, Перечисления.НаправленияПотоковКОД.Отправка);
	
КонецФункции

#КонецОбласти
