
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает стандартный текст ошибки.
//
// Параметры:
//	ИмяФайла - Строка - Имя файла.
//	ПоискВТоме - Булево - Признак выполнения поиска в томе.
//	ВладелецФайла - Строка - Описание владельца файла.
//
// Возвращаемое значение:
//	Строка - Текст сообщения об ошибке.
//
Функция ОшибкаФайлНеНайденВХранилищеФайлов(ИмяФайла, ПоискВТоме = Истина, ВладелецФайла = "") Экспорт
	
	ЕстьУзлыНеИмеющиеДоступаКТомамЭтогоУзла = Ложь;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	ЕстьУзлыНеИмеющиеДоступаКТомамЭтогоУзла =
		ОбщегоНазначенияДокументооборотХолдинг.ЕстьУзлыНеИмеющиеДоступаКТомамЭтогоУзла();
	#Иначе
	ЕстьУзлыНеИмеющиеДоступаКТомамЭтогоУзла =
		ОбщегоНазначенияДокументооборотХолдингКлиент.ЕстьУзлыНеИмеющиеДоступаКТомамЭтогоУзла();
	#КонецЕсли

	ТекстОшибки = Новый Массив;
	ТекстОшибки.Добавить(
		СтрШаблон(
			НСтр("ru = 'Ошибка открытия файла:
			           |""%1"".
			           |%2
					   |Файл не найден в хранилище файлов.'"),
			ИмяФайла,
			ВладелецФайла));
		
	Если ПоискВТоме Тогда
		Если ЕстьУзлыНеИмеющиеДоступаКТомамЭтогоУзла Тогда
			ТекстОшибки.Добавить(
				НСтр("ru = 'Возможно файл еще не принят узлом или был удален антивирусной программой.'"));
		Иначе
			ТекстОшибки.Добавить(
				НСтр("ru = 'Возможно файл удален антивирусной программой.'"));
		КонецЕсли;
	Иначе
		Если ЕстьУзлыНеИмеющиеДоступаКТомамЭтогоУзла Тогда
			ТекстОшибки.Добавить(
				НСтр("ru = 'Возможно файл еще не принят узлом.'"));
		КонецЕсли;
	КонецЕсли;
	
	ТекстОшибки.Добавить(
		НСтр("ru = 'Обратитесь к администратору.'"));
	
	Возврат СтрСоединить(ТекстОшибки, Символы.ПС);
	
КонецФункции

#КонецОбласти