
&ИзменениеИКонтроль("ПередЗаписью")
Процедура АБ_ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	#Вставка
	//++dar 25.02.26 (309302)
	Если ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.Согласование")
		//++dar 02.04.26 (321152)
		ИЛИ ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.Исполнение") Тогда
		//--dar 02.04.26 (321152)
		УВМ_ВедущаяЗадача = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БизнесПроцесс, "ВедущаяЗадача");
		Если ЗначениеЗаполнено(УВМ_ВедущаяЗадача) Тогда
			РеквизитыВедущейЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УВМ_ВедущаяЗадача, "УВМ_ОтправитьДоговорКонтрагенту, УВМ_СформироватьДоговорВЕРП");
			УВМ_ОтправитьДоговорКонтрагенту = РеквизитыВедущейЗадачи.УВМ_ОтправитьДоговорКонтрагенту;
			УВМ_СформироватьДоговорВЕРП = РеквизитыВедущейЗадачи.УВМ_СформироватьДоговорВЕРП;
		КонецЕсли;
	КонецЕсли;
	//--dar 25.02.26 (309302)
	#КонецВставки
	
	ОбычнаяЗапись = Истина;
	ОбработатьТолькоПередачуПредметов = Ложь;
	Если ДополнительныеСвойства.Свойство("ВидЗаписи") Тогда

		ОбычнаяЗапись = Ложь;

		ОбработатьТолькоПередачуПредметов = 
		(ДополнительныеСвойства.ВидЗаписи = 
		"ЗаписьСОбновлением_МоихДокументов_КешаИнформацииОбОбъектах_ВизСогласования_ПредметовПодчиненныхПроцессов_ДопРеквизитовПоПредметам_СобытийИзмененияПредметов");

		Если Не ОбработатьТолькоПередачуПредметов Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// ХОЛД Начало
	Если ОбщегоНазначенияДокументооборот.ЭтоДокументооборотХолдинга()
		И ПолучитьФункциональнуюОпцию("ИспользоватьКОД") И Не МЭДОПереопределяемый.ЭтоМиграция() Тогда

		УзелОбработки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БизнесПроцесс, "УзелОбработки");

		Если УзелОбработки <> ОбменДаннымиДокументооборотПовтИсп.ИдентификаторТекущегоУзла() Тогда
			ВызватьИсключение НСтр("ru = 'Действие доступно только в узле, в котором создан процесс.'");
		КонецЕсли;

	КонецЕсли;
	// ХОЛД Конец

	АвторСобытия = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("АвторИзменения", АвторСобытия) Тогда
		АвторСобытия = ПользователиДокументооборот.ОлицетворяемыйПользователь();
	КонецЕсли;

	ТочкаМаршрутаСтарая = ТочкаМаршрутаВИБ();
	ДополнительныеСвойства.Вставить("ТочкаМаршрутаСтарая", ТочкаМаршрутаСтарая);

	Если ОбычнаяЗапись Тогда

		ОбновитьПовторно = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства,
		"ОбновитьПовторно", Ложь);

		Если (ЭтоНовый() Или ОбновитьПовторно)
			И ЗначениеЗаполнено(РольИсполнителя) И Не ЗначениеЗаполнено(Исполнитель) Тогда
			Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
		КонецЕсли;

		Если ДополнительныеСвойства.Свойство("ФактическийИсполнительЗадачи") Тогда
			ДополнительныеСвойства.Вставить("ПредыдущийИсполнитель", Исполнитель);
			Исполнитель = ДополнительныеСвойства.ФактическийИсполнительЗадачи;
		КонецЕсли;

		Если ДополнительныеСвойства.Свойство("ФактическийИсполнительПолный") Тогда
			ФактическийИсполнитель = ДополнительныеСвойства.ФактическийИсполнительПолный;
		КонецЕсли;

		ЗаписатьСобытияЗадачи(АвторСобытия);

		ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

		ЗадачаБылаВыполнена = Ложь;
		СтароеПринятаКИсполнению = Ложь;
		СтароеСостояниеБизнесПроцесса = Неопределено;

		Если НЕ Ссылка.Пустая() Тогда

			ЗадачаБылаВыполнена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Выполнена");
			СтароеПринятаКИсполнению = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПринятаКИсполнению");
			СтароеСостояниеБизнесПроцесса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СостояниеБизнесПроцесса");

		КонецЕсли;

		ДополнительныеСвойства.Вставить("СтароеПринятаКИсполнению", СтароеПринятаКИсполнению);
		ДополнительныеСвойства.Вставить("СтароеСостояниеБизнесПроцесса", СтароеСостояниеБизнесПроцесса);

		Если ЗадачаБылаВыполнена И НЕ Выполнена Тогда
			ДополнительныеСвойства.Вставить("ВыполнениеЗадачиБылоОтменено", Истина);
		КонецЕсли;

		Если Не ЗадачаБылаВыполнена И Выполнена
			И Не МиграцияДанныхИзВнешнихСистемСервер.ЭтоОбъектИзДругойСистемы(ИсточникДанных) Тогда

			Если СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Остановлен Тогда
				ВызватьИсключение НСтр("ru = 'Нельзя выполнять задачи остановленных процессов.'");
			КонецЕсли;	

			Если СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Прерван Тогда
				ВызватьИсключение НСтр("ru = 'Нельзя выполнять задачи прерванных процессов.'");
			КонецЕсли;	

			// Если задача выполнена, то запишем в реквизит Исполнитель того
			// пользователя, который фактически выполнил задачу. Это нам потом
			// потребуется для отчетов. Такую запись делаем только в том
			// случае, если в базе было не выполнено, а в объекте стало выполнено
			// Исполнитель устанавливается, только если текущая задача не является ведущей.
			Если НЕ ЗначениеЗаполнено(Исполнитель)
				И Не Задачи.ЗадачаИсполнителя.ЭтаСлужебнаяЗадачаПроцесса(ЭтотОбъект) Тогда
				Исполнитель = Сотрудники.ОсновнойСотрудник();
			КонецЕсли;
			Если ДатаИсполнения = Дата(1, 1, 1) Тогда
				ДатаИсполнения = ТекущаяДатаСеанса();
			КонецЕсли;

			Если НЕ (ДополнительныеСвойства.Свойство("ОтключитьЗаполнениеДополнительныхДанныхПоЗадаче")
				И ДополнительныеСвойства.ОтключитьЗаполнениеДополнительныхДанныхПоЗадаче = Истина) Тогда

				ДополнительныеДанныеПоЗадаче = Неопределено;
				ЕстьМетодДополнительныеДанныеПоЗадаче = Ложь;

				ИмяПроцесса = БизнесПроцесс.Метаданные().Имя;
				МенеджерПроцесса = БизнесПроцессы[ИмяПроцесса];

				Попытка
					ЕстьМетодДополнительныеДанныеПоЗадаче = МенеджерПроцесса.ЕстьМетодДополнительныеДанныеПоЗадаче();
				Исключение
					// В модуле менеджера процесса может не быть метода ЕстьМетодДополнительныеДанныеПоЗадаче
				КонецПопытки;

				Если ЕстьМетодДополнительныеДанныеПоЗадаче Тогда
					ДополнительныеДанныеПоЗадаче = МенеджерПроцесса.ДополнительныеДанныеПоЗадаче(ЭтотОбъект);
				КонецЕсли;

				Если ТипЗнч(ДополнительныеДанныеПоЗадаче) = Тип("Структура") Тогда

					РезультатВыполненияЗадачи = Неопределено;
					КонтекстВыполненияЗадачи = Неопределено;
					ДополнительныеДанныеПоЗадаче.Свойство("РезультатВыполнения", РезультатВыполненияЗадачи);
					ДополнительныеДанныеПоЗадаче.Свойство("КонтекстВыполненияЗадачи", КонтекстВыполненияЗадачи);

					// Добавление записи в результаты выполнения
					Если ЗначениеЗаполнено(РезультатВыполненияЗадачи) Тогда
						РегистрыСведений.РезультатыВыполненияПроцессовИЗадач.ЗаписатьРезультатПоОбъекту(Ссылка, РезультатВыполненияЗадачи);
					КонецЕсли;

					// Добавление записи в историю выполнения
					Если КонтекстВыполненияЗадачи <> Неопределено Тогда

						РаботаСЗадачами.ДобавитьВИсториюПоИсточнику(
						БизнесПроцесс,
						Ссылка,
						ДатаИсполнения,
						Справочники.СобытияЗадач.Выполнение,
						КонтекстВыполненияЗадачи,
						Исполнитель);

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

			ДополнительныеСвойства.Вставить("ЗадачаВыполнена", Истина);

		КонецЕсли;

		Если Важность.Пустая() Тогда
			Важность = Перечисления.ВариантыВажностиОбъектов.Обычная;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СостояниеБизнесПроцесса) Тогда
			СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Активен;
		КонецЕсли;

	КонецЕсли;

	Если ОбычнаяЗапись Или ОбработатьТолькоПередачуПредметов Тогда

		// Обработка предметов задачи
		Если Не МиграцияДанныхИзВнешнихСистемСервер.ЭтоОбъектИзДругойСистемы(ИсточникДанных) Тогда
			ПредметСтрокой = МультипредметностьКлиентСервер.ПредметыСтрокой(Предметы);
		КонецЕсли;

		ИзмененыПредметыЗадачи = Ложь;
		Если Не Ссылка.Пустая() Тогда
			ИзмененыПредметыЗадачи = Мультипредметность.ИзмененыПредметыЗадачи(ЭтотОбъект);
		КонецЕсли;

		// Обновление КешаИнформацииОбОбъектах
		Если ИзмененыПредметыЗадачи Тогда
			ПредыдущиеПредметы = Мультипредметность.ПолучитьПредметыЗадачи(ЭтотОбъект.Ссылка);
			БизнесПроцессыИЗадачиСервер.ПриЗаписиЗадачиСервер(ЭтотОбъект, ПредыдущиеПредметы);
		КонецЕсли;

	КонецЕсли;

	Если ОбычнаяЗапись Тогда

		ПредыдущаяПометкаУдаления = Ложь;
		Если НЕ Ссылка.Пустая() Тогда

			ПредыдущаяПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");

			// Проверка не изменились ли реквизиты адресации
			Адресация = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, 
			"Исполнитель, РольИсполнителя");

			// Проверка изменения исполнителя
			Если Адресация.Исполнитель <> Исполнитель Тогда

				// Если была ролевая маршрутизация, то реквизиты адресации 
				// считаются измененными только если задача адресована не 
				// исполнителю роли
				Если ЗначениеЗаполнено(Адресация.РольИсполнителя) Тогда

					ИсполнителиРоли = РегистрыСведений.ИсполнителиРолей.ИсполнителиРоли(Адресация.РольИсполнителя);
					ИсполнительСотрудник = 
					Сотрудники.ОсновнойСотрудникПользователя(
					Исполнитель);

					НайденВИсполнителяхРоли = Ложь;
					Для каждого Эл из ИсполнителиРоли Цикл
						Если Эл = ИсполнительСотрудник Тогда
							НайденВИсполнителяхРоли = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;

					Если Не НайденВИсполнителяхРоли Тогда
						ДополнительныеСвойства.Вставить("ИзменилисьРеквизитыАдресации", Истина);
						ДополнительныеСвойства.Вставить("СтарыеРеквизитыАдресации", Адресация);
						УстановитьДополнительныеСвойстваИзмененияИсполнителя();
					КонецЕсли;

				Иначе

					ДополнительныеСвойства.Вставить("ИзменилисьРеквизитыАдресации", Истина);
					ДополнительныеСвойства.Вставить("СтарыеРеквизитыАдресации", Адресация);
					УстановитьДополнительныеСвойстваИзмененияИсполнителя();

				КонецЕсли;

			КонецЕсли;

			// Проверка изменения ролевой маршрутизации
			Если Адресация.РольИсполнителя <> РольИсполнителя Тогда

				ДополнительныеСвойства.Вставить("ИзменилисьРеквизитыАдресации", Истина);
				ДополнительныеСвойства.Вставить("СтарыеРеквизитыАдресации", Адресация);
				УстановитьДополнительныеСвойстваИзмененияИсполнителя();

			КонецЕсли;

		КонецЕсли;
		ДополнительныеСвойства.Вставить("ПредыдущаяПометкаУдаления", ПредыдущаяПометкаУдаления);

		Если Не МиграцияДанныхИзВнешнихСистемСервер.ЭтоОбъектИзДругойСистемы(ИсточникДанных)
			И ПредыдущаяПометкаУдаления <> ПометкаУдаления Тогда

			БизнесПроцессыИЗадачиВызовСервера.ПриПометкеУдаленияЗадачи(Ссылка, ПометкаУдаления);
		КонецЕсли;

		Если НЕ Ссылка.Пустая() Тогда
			ПредыдущееСостояние = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СостояниеБизнесПроцесса");
			ДополнительныеСвойства.Вставить("ПредыдущееСостояние", ПредыдущееСостояние);

			Если ПредыдущееСостояние <> СостояниеБизнесПроцесса Тогда
				УстановитьСостояниеПодчиненныхБизнесПроцессов(СостояниеБизнесПроцесса);
				ИнтеграцияЗадач.ПриИзмененииСостоянияЗадачиПроцесса(ЭтотОбъект);
			КонецЕсли;

		КонецЕсли;

		Если Выполнена И Не ПринятаКИсполнению
			И Не МиграцияДанныхИзВнешнихСистемСервер.ЭтоОбъектИзДругойСистемы(ИсточникДанных) Тогда

			ПринятаКИсполнению = Истина;
			ДатаПринятияКИсполнению = ТекущаяДатаСеанса();
		КонецЕсли;	

		Если Автор <> Неопределено И ЗначениеЗаполнено(Автор)
			И Не МиграцияДанныхИзВнешнихСистемСервер.ЭтоОбъектИзДругойСистемы(ИсточникДанных) Тогда

			АвторСтрокой = Строка(Автор);
		КонецЕсли;

	КонецЕсли;

	Если (ОбычнаяЗапись Или ОбработатьТолькоПередачуПредметов)
		И ИзмененыПредметыЗадачи
		И Не МиграцияДанныхИзВнешнихСистемСервер.ЭтоОбъектИзДругойСистемы(ИсточникДанных) Тогда

		// Обновление ПредметовПодчиненныхПроцессов
		ПередатьСтатусы = МультипредметностьКлиентСервер.ЭтоПроцессОбработкиДокументов(ЭтотОбъект.БизнесПроцесс);
		Мультипредметность.ПередатьПредметыЗадачиПодчиненнымПроцессам(ЭтотОбъект, ПередатьСтатусы);

		// Обновление СобытийИзмененияПредметов
		Мультипредметность.ЗаписатьСобытиеИзменениеПредметовЗадачи(ЭтотОбъект);

		// Обновление ДопРеквизитовПоПредметам
		Мультипредметность.СкопироватьЗначенияДопРеквизитовПредметов(ЭтотОбъект);

	КонецЕсли;

	Если ОбычнаяЗапись Тогда

		// Заполнение текущего исполнителя
		Если ЗначениеЗаполнено(Исполнитель) Тогда
			ТекущийИсполнитель = Исполнитель;
		Иначе
			ТекущийИсполнитель = РольИсполнителя;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
