
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	#Удаление
	ВызватьИсключение НСтр("ru = 'Недопустимое открытие формы. Копирование настроек обработки производится из контекстного меню командами ""Выгрузить в файл"" и ""Загрузить из файла""'");
	#КонецУдаления

	Если Параметры.Свойство("ВидОбъектаИсточник") И ЗначениеЗаполнено(Параметры.ВидОбъектаИсточник) Тогда
		ВидОбъектаИсточник = Параметры.ВидОбъектаИсточник;
		ПрочитатьНастройкиИПравила();
	КонецЕсли;

КонецПроцедуры
