#Область ПрограммныйИнтерфейс

// Проверяет, соответствует ли переданное расширение файла списку,
// указанному в настройке.
// 
// Параметры:
//  РасширениеФайла - Строка
//
// Возвращаемое значение:
//  Булево - Истина, если расширение входит в список допустимых.
//
Функция ЭтоРасширениеФайлаТаймлист(РасширениеФайла) Экспорт
	
	МассивРасширений = ТаймлистВызовСервераПовтИсп.РасширенияФайловТаймлист();
	РасширениеФайлаБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(РасширениеФайла);
	
	Возврат МассивРасширений.Найти(НРег(РасширениеФайлаБезТочки)) <> Неопределено;
	
КонецФункции

// Возвращает строку расширений аудио- и видеофайлов, загружаемых в сервис Таймлист, по умолчанию.
// 
// Возвращаемое значение:
//  Строка
//
Функция РасширенияФайловТаймлистПоУмолчанию() Экспорт
	
	Возврат "mp4, mov, avi, webm, ogg, mpeg, mp3, m4a";
	
КонецФункции

// Возвращает стиль гиперссылки, выводимой в обзор файла Таймлист.
//
// Возвращаемое значение:
//  Строка
//
Функция СтильГиперссылки() Экспорт
	
	Стиль =
		"<head>
		|<style type=""text/css"">
		|.block
		|{
		|	width: 45%;
		|	font-family: Arial, Helvetica, sans-serif;
		|	font-size: 90%;
		|	line-height: 1.25;
		|	text-align: left;
		|	position: static;
		|}
		|a:visited {
		|	color: #006699; text-decoration: none;}
		|a:hover {
		|	color: #006699; text-decoration: underline;}
		|</style>
		|</head>";
	
	Возврат Стиль;
	
КонецФункции

// Возвращает строковый ключ отображения расшифровки в HTML обзор.
// 
// Возвращаемое значение:
//  Строка
//
Функция КлючОтображенияРасшифровкиHTML() Экспорт
	
	Возврат "TimelistEditTranscript";
	
КонецФункции

// Возвращает строковый ключ отображения автопротокоола в HTML обзор.
// 
// Возвращаемое значение:
//  Строка
//
Функция КлючОтображенияАвтопротоколаHTML() Экспорт
	
	Возврат "TimelistEditAutoprotocol";
	
КонецФункции

#КонецОбласти
