
&ИзменениеИКонтроль("СформироватьСтроковыйНомерДокумента")
Процедура АБ_СформироватьСтроковыйНомерДокумента(СтруктураПараметров, СформированныйНомер, ОписанияОшибок)

	Перем СтруктураФорматаНомера, ОписаниеОшибки;

	// вручную изменен номер
	Если СтруктураПараметров.ЧисловойНомер = -1 Тогда
		Возврат;
	КонецЕсли;	

	// не известен вид нумерации
	ВидДокумента = СтруктураПараметров.ВидДокумента;
	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		СформированныйНомер = "";
		ОписанияОшибок.Добавить("ВидДокумента", НСтр("ru = 'Не заполнено поле ""Вид документа""'"));
		Возврат;
	КонецЕсли;	

	// ручная нумерация
	Нумератор = ПолучитьНумераторДокумента(СтруктураПараметров); 
	Если Не ЗначениеЗаполнено(Нумератор) Тогда
		Возврат;
	КонецЕсли;

	ФорматНомера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Нумератор, "ФорматНомера");

	Если Не ЗначениеЗаполнено(ФорматНомера) Тогда
		СформированныйНомер = "";
		ОписанияОшибок.Добавить("", НСтр("ru = 'Не указан формат номера для нумератора. Обратитесь к Администратору.'"));
		Возврат;
	КонецЕсли;	

	// автоматическая нумерация
	Если Не РазобратьФорматНомера(ФорматНомера, ОписаниеОшибки, СтруктураФорматаНомера) Тогда 
		СформированныйНомер = "";
		ОписанияОшибок.Добавить("", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Ошибка в формате номера: %1. Обратитесь к Администратору.'"), ОписаниеОшибки));
		Возврат;
	КонецЕсли;	

	ЗначенияПараметровНомера = ПолучитьЗначенияПараметровНомера(СтруктураПараметров, СтруктураФорматаНомера, ОписанияОшибок);
	Если ОписанияОшибок.Количество() > 0 Тогда
		СформированныйНомер = "";
		Возврат;
	КонецЕсли;	

	#Вставка
	//++dar 17.02.26 (309302)
	УВМ_РеквизитыНумератора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Нумератор, "УВМ_НомерСтрокой, УВМ_ДлинаНомера");
	ЗначенияПараметровНомера.Вставить("УВМ_НомерСтрокой", УВМ_РеквизитыНумератора.УВМ_НомерСтрокой);
	ЗначенияПараметровНомера.Вставить("УВМ_ДлинаНомера", УВМ_РеквизитыНумератора.УВМ_ДлинаНомера);
	//--dar 17.02.26 (309302)
	#КонецВставки
	СформированныйНомер = СформироватьНомерДокументаПоФормату(СтруктураФорматаНомера, ЗначенияПараметровНомера);

КонецПроцедуры

&ИзменениеИКонтроль("СформироватьНомерДокументаПоФормату")
Функция АБ_СформироватьНомерДокументаПоФормату(СтруктураФорматаНомера, ЗначенияПараметровНомера)

	СформированныйНомер = "";

	Для Каждого ЭлементФормата Из СтруктураФорматаНомера Цикл

		Если ЭлементФормата.Ключ = "Разделитель" Тогда

			Если ЭлементФормата.ВходитВСлужебное = 0 Тогда
				СформированныйНомер = СформированныйНомер + ЭлементФормата.Значение;
			Иначе
				ЗначениеПараметра = "";
				СлужебноеПоле = СтруктураФорматаНомера.Получить(ЭлементФормата.ВходитВСлужебное - 1).Значение;
				ЗначенияПараметровНомера.Свойство(СлужебноеПоле, ЗначениеПараметра);
				Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда 
					СформированныйНомер = СформированныйНомер + ЭлементФормата.Значение;
				КонецЕсли;	
			КонецЕсли;	

		ИначеЕсли ЭлементФормата.Ключ = "СлужебноеПоле" Тогда

			ЗначениеПараметра = "";
			ЗначенияПараметровНомера.Свойство(ЭлементФормата.Значение, ЗначениеПараметра);

			Если ТипЗнч(ЗначениеПараметра) = Тип("Число") Тогда
				#Удаление
				ЗначениеПараметра = Формат(ЗначениеПараметра, "ЧГ=");
				#КонецУдаления
				#Вставка
				//++dar 17.02.26 (309302)
				Если ЭлементФормата.Значение = "Номер" Тогда
					Если ЗначенияПараметровНомера.Свойство("УВМ_НомерСтрокой") И ЗначенияПараметровНомера.УВМ_НомерСтрокой Тогда
						УВМ_ПараметрыФормата = СтрШаблон("ЧЦ=%1; ЧВН=; ЧГ=0", ЗначенияПараметровНомера.УВМ_ДлинаНомера);
						ЗначениеПараметра = Формат(ЗначениеПараметра, УВМ_ПараметрыФормата);
					Иначе
						ЗначениеПараметра = Формат(ЗначениеПараметра, "ЧГ=");
					КонецЕсли;
				Иначе
					ЗначениеПараметра = Формат(ЗначениеПараметра, "ЧГ=");
				КонецЕсли;
				//--dar 17.02.26 (309302)
				#КонецВставки
			Иначе	
				ЗначениеПараметра = Строка(ЗначениеПараметра);
			КонецЕсли;	
			
			СформированныйНомер = СформированныйНомер + ЗначениеПараметра;
		КонецЕсли;	

	КонецЦикла;	
    #Вставка
	//++GIV 24032026 (320030)
	Если Прав(СформированныйНомер, 1) = "-" Тогда
		СформированныйНомер = Лев(СформированныйНомер, СтрДлина(СформированныйНомер) - 1);
	КонецЕсли;
	//--GIV 24032026 (320030)
	#КонецВставки
	Возврат СформированныйНомер;

КонецФункции
