
&ИзменениеИКонтроль("ОбработкаОбъектаПередЗаполнением")
Процедура АБ_ОбработкаОбъектаПередЗаполнением(ОбъектДО, ПравилоЗагрузки, ЗначенияИзШаблона)

	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ОсновнойСотрудникТекущегоПользователя = Сотрудники.ОсновнойСотрудникПользователя();
	ОбъектДО.ДополнительныеСвойства.Вставить("ТекущаяДата", ТекущаяДата);
	ОбъектДО.ДополнительныеСвойства.Вставить("ТекущийПользователь", ТекущийПользователь);
	ОбъектДО.ДополнительныеСвойства.Вставить(
	"ОсновнойСотрудникТекущегоПользователя",
	ОсновнойСотрудникТекущегоПользователя);

	Если ТипЗнч(ОбъектДО) = Тип("СправочникОбъект.ДокументыПредприятия") Тогда

		ОбъектДО.ДополнительныеСвойства.Вставить("НачальныйРегистрационныйНомер", ОбъектДО.РегистрационныйНомер);
#Вставка
		// + СБит 2026-06-23 #УВМ 334435
		ОбъектДО.ОбменДанными.Загрузка = Истина;
		// - СБит 2026-06-23 #УВМ
#КонецВставки

		Если ЗначениеЗаполнено(ПравилоЗагрузки.Шаблон) Тогда
			// Получение данных из шаблона.
			Если ОбъектДО.Шаблон <> ПравилоЗагрузки.Шаблон Тогда
				ОбъектДО.Шаблон = ПравилоЗагрузки.Шаблон;
			КонецЕсли;
			ЗначенияИзШаблона = Новый Структура("Документ, СтатьиДДС",
			Справочники.ДокументыПредприятия.СоздатьЭлемент(),
			ОбработкаЗапросовXDTOДокументы.ТаблицаСтатьиДвиженияДенежныхСредств());
			ЗначенияИзШаблона.Документ.ВидДокумента = ПравилоЗагрузки.ВидДокумента;
			ШаблоныДокументов.ЗаполнитьРеквизитыДокументаПоШаблону(
			ПравилоЗагрузки.Шаблон,
			ЗначенияИзШаблона.Документ);
			ШаблоныДокументов.ЗаполнитьСтатьиДДСДокументаПоШаблону(
			ПравилоЗагрузки.Шаблон,
			ЗначенияИзШаблона.СтатьиДДС,
			ЗначенияИзШаблона.Документ.Сумма,
			ЗначенияИзШаблона.Документ.СуммаНДС);
		КонецЕсли;

		ЗаполнятьПоШаблону = Не ЗначениеЗаполнено(ОбъектДО.Ссылка) И ЗначениеЗаполнено(ОбъектДО.Шаблон);
		ОбъектДО.ДополнительныеСвойства.Вставить("ЗаполнятьПоШаблону", ЗаполнятьПоШаблону);

		Если ЗначениеЗаполнено(ПравилоЗагрузки.ВидДокумента)
			И ОбъектДО.ВидДокумента <> ПравилоЗагрузки.ВидДокумента Тогда
			ОбъектДО.ВидДокумента = ПравилоЗагрузки.ВидДокумента;
#Вставка
			// + СБит 2026-06-22 #УВМ 334435
			Если НЕ ЗначениеЗаполнено(ОбъектДО.УВМ_ВариантДоговора) Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
				|	ВидыДокументовУВМ_ВариантыДоговоров.ВариантДоговора КАК УВМ_ВариантДоговора
				|ИЗ
				|	Справочник.ВидыДокументов.УВМ_ВариантыДоговоров КАК ВидыДокументовУВМ_ВариантыДоговоров
				|ГДЕ
				|	ВидыДокументовУВМ_ВариантыДоговоров.Ссылка = &Ссылка"); 
				Запрос.УстановитьПараметр("Ссылка", ОбъектДО.ВидДокумента);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ОбъектДО.УВМ_ВариантДоговора = Выборка.УВМ_ВариантДоговора;
				КонецЕсли;	 
			КонецЕсли;
			// - СБит 2026-06-22 #УВМ
#КонецВставки
		КонецЕсли;

		КэшВидаДокумента = Делопроизводство.КэшВидаДокумента(ОбъектДО.ВидДокумента);
		ОбъектДО.ДополнительныеСвойства.Вставить("КэшВидаДокумента", КэшВидаДокумента);

		Если КэшВидаДокумента.ЯвляетсяВходящейКорреспонденцией
			Или КэшВидаДокумента.ЯвляетсяИсходящейКорреспонденцией Тогда
			// Получение параметров корреспонденции.
			ПараметрыКорреспонденции = ОбработкаЗапросовXDTOДокументы.ПараметрыКорреспонденцииДокумента(
			ОбъектДО,
			КэшВидаДокумента);
			ОбработкаЗапросовXDTOДокументы.ЗаполнитьПараметрыКорреспонденцииИзДокумента(
			ОбъектДО,
			ПараметрыКорреспонденции);
			ОбъектДО.ДополнительныеСвойства.Вставить("ПараметрыКорреспонденции", ПараметрыКорреспонденции);
		КонецЕсли;

		Связи = Новый ТаблицаЗначений;
		Связи.Колонки.Добавить("СвязанныйОбъект");
		Связи.Колонки.Добавить("ТипСвязи");
		ОбъектДО.ДополнительныеСвойства.Вставить("Связи", Связи);

	КонецЕсли;

КонецПроцедуры
