
#Область ПрограммныйИнтерфейс

// Обновляет значение константы:
// Если включены механизмы, использующие отметки, константа включается, иначе выключается.
// 
Процедура ОбновитьЗначение() Экспорт
	
	ИспользоватьКОД = Ложь;
	
// ХОЛД Начало
	ИспользоватьКОД = Константы.ИспользоватьКОД.Получить();
// ХОЛД Конец
	
	ИспользоватьОтметкиВремени =
		Константы.ИнтеграцияС1САрхивом.Получить() = Истина
			Или Константы.ПереходСтадия.Получить() > 0
			Или ИспользоватьКОД = Истина;
	
	Если Получить() <> ИспользоватьОтметкиВремени Тогда
		Установить(ИспользоватьОтметкиВремени);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти