
#Область ОбработчикиСобытийФормы

&НаСервере
&Перед("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере1(Отказ, СтандартнаяОбработка)
	//++dar 17.02.26 (309302)
	Элементы.Содержание.Видимость =Ложь;                                                                                                                       
	
	//++dar 04.05.26 (326149)
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтотОбъект, "УВМ_ТипКонтрагента", УВМ_РаботаСФормами.ОписаниеТипаПеречисление("УВМ_ТипыКонтрагентов"));
	//--dar 04.05.26 (326149)

	//++dar 29.04.26 (326008)
	Элементы.СтороныНаименование.УстановитьДействие("НачалоВыбора", "УВМ_СтороныНаименованиеНачалоВыбора");
	Элементы.СтороныНаименование.РежимВыбораИзСписка = Истина;
	Элементы.СтороныНаименование.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(Объект.УВМ_ВариантДоговора) Тогда
		МассивСторон = УВМ_ПовтИсп.НаименованияСторонПоТипуДокумента(Объект.УВМ_ВариантДоговора);
		Для Каждого ТекСторона Из МассивСторон Цикл
			Элементы.СтороныНаименование.СписокВыбора.Добавить(ТекСторона);   
	    КонецЦикла;
	КонецЕсли;
	//--dar 29.04.26 (326008)
	
	УВМ_РаботаСФормами.НоваяКолонкаТаблицыФормы(ЭтотОбъект, "УВМ_Почта", Элементы.СтороныГруппаСторонаКонтактноеЛицо, "Объект.Стороны.УВМ_Почта", , "Email");

	//++срок действия договора
	СвойстваГруппаСрокДействия = Новый Структура("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	УВМ_ГруппаСрокДействия = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтотОбъект, "УВМ_ГруппаСрокДействия", Элементы.ГруппаРеквизиты, 
																					Элементы.СрокДействияСтрока, , , , СвойстваГруппаСрокДействия);
	СвойстваДатаНачалаДействия = Новый Структура;
	СвойстваДатаНачалаДействия.Вставить("АвтоМаксимальнаяШирина", Истина);
	СвойстваДатаНачалаДействия.Вставить("АвтоМаксимальнаяВысота", Истина);
	УВМ_ДатаНачалаДействия = УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "ДатаНачалаДействия", УВМ_ГруппаСрокДействия, Истина, , , "Действует с", СвойстваДатаНачалаДействия);
	
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "ПорядокПродления", Элементы.ГруппаРеквизиты, Истина, , Элементы.СрокДействияСтрока, "Продление");
	//--срок действия договора
	
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_КоличествоДнейОтсрочки", Элементы.ГруппаРеквизиты, Истина, , Элементы.СрокДействияСтрока, "Дней отсрочки");
	
	СвойстваГруппаНеустойка = Новый Структура("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	УВМ_ГруппаНеустойка = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтотОбъект, "УВМ_ГруппаНеустойка", Элементы.ГруппаРеквизиты, 
																				Элементы.СрокДействияСтрока, , , , СвойстваГруппаНеустойка);
																				
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ТипНеустойки", УВМ_ГруппаНеустойка, Истина, , , "Тип неустойки");                  
	СвойстваПроцентНеустойки = Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ПроцентНеустойки", УВМ_ГруппаНеустойка, Истина, , , "%", СвойстваПроцентНеустойки);
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.УВМ_ТипНеустойки = Перечисления.УВМ_ТипыНеустойки.КоммерческийКредит;
		Объект.ФормаДокумента = Перечисления.ВариантыФормДокументов.ПустаяСсылка();
	КонецЕсли;
	
	//++dar 22.04.26 (324174)
	СвойстваВариантДоговора = Новый Структура("РежимВыбораИзСписка, АвтоОтметкаНезаполненного", Истина, Истина);
	СобытияВариантДоговора = Новый Структура("ПриИзменении", "УВМ_ВариантДоговораПриИзменении");
	УВМ_ВариантДоговора = УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ВариантДоговора", Элементы.ГруппаЛево, Истина, , Элементы.Содержание, 
															"Тип договора", СвойстваВариантДоговора, СобытияВариантДоговора);
	Если НЕ Параметры.Ключ.Пустая() Тогда
		УВМ_ПриИзмененииВидаДокумента();
	КонецЕсли;
	//--dar 22.04.26 (324174)

	// является копией
	УВМ_РеквизитыФайлов = Новый Структура;
	УВМ_РеквизитыФайлов.Вставить("УВМ_ЯвляетсяКопией", УВМ_РаботаСФормами.ОписаниеТипаБулево());
	//++dar 16.04.26 (323545)
	УВМ_РеквизитыФайлов.Вставить("УВМ_ЕстьКопия", УВМ_РаботаСФормами.ОписаниеТипаБулево());
	УВМ_РеквизитыФайлов.Вставить("УВМ_ЕстьОригинал", УВМ_РаботаСФормами.ОписаниеТипаБулево());
	//--dar 16.04.26 (323545)
	УВМ_РаботаСФормами.СоздатьРеквизитыТаблицы(ЭтотОбъект, "Файлы", УВМ_РеквизитыФайлов);                                                                            
	
	СвойстваЯвляетсяКопией = Новый Структура;
	СвойстваЯвляетсяКопией.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	СвойстваЯвляетсяКопией.Вставить("КартинкаШапки", БиблиотекаКартинок.СкопироватьВБуферОбмена);
	СвойстваЯвляетсяКопией.Вставить("Подсказка", "Копия");
	
	СобытияЯвляетсяКопией = Новый Структура("ПриИзменении", "УВМ_ЯвляетсяКопиейПриИзменении");
	
	УВМ_РаботаСФормами.НоваяКолонкаТаблицыФормы(ЭтотОбъект, "УВМ_ЯвляетсяКопиейСоздание", Элементы.ФайлыСоздание, "Файлы.УВМ_ЯвляетсяКопией", 2, "Копия", 
													Истина, Истина, СвойстваЯвляетсяКопией, СобытияЯвляетсяКопией, Элементы.ОригиналСоздание);
	
	УВМ_РаботаСФормами.НоваяКолонкаТаблицыФормы(ЭтотОбъект, "УВМ_ЯвляетсяКопией", Элементы.Файлы, "Файлы.УВМ_ЯвляетсяКопией", 2, "Копия", 
													Истина, Истина, СвойстваЯвляетсяКопией, СобытияЯвляетсяКопией, Элементы.Оригинал);
	Элементы.Оригинал.Подсказка = "Оригинал";
	Элементы.ОригиналСоздание.Подсказка = "Оригинал";
	//--dar 17.02.26 (309302)

КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++dar 25.11.25 (296038)                                                                      
	УВМ_ДобавитьКомандыНаФорму();
	//--dar 25.11.25 (296038)                
	//++dar 28.11.25 (295760)
	Элементы.СостояниеТекст.Видимость = Ложь;
	Элементы.СрокДействияСтрока.Заголовок = "Срок действия договора";
	
	//убрали с Татьяной Боярниковой 15.04.26
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	СотрудникиПользователей.Сотрудник КАК Сотрудник
	//|ИЗ
	//|	РегистрСведений.СотрудникиПользователей КАК СотрудникиПользователей
	//|ГДЕ
	//|	СотрудникиПользователей.Пользователь = &Пользователь
	//|	И СотрудникиПользователей.Сотрудник.УВМ_ДолжностьУпр = ЗНАЧЕНИЕ(Справочник.УВМ_ДолжностиУпр.Юрист)";
	//Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	//РезультатЗапроса = Запрос.Выполнить();
	//Если РезультатЗапроса.Пустой() Тогда
	//	Элементы.ДелоТекст.ТолькоПросмотр = Истина;
	//КонецЕсли;
	//--dar 28.11.25 (295760)
	//++dar 17.02.26 (309302)
	СвойстваДатаОкончанияДействия = Новый Структура("Видимость", Истина);
	СвойстваДатаОкончанияДействия.Вставить("АвтоМаксимальнаяШирина", Истина);
	СвойстваДатаОкончанияДействия.Вставить("АвтоМаксимальнаяВысота", Истина);
	СвойстваДатаОкончанияДействия.Вставить("ТолькоПросмотр", Ложь);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "ДатаОкончанияДействия", Элементы.УВМ_ГруппаСрокДействия, Истина, , , "по", СвойстваДатаОкончанияДействия);                      

	СвойстваБессрочный = Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	СвойстваБессрочный.Вставить("Подсказка", "Бессрочный");
	СобытияБессрочный = Новый Структура("ПриИзменении", "УВМ_БессрочныйПриИзменении");
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "Бессрочный", Элементы.УВМ_ГруппаСрокДействия, Истина, "Бессрочный", 1, СвойстваБессрочный, СобытияБессрочный);
	
	УВМ_ОбновитьСвойстваЭлементовФормыСрокДействия();
	Элементы.СрокДействияСтрока.Видимость = Ложь;
	//--dar 17.02.26 (309302)
	
	// +++ Миляев (293293) 2026-02-19
	УВМ_СоздатьСтруктуруКонстант();
	//++GIV 31032026 (320030)
	//Если ЭтаФорма.СтруктураКонстантУВМ.Свойство("ВД_ДоговорПоставкиМыПоставщик") 
		//и Объект.ВидДокумента = ЭтаФорма.СтруктураКонстантУВМ.ВД_ДоговорПоставкиМыПоставщик тогда
		
		СтруктураСобытий = Новый Структура("НачалоВыбора","УВМ_СтороныОснованиеНачалоВыбора");
		СтруктураСвойств = Новый Структура("КнопкаВыпадающегоСписка",Ложь);
		СтруктураСвойств = Новый Структура("РедактированиеТекста",Ложь);
		УВМ_РаботаСФормами.НоваяКолонкаТаблицыФормы(ЭтаФорма,"УВМ_СтороныОснование"
			,"СтороныГруппаНаименованиеПодписал"
			,"Объект.Стороны.УВМ_Основание",0
			,"Основание",Истина,Истина,СтруктураСвойств,СтруктураСобытий);
		
	//КонецЕсли;
	//--GIV 31032026 (320030)
	// --- Миляев (293293) 2026-02-19
	
	//++до_ (314824) 20260318
	АБ_СостояниеДокумента = СтрШаблон("Состояние:%1", Делопроизводство.ПолучитьПоследнееСостояниеДокумента(Объект.Ссылка));
	//--до_ (314824) 20260318
	
	//++dar 02.06.26 (330921)
	ДатаОтправкиПисьма = АБ_ВызовСервера.УВМ_ДатаОтправкиПисьмаКонтрагенту(Объект.Ссылка);
	Если ЗначениеЗаполнено(ДатаОтправкиПисьма) Тогда
		АБ_СостояниеДокумента = СтрШаблон("%1 / Письмо направлено %2 г.", АБ_СостояниеДокумента, Формат(ДатаОтправкиПисьма, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	УВМ_РаботаСФормами.НоваяДекорацияНадпись(ЭтотОбъект, "АБ_СостояниеДокумента", Элементы.ГруппаКомПанели, АБ_СостояниеДокумента, Ложь, Элементы.ГруппаВсеДействия);  
	//++dar 02.06.26 (330921)
	
	//++dar 18.03.26 (317077)
	//СвойстваГруппаНалогообложениеНДС = Новый Структура("ШрифтЗаголовка", Новый Шрифт("Arial", 10, Истина, Ложь, Ложь, Ложь));
	СвойстваГруппаНалогообложениеНДС = Новый Структура("ШрифтЗаголовка, ЦветТекстаЗаголовка", Новый Шрифт("Arial", 10), ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветКалендаряПодпись"));
	ГруппаНалогообложениеНДС = УВМ_РаботаСФормами.НоваяГруппаОбычная(ЭтотОбъект, "ГруппаНалогообложениеНДС", Элементы.ГруппаРеквизиты, "Налогообложение НДС", 1, , , СвойстваГруппаНалогообложениеНДС, Элементы.ГруппаСумма);
	//ГруппаНалогообложениеНДС = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаНалогообложениеНДС", Элементы.ГруппаРеквизиты, Элементы.ГруппаСумма, 1);
	ГруппаРежимНалогообложенияОпределяетсяЗначением = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаРежимНалогообложенияОпределяетсяЗначением", ГруппаНалогообложениеНДС, , 3, , , );
	
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтотОбъект, "РежимНалогообложения", УВМ_РаботаСФормами.ОписаниеТипаЧисло(1,0));                                                                                                   
	
	Свойства1 = Новый Структура("Вид, ПоложениеЗаголовка", ВидПоляФормы.ПолеПереключателя, ПоложениеЗаголовкаЭлементаФормы.Нет);
	События1 = Новый Структура("ПриИзменении", "РежимНалогообложенияПриИзменении");
	РежимНалогообложенияОпределяетсяЗначением = УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "РежимНалогообложенияОпределяетсяЗначением", ГруппаРежимНалогообложенияОпределяетсяЗначением, "РежимНалогообложения", , , "Налогообложение операций по договору", Свойства1, События1);
	РежимНалогообложенияОпределяетсяЗначением.СписокВыбора.Добавить(0, "Определяется указанным значением");
	
	Свойства2 = Новый Структура;
	Свойства2.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	Свойства2.Вставить("Ширина", 25);
	Свойства2.Вставить("АвтоМаксимальнаяШирина", Истина);
	Свойства2.Вставить("АвтоМаксимальнаяВысота", Истина);
	Свойства2.Вставить("РастягиватьПоГоризонтали", Ложь); 
	Свойства2.Вставить("РежимВыбораИзСписка", Истина);
	События2 = Новый Структура("ПриИзменении", "НалогообложениеНДСПриИзменении");
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_НалогообложениеНДС", ГруппаРежимНалогообложенияОпределяетсяЗначением, Истина, , , , Свойства2, События2); 
	
	РежимНалогообложенияОпределяетсяВДокументе = УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "РежимНалогообложенияОпределяетсяВДокументе", ГруппаНалогообложениеНДС, "РежимНалогообложения", , , "Налогообложение операций по договору", Свойства1, События1);
	РежимНалогообложенияОпределяетсяВДокументе.СписокВыбора.Добавить(1, "Определяется в заказах и накладных");
	
	Свойства3 = Новый Структура("Ширина, АвтоМаксимальнаяШирина, АвтоМаксимальнаяВысота, РастягиватьПоГоризонтали, РежимВыбораИзСписка", 25, Истина, Истина, Ложь, Истина);
	События3 = Новый Структура("ПриИзменении", "УВМ_СтавкаНДСПриИзменении");
	УВМ_СтавкаНДС = УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_СтавкаНДС", ГруппаНалогообложениеНДС, Истина, , , "Ставка НДС для платежей", Свойства3, События3);
	ЗаполнитьСписокСтавокНДС(УВМ_СтавкаНДС);
	
	ЛокализацияВидАгентскогоДоговора = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтотОбъект, "ЛокализацияВидАгентскогоДоговора", ГруппаНалогообложениеНДС, , 2, , , );
	
	Свойства4 = Новый Структура("Ширина, АвтоМаксимальнаяШирина, АвтоМаксимальнаяВысота, РастягиватьПоГоризонтали", 25, Истина, Истина, Ложь);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ВидАгентскогоДоговора", ЛокализацияВидАгентскогоДоговора, Истина, , , "Вид договора налогового агента", Свойства4);
	
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтотОбъект, "ТипДоговораЕРП", УВМ_РаботаСФормами.ОписаниеТипаПеречисление("ТипыДоговоров"));
	ЭтотОбъект.ТипДоговораЕРП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидДокумента, "УВМ_ТипДоговора");

	//++dar 01.06.26 (330575)
	Если ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
		СкрыватьПолеТипНеустойки = НЕ (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидДокумента, "УВМ_СкрыватьПолеТипНеустойки") = Истина);
		Элементы.УВМ_ТипНеустойки.Видимость = СкрыватьПолеТипНеустойки;
		Элементы.УВМ_ПроцентНеустойки.Видимость = СкрыватьПолеТипНеустойки;
	КонецЕсли;
	//--dar 01.06.26 (330575)
	
	ПриЧтенииСозданииНаСервере();
	//--dar 18.03.26 (317077)
	
	//++dar 16.04.26 (323545)
	УстановитьУсловноеОформлениеДляФлаговОригиналКопия();
	//--dar 16.04.26 (323545)

	//++dar 22.04.26 (324174)
	УВМ_РеквизитыДоговораАрендыНаСервере();
	//--dar 22.04.26 (324174)
	
	//++dar 29.04.26 (326008)
	Элементы.СтороныПодписан.ТолькоПросмотр = Истина;
	Элементы.СтороныДатаПодписи.ТолькоПросмотр = Истина; 
	Элементы.СтороныГруппаПодписанДатаПодписи.ТолькоПросмотр = Истина;
	Элементы.ДелаетНедействующимиСтрока.Видимость = Ложь;
	//--dar 29.04.26 (326008)

	//++dar 01.06.26 (330575)
	ВключенаИсторияКомментария = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","УВМ_ВключенаИсторияКомментарияДокументыПредприятия"),Ложь);
	Если НЕ ВключенаИсторияКомментария Тогда
		АБ_ВызовСервера.ОбеспечитьВедениеИсторииРеквизита(Метаданные.Справочники.ДокументыПредприятия, "Комментарий");
		АБ_ВызовСервера.УстановитьЗначениеКонстантыВРегистре(Новый Структура("Ключ","УВМ_ВключенаИсторияКомментарияДокументыПредприятия"),Истина);
	КонецЕсли;
	
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтотОбъект, "КонтрагентДляЗаполнения", УВМ_РаботаСФормами.ОписаниеТипаСправочник("Контрагенты"));
	
	ОбновитьКонтрагентаДляЗаполненияНаСервере();
	
	МассивСвязей = Новый Массив;
	МассивСвязей.Добавить(Новый Структура("Имя, ПутьКДанным", "Отбор.Контрагент", "КонтрагентДляЗаполнения"));
	
	УВМ_РаботаСФормами.УстановитьСвязиПараметровВыбораЭлементаФормы(Элементы.УВМ_АдресОбъекта, МассивСвязей);
	//--dar 01.06.26 (330575)
	
КонецПроцедуры

//++dar 01.06.26 (330575)
&НаСервере
Процедура ОбновитьКонтрагентаДляЗаполненияНаСервере()
	
	ЭтотОбъект.КонтрагентДляЗаполнения = Справочники.Контрагенты.ПустаяСсылка();
	Для Каждого ТекСтрока Из Объект.Стороны Цикл
		Если ТипЗнч(ТекСтрока.Сторона) = Тип("СправочникСсылка.Контрагенты") Тогда
			ЭтотОбъект.КонтрагентДляЗаполнения = ТекСтрока.Сторона;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
//--dar 01.06.26 (330575)

//++dar 16.04.26 (323545)
&НаСервере
Процедура УстановитьУсловноеОформлениеДляФлаговОригиналКопия()
	
	//Флаг Оригинал
	ЭлементыОтбораПоляОригинал = УсловноеОформление.Элементы[15].Отбор.Элементы[0].Элементы;
	ЭлементОтбораОригинал = ЭлементыОтбораПоляОригинал.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораОригинал.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Файлы.УВМ_ЕстьОригинал");
	ЭлементОтбораОригинал.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораОригинал.ПравоеЗначение = Ложь;
	
	//Флаг Копия
	НовыйЭлементЯвляетсяКопией = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементЯвляетсяКопией.Использование = Истина;

	НовыйЭлементЯвляетсяКопией.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ГруппаОтбораЯвляетсяКопией = НовыйЭлементЯвляетсяКопией.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораЯвляетсяКопией.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлементаЯвляетсяКопией = ГруппаОтбораЯвляетсяКопией.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаЯвляетсяКопией.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Файлы.ЭтоДокумент");
	ОтборЭлементаЯвляетсяКопией.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаЯвляетсяКопией.ПравоеЗначение = Истина;

	ОтборЭлементаЯвляетсяКопией = ГруппаОтбораЯвляетсяКопией.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаЯвляетсяКопией.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Файлы.ЭтоРольФайла");
	ОтборЭлементаЯвляетсяКопией.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаЯвляетсяКопией.ПравоеЗначение = Истина;

	ОтборЭлементаЯвляетсяКопией = ГруппаОтбораЯвляетсяКопией.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаЯвляетсяКопией.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Файлы.ЭтоДокументЭДО");
	ОтборЭлементаЯвляетсяКопией.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаЯвляетсяКопией.ПравоеЗначение = Истина;

	ОтборЭлементаЯвляетсяКопией = ГруппаОтбораЯвляетсяКопией.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаЯвляетсяКопией.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Файлы.УВМ_ЕстьКопия");
	ОтборЭлементаЯвляетсяКопией.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаЯвляетсяКопией.ПравоеЗначение = Ложь;

	ПолеОформленияЯвляетсяКопией = НовыйЭлементЯвляетсяКопией.Поля.Элементы.Добавить();
	ПолеОформленияЯвляетсяКопией.Поле = Новый ПолеКомпоновкиДанных("УВМ_ЯвляетсяКопией");
	ПолеОформленияЯвляетсяКопией.Использование = Истина;

КонецПроцедуры
//--dar 16.04.26 (323545)

//++dar 22.04.26 (324174)
&НаСервере
Процедура УВМ_РеквизитыДоговораАрендыНаСервере();
	
	ШрифтДекорации = Новый Шрифт("Arial", 10, Истина, Ложь, Ложь, Ложь);
	ЦветТекстаДекорации = Новый Цвет(51, 153, 102);
	
	ОбщаяВидимостьРеквизитов = (Объект.УВМ_ВариантДоговора = Перечисления.УВМ_ВариантыДоговоров.ДоговорАрендыОфиса)
									ИЛИ (Объект.УВМ_ВариантДоговора = Перечисления.УВМ_ВариантыДоговоров.ДоговорАрендыСкладскихПомещений);
	
	СвойстваОбщие = Новый Структура;
	СвойстваОбщие.Вставить("Видимость", ОбщаяВидимостьРеквизитов);
	СвойстваОбщие.Вставить("АвтоОтметкаНезаполненного", Истина);
	
	СвойстваАрендаОфиса = Новый Структура;
	СвойстваАрендаОфиса.Вставить("Видимость", Объект.УВМ_ВариантДоговора = Перечисления.УВМ_ВариантыДоговоров.ДоговорАрендыОфиса);
	СвойстваАрендаОфиса.Вставить("АвтоОтметкаНезаполненного", Истина);
	
	СвойстваАрендаСкладскихПомещений = Новый Структура;
	СвойстваАрендаСкладскихПомещений.Вставить("Видимость", Объект.УВМ_ВариантДоговора = Перечисления.УВМ_ВариантыДоговоров.ДоговорАрендыСкладскихПомещений);
	СвойстваАрендаСкладскихПомещений.Вставить("АвтоОтметкаНезаполненного", Истина);

	УВМ_ГруппаРеквизитыДоговораАренды = УВМ_РаботаСФормами.НоваяСтраница(ЭтотОбъект, "УВМ_ГруппаРеквизитыДоговораАренды", Элементы.ГруппаСтраницы, "Реквизиты договора аренды", 1, , , , Элементы.ГруппаКонтрагенты);
	УВМ_ГруппаРеквизитыДоговораАренды.Видимость = ОбщаяВидимостьРеквизитов;
		
	// Раздел "Данные объекта"
	УВМ_ДанныеОбъекта = УВМ_РаботаСФормами.НоваяДекорацияНадпись(ЭтотОбъект, "УВМ_ДанныеОбъекта", УВМ_ГруппаРеквизитыДоговораАренды, "Данные объекта");
	УВМ_ДанныеОбъекта.Шрифт = ШрифтДекорации;
	УВМ_ДанныеОбъекта.ЦветТекста = ЦветТекстаДекорации;
	УВМ_ДанныеОбъекта.Видимость = ОбщаяВидимостьРеквизитов;
	
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ПлощадьНежилогоПомещения", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваОбщие);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ПлощадьЗдания", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваОбщие);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ЭтажЗдания", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваАрендаОфиса);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_КадастровыйНомерЗдания", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваОбщие);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_КадастровыйНомерУчастка", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваАрендаСкладскихПомещений);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_АдресОбъекта", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваОбщие);
		
	// Раздел "Дополнительные данные"
	УВМ_ДопДанные = УВМ_РаботаСФормами.НоваяДекорацияНадпись(ЭтотОбъект, "УВМ_ДопДанные", УВМ_ГруппаРеквизитыДоговораАренды, "Дополнительные данные");
	УВМ_ДопДанные.Шрифт = ШрифтДекорации;
	УВМ_ДопДанные.ЦветТекста = ЦветТекстаДекорации;
	УВМ_ДопДанные.Видимость = ОбщаяВидимостьРеквизитов;
	
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ПередаваемоеОборудование", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваАрендаСкладскихПомещений);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ОснованиеПраваСобственности", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваОбщие);
		
	// Раздел "Сроки аренды"
	УВМ_СрокиАренды = УВМ_РаботаСФормами.НоваяДекорацияНадпись(ЭтотОбъект, "УВМ_СрокиАренды", УВМ_ГруппаРеквизитыДоговораАренды, "Сроки аренды");
	УВМ_СрокиАренды.Шрифт = ШрифтДекорации;
	УВМ_СрокиАренды.ЦветТекста = ЦветТекстаДекорации;
	УВМ_СрокиАренды.Видимость = ОбщаяВидимостьРеквизитов;
		
	СвойстваРастягиватьПоГоризонтали = Новый Структура("РастягиватьПоГоризонтали, Видимость, АвтоОтметкаНезаполненного", Истина, ОбщаяВидимостьРеквизитов, Истина);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_СрокПередачиОбъектаАрендодателем", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваРастягиватьПоГоризонтали);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_СрокПринятияОбъектаАрендатором", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваРастягиватьПоГоризонтали);
		
	// Раздел "Оплата"
	УВМ_Оплата = УВМ_РаботаСФормами.НоваяДекорацияНадпись(ЭтотОбъект, "УВМ_Оплата", УВМ_ГруппаРеквизитыДоговораАренды, "Оплата");
	УВМ_Оплата.Шрифт = ШрифтДекорации;
	УВМ_Оплата.ЦветТекста = ЦветТекстаДекорации;
	УВМ_Оплата.Видимость = ОбщаяВидимостьРеквизитов;
		
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ЕжемесячнаяПостояннаяЧастьАренднойПлаты", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваОбщие);
	//++dar 01.06.26 (330575)
	//УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_НДСВСоставеАренднойПлаты", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваОбщие);
	СвойстваНДСВСоставеАренднойПлаты = Новый Структура("Видимость, АвтоОтметкаНезаполненного, РежимВыбораИзСписка", ОбщаяВидимостьРеквизитов, Истина, Истина);
	УВМ_НДСВСоставеАренднойПлаты = УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_НДСВСоставеАренднойПлаты", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваНДСВСоставеАренднойПлаты);
	УВМ_НДСВСоставеАренднойПлаты.СписокВыбора.Очистить();
	ЗаполнитьСписокСтавокНДС(УВМ_НДСВСоставеАренднойПлаты);
	//--dar 01.06.26 (330575)
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_АренднаяПлатаЗаПользованиеОборудованием", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , СвойстваАрендаСкладскихПомещений);
		
	// Раздел "Акт приема-передачи"
	УВМ_АктПриемаПередачи = УВМ_РаботаСФормами.НоваяДекорацияНадпись(ЭтотОбъект, "УВМ_АктПриемаПередачи", УВМ_ГруппаРеквизитыДоговораАренды, "Акт приема-передачи");
	УВМ_АктПриемаПередачи.Шрифт = ШрифтДекорации;
	УВМ_АктПриемаПередачи.ЦветТекста = ЦветТекстаДекорации;
	УВМ_АктПриемаПередачи.Видимость = ОбщаяВидимостьРеквизитов;
		
	ВысотаЗаголовка2 = Новый Структура("ВысотаЗаголовка, Видимость, АвтоОтметкаНезаполненного", 2, ОбщаяВидимостьРеквизитов, Истина);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ОснащениеИмущества", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , ВысотаЗаголовка2);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ДополнительноПереданныеДокументыИПредметы", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , ВысотаЗаголовка2);
	УВМ_РаботаСФормами.НовоеПоле(ЭтотОбъект, "УВМ_ПоказанияПриборовУчётаНаМоментПередачи", УВМ_ГруппаРеквизитыДоговораАренды, Истина, , , , ВысотаЗаголовка2);

	//++dar 29.04.26 (326008)
	Элементы.СтороныНаименование.РежимВыбораИзСписка = Истина;
	Элементы.СтороныНаименование.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(Объект.УВМ_ВариантДоговора) Тогда
		МассивСторон = УВМ_ПовтИсп.НаименованияСторонПоТипуДокумента(Объект.УВМ_ВариантДоговора);
		Для Каждого ТекСторона Из МассивСторон Цикл
			Элементы.СтороныНаименование.СписокВыбора.Добавить(ТекСторона);   
		КонецЦикла;
		
		Для Каждого ТекСторона Из Объект.Стороны Цикл
			Если МассивСторон.Найти(ТекСторона.Наименование) = Неопределено Тогда
				ТекСторона.Наименование = Неопределено;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//--dar 29.04.26 (326008)
	
КонецПроцедуры
//--dar 22.04.26 (324174)

&НаСервере
&Перед("ПриЧтенииНаСервере")
Процедура АБ_ПриЧтенииНаСервере(ТекущийОбъект)
	//++dar 25.11.25 (296038)                                                                      
	УВМ_ДобавитьКомандыНаФорму();
	//--dar 25.11.25 (296038)
КонецПроцедуры

//++dar 25.11.25 (296038)                                                                      
&НаСервере
Процедура УВМ_ДобавитьКомандыНаФорму()
	
	Если Элементы.Найти("УВМ_ДействияОтправить") = Неопределено Тогда
		УВМ_РаботаСФормами.НоваяКомандаНаФорме(ЭтотОбъект, "УВМ_ДействияОтправить", Элементы.ГруппаОсновнаяКомПанель, "Начать обработку", БиблиотекаКартинок.СформироватьОтчет,
												1, Новый Структура("Отображение", ОтображениеКнопки.КартинкаИТекст), Элементы.Зарегистрировать);
	КонецЕсли;
	
	Если Элементы.Найти("УВМ_ДействияОстановить") = Неопределено Тогда
		УВМ_РаботаСФормами.НоваяКомандаНаФорме(ЭтотОбъект, "УВМ_ДействияОстановить", Элементы.ГруппаОсновнаяКомПанель, "Остановить", БиблиотекаКартинок["ЗнакПауза"],
												1, Новый Структура("Отображение, Видимость", ОтображениеКнопки.Картинка, Ложь), Элементы.Зарегистрировать);
	КонецЕсли;
	
	// +++ Миляев 2026-02-11 (295800) #УВМ
	ГруппаКомандСтороны = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтаФорма,"УВМ_СтороныДействия",Элементы.ГруппаСтороны,
		,2,,,Новый Структура("Видимость,ГоризонтальноеПоложениеВГруппе", Истина,ГоризонтальноеПоложениеЭлемента.Право));
	УВМ_РаботаСФормами.НоваяКомандаНаФорме(ЭтаФорма, "УВМ_ДействующиеДоговорыКоманда", ГруппаКомандСтороны, "Действующие договоры с контрагентом", 
		,2,Новый Структура("Видимость", Ложь));
	УВМ_ОбновитьВидимостьОформление();	
	// --- Миляев 2026-02-11 (295800) #УВМ

	//++dar 02.06.26 (330921)
	Если Элементы.Найти("УВМ_ОтправитьКонтрагенту") = Неопределено Тогда
		УВМ_РаботаСФормами.НоваяКомандаНаФорме(ЭтотОбъект, "УВМ_ОтправитьКонтрагенту",
		Элементы.ГруппаОсновнаяКомПанель, "Отправить контрагенту",
		БиблиотекаКартинок.ОтправитьEmail, 1,
		Новый Структура("Отображение", ОтображениеКнопки.КартинкаИТекст));
	КонецЕсли;
	//--dar 02.06.26 (330921)

КонецПроцедуры
//--dar 25.11.25 (296038)                                                                      

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура АБ_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//++dar 29.04.26 (326008)
	ЕстьОригиналИлиКопия = Ложь;
	Для Каждого Строка Из Файлы.ПолучитьЭлементы() Цикл			
		Если Не Строка.ЭтоРольФайла И Не Строка.ЭтоДокументЭДО Тогда
			Если Строка.Оригинал ИЛИ Строка.УВМ_ЯвляетсяКопией Тогда
				ЕстьОригиналИлиКопия = Истина;
				Прервать;
			КонецЕсли;
			
		Иначе
			Для Каждого Подстрока Из Строка.ПолучитьЭлементы() Цикл
				Если Подстрока.Оригинал ИЛИ Подстрока.УВМ_ЯвляетсяКопией Тогда
					ЕстьОригиналИлиКопия = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьОригиналИлиКопия Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущаяСторона Из ТекущийОбъект.Стороны Цикл
		ТекущаяСторона.Подписан = ЕстьОригиналИлиКопия;
	КонецЦикла;
	//--dar 29.04.26 (326008)
КонецПроцедуры

#КонецОбласти

#Область ПриИзмененииРеквизитов

//++dar 18.03.26 (317077)
&НаСервере
Процедура УстановитьСвойстваЭлементовНалогообложенияИРаздельногоУчетаНДС(ТипДоговора)
	
	Элементы.УВМ_ВидАгентскогоДоговора.Видимость = ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком;
	
	Элементы.УВМ_НалогообложениеНДС.Доступность     = НЕ Объект.УВМ_НалогообложениеНДСОпределяетсяВДокументе;
	Элементы.УВМ_ВидАгентскогоДоговора.Доступность = (Объект.УВМ_НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС);
	Элементы.УВМ_СтавкаНДС.Доступность = Объект.УВМ_НалогообложениеНДСОпределяетсяВДокументе 
									ИЛИ (Объект.УВМ_НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
									ИЛИ (Объект.УВМ_НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН);
	
	Элементы.ГруппаНалогообложениеНДС.Видимость = 
		НЕ (ТипДоговора = Перечисления.ТипыДоговоров.ПустаяСсылка()
			ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.Импорт
			//++ Устарело_Переработка24
			ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком
			//-- Устарело_Переработка24
			ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком2_5_ЕАЭС
			ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.ВвозИзЕАЭС
			Или ТипДоговора = Перечисления.ТипыДоговоров.РеализацияЧерезКомиссионера);
	
КонецПроцедуры
//++dar 18.03.26 (317077)

//++dar 29.04.26 (326008)
&НаКлиенте
Процедура УВМ_СтороныНаименованиеНачалоВыбора(Элемент)
	Если Элементы.СтороныНаименование.СписокВыбора.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле 'Тип договора'", , "УВМ_ВариантДоговора", "Объект");
	КонецЕсли;	
КонецПроцедуры
//--dar 29.04.26 (326008)

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтороны
 &НаКлиенте
&После("СтороныПриИзменении")
Процедура АБ_СтороныПриИзменении(Элемент)
	// +++ Миляев (295800) 2026-02-11
	УВМ_ОбновитьВидимостьОформление();
	// --- Миляев (295800) 2026-02-11
	// +++ Миляев (293293) 2026-02-24
	УВМ_ТЧСтороныУказатьПодписавшего(Элементы.Стороны.ТекущаяСтрока);
	УВМ_ТЧСтороныУказатьОснованиеСтроки(Элементы.Стороны.ТекущаяСтрока);
	// --- Миляев (293293) 2026-02-24

КонецПроцедуры

&НаКлиенте
&После("СтороныПриОкончанииРедактирования")
Процедура АБ_СтороныПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// +++ Миляев (295800) 2026-02-11  
	Если не ОтменаРедактирования тогда
		УВМ_ОбновитьВидимостьОформление();
	КонецЕсли;
	// --- Миляев (295800) 2026-02-11
	// +++ Миляев (293293) 2026-02-24
	Если не ОтменаРедактирования тогда
		УВМ_ТЧСтороныУказатьПодписавшего(Элементы.Стороны.ТекущаяСтрока);
		УВМ_ТЧСтороныУказатьОснованиеСтроки(Элементы.Стороны.ТекущаяСтрока);
	КонецЕсли;
	// --- Миляев (293293) 2026-02-24
	
	//++dar 01.06.26 (330575)
	ОбновитьКонтрагентаДляЗаполненияНаСервере();
	//--dar 01.06.26 (330575)

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СтороныСторонаОбработкаВыбора")
Процедура АБ_СтороныСторонаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.Стороны.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Организации") Тогда

		ТекущиеДанные.Сторона = ВыбранноеЗначение;
		ТекущиеДанные.КонтактноеЛицо = ПользователиПустаяСсылка;
		ТекущиеДанные.Подписал = "";

	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда

		ТекущиеДанные.Сторона = ВыбранноеЗначение;
		ОсновноеКонтактноеЛицо = РаботаСКонтрагентамиВызовСервера.ОсновноеКонтактноеЛицоКонтрагента(
		ВыбранноеЗначение);
		ТекущиеДанные.КонтактноеЛицо = ОсновноеКонтактноеЛицо;
		ТекущиеДанные.Подписал = "";

		ДокументыПредприятияКлиентЛокализация.СтороныСторонаОбработкаВыбораФормаЭлемента(ЭтотОбъект, 
		ТекущиеДанные.Сторона, Элементы.Стороны);
		#Вставка
		//++dar 19.02.26 (309302)
		ТекущиеДанные.УВМ_Почта = УВМ_ПочтыКонтрагентаИКонтактногоЛица(ВыбранноеЗначение, ОсновноеКонтактноеЛицо, "");
		//--dar 19.02.26 (309302)
		#КонецВставки

	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда

		Если Не ЗначениеЗаполнено(ТекущиеДанные.Сторона)
			Или (ЗначениеЗаполнено(ТекущиеДанные.Сторона) И ТипЗнч(ТекущиеДанные.Сторона) = Тип("СправочникСсылка.Контрагенты")) Тогда
			ТекущиеДанные.Сторона = РаботаСОрганизациями.ОрганизацияПоУмолчанию();
		КонецЕсли;

		ТекущиеДанные.КонтактноеЛицо = ВыбранноеЗначение;

	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КонтактныеЛица") Тогда

		Контрагент = ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Владелец");
		ТекущиеДанные.Сторона = Контрагент;
		ТекущиеДанные.КонтактноеЛицо = ВыбранноеЗначение;

		ДокументыПредприятияКлиентЛокализация.СтороныСторонаОбработкаВыбораФормаЭлемента(ЭтотОбъект, 
		ТекущиеДанные.Сторона, Элементы.Стороны);
		#Вставка
		//++dar 19.02.26 (309302)
		ТекущиеДанные.УВМ_Почта = УВМ_ПочтыКонтрагентаИКонтактногоЛица(Контрагент, ВыбранноеЗначение, "");
		//--dar 19.02.26 (309302)
		#КонецВставки
	КонецЕсли;

	Модифицированность = Истина;
	СкопироватьКонтрагентаИОрганизациюВРеквизиты();
	УстановитьПараметрыТаблицыСтороны(ТекущиеДанные);    

	// Локализация 
	ПриИзмененииВерифицируемогоРеквизитаТЧ("Сторона", "Объект.Стороны", ТекущиеДанные);  
	// Конец Локализация

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СтороныКонтактноеЛицоОбработкаВыбора")
Процедура АБ_СтороныКонтактноеЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.Стороны.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	

	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда

		Если Не ЗначениеЗаполнено(ТекущиеДанные.Сторона)
			ИЛИ (ЗначениеЗаполнено(ТекущиеДанные.Сторона) И ТипЗнч(ТекущиеДанные.Сторона) = Тип("СправочникСсылка.Контрагенты")) Тогда
			ТекущиеДанные.Сторона = РаботаСОрганизациями.ОрганизацияПоУмолчанию();
		КонецЕсли;	
		ТекущиеДанные.КонтактноеЛицо = ВыбранноеЗначение;

	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КонтактныеЛица") Тогда

		Контрагент = ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Владелец");
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Сторона)
			ИЛИ Контрагент <> ТекущиеДанные.Сторона Тогда
			ТекущиеДанные.Сторона = Контрагент;
		КонецЕсли;
		ТекущиеДанные.КонтактноеЛицо = ВыбранноеЗначение;
		#Вставка
		//++dar 19.02.26 (309302)
		ТекущиеДанные.УВМ_Почта = УВМ_ПочтыКонтрагентаИКонтактногоЛица(Контрагент, ВыбранноеЗначение, ТекущиеДанные.УВМ_Почта);
		//--dar 19.02.26 (309302)
		#КонецВставки

	КонецЕсли;

	Модифицированность = Истина;

	УстановитьПараметрыТаблицыСтороны(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СтороныСторонаНачалоВыбора")
Процедура АБ_СтороныСторонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Стороны.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	// По организациям работает быстрый выбор.
	Если ТипЗнч(ТекущиеДанные.Сторона) = Тип("СправочникСсылка.Организации") Тогда 
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимРаботыФормы", 1);
	ПараметрыФормы.Вставить("УпрощенныйИнтерфейс", Истина);
	Если ТекущиеДанные.НомерСтроки > 1 Тогда
		ПараметрыФормы.Вставить("ОтображатьКонтрагентов", Истина);
		ПараметрыФормы.Вставить("ВыбиратьКонтрагентов", Истина);
	КонецЕсли;
	ПараметрыФормы.Вставить("ОтображатьОрганизации", Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Выбор стороны'"));

	Если ЗначениеЗаполнено(ТекущиеДанные.Сторона) Тогда
		ПараметрыФормы.Вставить("ВыбранныеАдресаты", ТекущиеДанные.Сторона);
	КонецЕсли;
	#Вставка
	//++dar 04.05.26 (326149)
	ПараметрыФормы.Вставить("УВМ_ОткрытаИзДокумента", Истина);
	ПараметрыФормы.Вставить("УВМ_ТипКонтрагента", ЭтотОбъект.УВМ_ТипКонтрагента);
	//--dar 04.05.26 (326149)
	#КонецВставки

	ОткрытьФорму("Справочник.АдреснаяКнига.Форма.ФормаСписка",
	ПараметрыФормы,
	Элементы.СтороныСторона,,,,,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
#КонецОбласти //ОбработчикиСобытийЭлементовТаблицыФормыСтороны

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
&После("ВидИТематикаТекстПриИзменении")
Процедура АБ_ВидИТематикаТекстПриИзменении(Элемент)	
	// +++ Миляев (295800) 2026-02-11
	УВМ_ОбновитьВидимостьОформление();
	// --- Миляев (295800) 2026-02-11
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПолеHTMLПриНажатии")
Процедура АБ_ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда 
		Возврат;
	КонецЕсли;	

	Если Найти(ДанныеСобытия.Href, "goods") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТовары;
		Возврат;

	ИначеЕсли Найти(ДанныеСобытия.Href, "ShowLinks") Тогда

		ОбзорСпискаДокументовКлиент.ПоказатьСвязи(ДанныеСобытия.Href);

		Возврат;

	ИначеЕсли Найти(ДанныеСобытия.Href, "v8doc:status") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОбработка;
		ПриПереключенииНаСтраницуОбработка();
		Возврат;

	ИначеЕсли Найти(ДанныеСобытия.Href, "OpenForEdit") Тогда

		ТекущиеДанные = ТекущиеДанныеСпискаФайлов();
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиФайл = ТекущиеДанные.Ссылка;
			РедактируетТекущийПользователь = ТекущиеДанные.РедактируетТекущийПользователь;

			Если Не РедактируетТекущийПользователь 
				Или ДанныеСобытия.Anchor = Неопределено Тогда

				Возврат;

			КонецЕсли;

			КомандыРаботыСФайламиКлиент.Редактировать(ТекущиФайл);
			ОповеститьОбИзменении(КлючЗаписи);
		КонецЕсли;
		Возврат;

	ИначеЕсли Найти(ДанныеСобытия.Href, "OpenForView") Тогда

		ТекущийФайл = Неопределено;

		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСвязи Тогда

			ТекущиеДанные = Элементы.ДеревоСвязей.ТекущиеДанные;

			Если ТекущиеДанные <> Неопределено Тогда
				ТекущийФайл = ТекущиеДанные.Файл;
			КонецЕсли;

		Иначе	

			ТекущиеДанные = ТекущиеДанныеСпискаФайлов();
			Если ТекущиеДанные <> Неопределено Тогда
				ТекущийФайл = ТекущиеДанные.Ссылка;
			КонецЕсли;	

		КонецЕсли;

		Если ЗначениеЗаполнено(ТекущийФайл) Тогда

			Если ДанныеСобытия.Anchor = Неопределено Тогда

				Возврат;

			КонецЕсли;

			РаботаСФайламиКлиент.ОткрытьФайлДокумента(ТекущийФайл, ЭтаФорма);
		КонецЕсли;

		Возврат;

	ИначеЕсли Найти(ДанныеСобытия.Href, "CreatePreview") Тогда       

		Если Элемент = Элементы.ПредставлениеHTML Тогда

			ТекущиеДанные = ТекущиеДанныеСпискаФайлов();
			Если ТекущиеДанные <> Неопределено Тогда      

				ТекущийФайл = ТекущиеДанные.Ссылка;

				ДокументPDF = Неопределено;

				ПараметрыHTMLПредставление = ОбзорФайловКлиентСервер.СтруктураПараметровHTMLПредставлениеФайла();
				ПараметрыHTMLПредставление.МаксимальноеЧислоСтраницДляПредпросмотра = МаксимальноеЧислоСтраницДляПредпросмотра;
				ПараметрыHTMLПредставление.Расширение = ТекущиеДанные.Расширение;
				ПараметрыHTMLПредставление.Размер = 0;
				ПараметрыHTMLПредставление.УникальныйИдентификатор = УникальныйИдентификатор;
				ПараметрыHTMLПредставление.ИгнорироватьМаксРазмер = Истина;

				ДанныеОбзора = ОбзорФайловКлиент.HTMLПредставлениеФайла(
				ТекущийФайл,
				ПараметрыHTMLПредставление,
				ДокументPDF);

				ОбзорФайловКлиент.ЗаполнитьРеквизитыОбзора(ДанныеОбзора, ПредставлениеHTML, ТаймлистАвтопротоколHTML,
				РаспознанныйТекстHTML);

				Элементы.ГруппаПредпросмотрУрезан.Видимость = ПараметрыHTMLПредставление.ПредпросмотрУрезан;

			КонецЕсли;

		ИначеЕсли Элемент = Элементы.СвязиПредставлениеHTML Тогда	 

			ТекущиеДанные = Элементы.ДеревоСвязей.ТекущиеДанные;

			Если ТекущиеДанные <> Неопределено Тогда

				ТекущийФайл = ТекущиеДанные.Файл;
				ТекущийДокумент = ТекущиеДанные.СвязанныйОбъект;

				Если ЗначениеЗаполнено(ТекущийФайл) Тогда

					ДокументPDF = Неопределено;

					ПараметрыHTMLПредставление = ОбзорФайловКлиентСервер.СтруктураПараметровHTMLПредставлениеФайла();  
					ПараметрыHTMLПредставление.МаксимальноеЧислоСтраницДляПредпросмотра = МаксимальноеЧислоСтраницДляПредпросмотра;
					ПараметрыHTMLПредставление.Расширение = ТекущиеДанные.РасширениеФайла;
					ПараметрыHTMLПредставление.Размер = ТекущиеДанные.Размер;
					ПараметрыHTMLПредставление.УникальныйИдентификатор = УникальныйИдентификатор;
					ПараметрыHTMLПредставление.ПредпросмотрОфисныхФайлов = ПредпросмотрОфисныхФайлов; 
					ПараметрыHTMLПредставление.ИгнорироватьМаксРазмер = Истина; // это важно

					ДанныеОбзора = ОбзорФайловКлиент.HTMLПредставлениеФайла(
					ТекущийФайл,
					ПараметрыHTMLПредставление,
					ДокументPDF);

					ОбзорФайловКлиент.ЗаполнитьРеквизитыОбзора(ДанныеОбзора, ПредставлениеHTMLСвязи);

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		Возврат;

	ИначеЕсли Найти(ДанныеСобытия.Href, "ShowInReplyTo") Тогда

		РаботаС_HTMLКлиент.ОткрытьСсылку(Элемент, ДанныеСобытия, СтандартнаяОбработка, ЭтотОбъект);
		Возврат;

	ИначеЕсли СтрНайти(ДанныеСобытия.Href, "files/TimelistEditTranscript") Тогда

		ОткрытьРедакторТекстовыхДанныхТаймлист(ТаймлистКлиентСервер.КлючОтображенияРасшифровкиHTML());
		Возврат;

	ИначеЕсли СтрНайти(ДанныеСобытия.Href, "GetAutoprotocol") Тогда

		РаботаС_HTMLКлиент.ОткрытьСсылку(Элемент, ДанныеСобытия, СтандартнаяОбработка, ЭтотОбъект);
		Возврат;

	ИначеЕсли СтрНайти(ДанныеСобытия.Href, "https://timelist.ru/1CDO") Тогда

		РаботаС_HTMLКлиент.ОткрытьСсылку(Элемент, ДанныеСобытия, СтандартнаяОбработка, ЭтотОбъект);
		Возврат;

	ИначеЕсли ДокументыПредприятияКлиентЛокализация.ОбработатьНажатиеПоляHTMLФормаЭлемента(ЭтотОбъект, 
		Элемент, ДанныеСобытия, СтандартнаяОбработка) Тогда

		ДокументыПредприятияКлиентЛокализация.ПолеHTMLПриНажатииФормаЭлемента(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
		Возврат;
	#Вставка
	// +++ Миляев (295800) 2026-01-23
	ИначеЕсли СтрНачинаетсяС(ДанныеСобытия.Href, "http") или СтрНачинаетсяС(ДанныеСобытия.Href,"e1c://server/") Тогда
		РаботаС_HTMLКлиент.ОткрытьСсылку(Элемент, ДанныеСобытия, СтандартнаяОбработка, ЭтотОбъект);
		Возврат;
	// --- Миляев (295800) 2026-01-23
	#КонецВставки
	ИначеЕсли Лев(ДанныеСобытия.Href, 6) <> "v8doc:" Тогда 
		Возврат;

	КонецЕсли;

	НавигационнаяСсылкаПоля = Сред(ДанныеСобытия.Href, 7);
	ПараметрыНажатия = Новый Структура;
	ПараметрыНажатия.Вставить("ТекущийПользователь", ТекущийПользователь);
	ПараметрыНажатия.Вставить("СрокДействияДокументИсточникИзменения", СрокДействияДокументИсточникИзменения);
	ПараметрыНажатия.Вставить("СрокДействияКомментарий", СрокДействияКомментарий);

	ЭлементСрокДействия = Элементы.Найти("СрокДействияСтрока");
	Если ЭлементСрокДействия <> Неопределено Тогда
		ПараметрыНажатия.Вставить("НеИзменятьСрокДействия", 
		ТолькоПросмотр Или Элементы.СрокДействияСтрока.ТолькоПросмотр);
	КонецЕсли;

	ПараметрыНажатия.Вставить("Элемент", Элемент);
	ПараметрыНажатия.Вставить("ЭтаФорма", ЭтаФорма);
	ПараметрыНажатия.Вставить("МестоХранения", МестоХранения);
	ПараметрыНажатия.Вставить("ЗапретитьРучноеИзменениеСостоянияДокументов",
	ЗапретитьРучноеИзменениеСостоянияДокументов);

	ДелопроизводствоКлиент.ОбработатьНажатиеНаПолеОбзор(Объект, НавигационнаяСсылкаПоля, ПараметрыНажатия); 

КонецПроцедуры

//++dar 17.02.26 (309302)
&НаКлиенте
Процедура УВМ_БессрочныйПриИзменении(Элемент)
	Если Объект.Бессрочный Тогда
		Объект.ДатаОкончанияДействия = '00010101';
		Объект.ПорядокПродления = Неопределено;
	КонецЕсли;
	
	УВМ_ОбновитьСвойстваЭлементовФормыСрокДействия();
КонецПроцедуры

&НаСервере
Процедура УВМ_ОбновитьСвойстваЭлементовФормыСрокДействия()
	
	Если Объект.Бессрочный Тогда
		Элементы.ДатаОкончанияДействия.Доступность = Ложь;
		Элементы.ДатаОкончанияДействия.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ПорядокПродления.Доступность = Ложь;
		Элементы.ПорядокПродления.АвтоОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ДатаОкончанияДействия.Доступность = Истина;
		Элементы.ДатаОкончанияДействия.АвтоОтметкаНезаполненного = Истина;
		Элементы.ПорядокПродления.Доступность = Истина;
		Элементы.ПорядокПродления.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры
//--dar 17.02.26 (309302)

//++dar 18.03.26 (317077)
&НаКлиенте
Процедура РежимНалогообложенияПриИзменении(Элемент)
	
	РежимНалогообложенияПриИзмененииСервер();

КонецПроцедуры

&НаСервере
Процедура РежимНалогообложенияПриИзмененииСервер()
	
	Объект.УВМ_НалогообложениеНДСОпределяетсяВДокументе = ?(ЭтотОбъект.РежимНалогообложения = 1, Истина, Ложь);
	
	УВМ_УстановитьСписокВыбораНалогообложенияНДС();
	
	УстановитьСвойстваЭлементовНалогообложенияИРаздельногоУчетаНДС(ЭтотОбъект.ТипДоговораЕРП);	
	
КонецПроцедуры

&НаСервере
Процедура УВМ_УстановитьСписокВыбораНалогообложенияНДС()
	
	Если Объект.УВМ_НалогообложениеНДСОпределяетсяВДокументе Тогда
		Объект.УВМ_НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Очистить();
	
	Если ЭтотОбъект.ТипДоговораЕРП = Перечисления.ТипыДоговоров.СПокупателем Тогда//Реализация
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС, "Продажа облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, "Продажа не облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт, "Экспорт");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя, "Облагается НДС у покупателя");
		
	ИначеЕсли ЭтотОбъект.ТипДоговораЕРП = Перечисления.ТипыДоговоров.СПоставщиком Тогда//Закупка
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС, "Закупка облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, "Закупка не облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС, "Налоговый агент по НДС");
		
	ИначеЕсли ЭтотОбъект.ТипДоговораЕРП = Перечисления.ТипыДоговоров.ВвозИзЕАЭС Тогда//Закупка (ЕАЭС)
		
	ИначеЕсли ЭтотОбъект.ТипДоговораЕРП = Перечисления.ТипыДоговоров.СПереработчиком2_5 Тогда//Передача в переработку
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС, "Закупка облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, "Закупка не облагается НДС");
		
	ИначеЕсли ЭтотОбъект.ТипДоговораЕРП = Перечисления.ТипыДоговоров.СХранителем Тогда//Передача на ответственное хранение
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС, "Продажа облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, "Продажа не облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя, "Облагается НДС у покупателя");
		
	ИначеЕсли ЭтотОбъект.ТипДоговораЕРП = Перечисления.ТипыДоговоров.СДавальцем2_5 Тогда//Прием в переработку
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС, "Продажа облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, "Продажа не облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт, "Экспорт");
		
	ИначеЕсли ЭтотОбъект.ТипДоговораЕРП = Перечисления.ТипыДоговоров.СПоклажедателем Тогда//Прием на ответственное хранение
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС, "Закупка облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, "Закупка не облагается НДС");
		Элементы.УВМ_НалогообложениеНДС.СписокВыбора.Добавить(Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС, "Налоговый агент по НДС");

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНДСПриИзменении(Элемент)
	
	НалогообложениеНДСПриИзмененииСервер();
	
	ПересчитатьСуммуНДС();

КонецПроцедуры

&НаСервере
Процедура НалогообложениеНДСПриИзмененииСервер()
	УстановитьСвойстваЭлементовНалогообложенияИРаздельногоУчетаНДС(ЭтотОбъект.ТипДоговораЕРП);
	
	Если Объект.УВМ_НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС
		ИЛИ Объект.УВМ_НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя
		ИЛИ Объект.УВМ_НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС Тогда
		Объект.УВМ_СтавкаНДС = Справочники.СтавкиНДС.БезНДС;                                            
		
	ИначеЕсли Объект.УВМ_НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт Тогда
		Объект.УВМ_СтавкаНДС = Справочники.СтавкиНДС.НДС0;                                            
		
	КонецЕсли;

КонецПроцедуры
//--dar 18.03.26 (317077)

//++dar 30.04.26 (326008)
&НаКлиенте
Процедура УВМ_СтавкаНДСПриИзменении(Элемент)
	ПересчитатьСуммуНДС();
КонецПроцедуры

&НаКлиенте
&После("СуммаПриИзменении")
Процедура АБ_СуммаПриИзменении(Элемент)
	ПересчитатьСуммуНДС();
КонецПроцедуры
//--dar 30.04.26 (326008)

//++dar 23.04.26 (324174)
&НаКлиенте
Процедура УВМ_ВариантДоговораПриИзменении(Элемент)
	УВМ_РеквизитыДоговораАрендыНаСервере();
КонецПроцедуры
//--dar 23.04.26 (324174)

#КонецОбласти //ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлы

&НаКлиенте
&ИзменениеИКонтроль("ФайлыПередНачаломДобавленияКлиент")
Процедура АБ_ФайлыПередНачаломДобавленияКлиент(Элемент, Отказ, Копирование, Родитель, Группа, ПараметрыДобавления)

	ДобавлениеОригинала = ПараметрыДобавления.Свойство("ДобавлениеОригинала", ДобавлениеОригинала);

	РольФайла = Неопределено;
	ПараметрыДобавления.Свойство("РольФайла", РольФайла);

	Если ВестиУчетСканКопийОригиналовДокументов 
		И ТипЗнч(ДоступныеПоля) = Тип("Структура") 
		И ДоступныеПоля.Свойство("СоздатьФайлОригинал") 
		И Не ДоступныеПоля.Свойство("СоздатьФайлОбычный")
		И Не ДобавлениеОригинала Тогда

		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'В текущем состоянии ""%1"" можно добавить только скан-копию оригинала документа. Продолжить?'"),
		СостояниеТекст);

		СписокВариантовОтветов = Новый СписокЗначений;
		СписокВариантовОтветов.Добавить(Строка(КодВозвратаДиалога.Да));
		СписокВариантовОтветов.Добавить(Строка(КодВозвратаДиалога.Нет));

		ПараметрыДобавления.Вставить("ДобавлениеОригинала", ДобавлениеОригинала);

		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("Элемент", Элемент);
		ПараметрыОбработчика.Вставить("Отказ", Отказ);
		ПараметрыОбработчика.Вставить("Копирование", Копирование);
		ПараметрыОбработчика.Вставить("Родитель", Родитель);
		ПараметрыОбработчика.Вставить("Группа", Группа);
		ПараметрыОбработчика.Вставить("ПараметрыДобавления", ПараметрыДобавления);

		ОписаниеОповещения = Новый ОписаниеОповещения(
		"ФайлыПередНачаломДобавленияКлиентПродолжение",
		ЭтотОбъект,
		ПараметрыОбработчика);

		ДелопроизводствоКлиент.ПоказатьРасширеннуюФормуВопроса(ЭтаФорма,
		НСтр("ru = 'Добавление файла'"),
		Текст,
		"ДобавлениеОригинала",
		"ЗадаватьВопросПриДобавленииСканКопииОригинала",
		СписокВариантовОтветов,,
		ОписаниеОповещения);
		Возврат;

	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда 
		ПараметрыЗаписи = Новый Структура;
		Если Не Записать(ПараметрыЗаписи) Тогда 
			Возврат;
		КонецЕсли;

		ПоказатьОповещениеПользователя(
		НСтр("ru = 'Создание:'"), 
		ПолучитьНавигационнуюСсылку(Объект.Ссылка),
		Строка(Объект.Ссылка),
		БиблиотекаКартинок.Информация32);
	КонецЕсли;

	ВладелецФайла = Объект.Ссылка;

	ТекущиеДанные = ТекущиеДанныеСпискаФайлов();                                   

	Если Не ЗначениеЗаполнено(РольФайла) Тогда
		Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.РольФайла) Тогда
			РольФайла = ТекущиеДанные.РольФайла;
		ИначеЕсли Файлы.ПолучитьЭлементы().Количество() <> 0 Тогда	
			СтрФайлы = Файлы.ПолучитьЭлементы()[0];
			Если ЗначениеЗаполнено(СтрФайлы.РольФайла) Тогда
				РольФайла = СтрФайлы.РольФайла;
			КонецЕсли;		
		КонецЕсли;	
	КонецЕсли;	

	МожноДобавитьТолькоОдинФайл = Ложь;

	Если (ЗначениеЗаполнено(Объект.РегистрационныйНомер) 
		Или СостояниеОбработки = ПредопределенноеЗначение("Перечисление.СостоянияОбработкиОбъектов.Выполняется")
		Или СостояниеОбработки = ПредопределенноеЗначение("Перечисление.СостоянияОбработкиОбъектов.Остановлена"))
		И ВидДокументаКэш.РолиФайлов.Количество() <> 0 И ИспользоватьРолиФайлов Тогда

		Если ВВидеЭтаРольТолькоОдинФайл(ВидДокументаКэш.РолиФайлов, РольФайла) Тогда

			НетФайловВРоли = Ложь;
			// найдем число файлов в роли
			Если ТекущиеДанные <> Неопределено Тогда
				Если ТекущиеДанные.ЭтоРольФайла Тогда
					НетФайловВРоли = (ТекущиеДанные.ПолучитьЭлементы().Количество() = 0);
				КонецЕсли;	
			КонецЕсли;	

			Если Не НетФайловВРоли Тогда

				ПоказатьПредупреждение(, 
				СтрШаблон(НСтр("ru = 'В роли ""%1"" с признаком ""Только один файл"" уже есть файл, поэтому добавить еще один файл в эту роль нельзя.' "), РольФайла));

				РольФайла = Неопределено;

				Возврат;

			Иначе

				МожноДобавитьТолькоОдинФайл = Истина;	

			КонецЕсли;

		КонецЕсли;	

	КонецЕсли;

	Если Не Копирование Тогда
		Попытка

			РежимСоздания = ?(ДобавлениеОригинала, 2, 1);
			ДополнительныеПараметры = Новый Структура("МожноДобавитьТолькоОдинФайл", МожноДобавитьТолькоОдинФайл);
			ДополнительныеПараметры.Вставить("ДоступнаОтметкаОригинала",
			ТипЗнч(ДоступныеПоля) <> Тип("Структура")
			Или ТипЗнч(ДоступныеПоля) = Тип("Структура") И ДоступныеПоля.Свойство("СоздатьФайлОригинал"));

			#Вставка
			//++dar 06.11.25 (291274)
			ДополнительныеПараметры.ДоступнаОтметкаОригинала = Ложь;
			//--dar 06.11.25 (291274)
			#КонецВставки
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИзмененияСпискаФайлов", ЭтотОбъект);
			РаботаСФайламиКлиент.ДобавитьФайл(ОписаниеОповещения, ВладелецФайла, 
			ЭтаФорма, РежимСоздания, Истина, ДобавлениеОригинала,,,,,
			Объект.Шаблон, РольФайла, , ДополнительныеПараметры);

		Исключение
			ПоказатьПредупреждение(, ФайловыеФункцииСлужебныйКлиентСервер.ОшибкаСозданияНовогоФайла(
			ИнформацияОбОшибке()));
		КонецПопытки;
	Иначе
		ТекущиеДанные = ТекущиеДанныеСпискаФайлов();
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
		ФайлОснование = ТекущиеДанные.Ссылка;

		РаботаСФайламиКлиент.СкопироватьФайл(ВладелецФайла, ФайлОснование);
	КонецЕсли;

КонецПроцедуры

//++dar 11.03.26 (309302)
&НаКлиенте
&ИзменениеИКонтроль("ФайлыПередНачаломИзменения")
Процедура АБ_ФайлыПередНачаломИзменения(Элемент, Отказ)

	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Обзор Тогда
		ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
		Если Элементы.Файлы.ТекущийЭлемент = Элементы.Оригинал Тогда 
			Возврат;
		КонецЕсли;
		#Вставка
		//++dar 11.03.26 (309302)
		Если Элементы.Файлы.ТекущийЭлемент = Элементы.УВМ_ЯвляетсяКопией Тогда 
			Возврат;
		КонецЕсли;
		//--dar 11.03.26 (309302)
		#КонецВставки
	Иначе	
		ТекущиеДанные = Элементы.ФайлыСоздание.ТекущиеДанные;
		Если Элементы.ФайлыСоздание.ТекущийЭлемент = Элементы.ОригиналСоздание Тогда 
			Возврат;
		КонецЕсли;	
		#Вставка
		//++dar 11.03.26 (309302)
		Если Элементы.ФайлыСоздание.ТекущийЭлемент = Элементы.УВМ_ЯвляетсяКопиейСоздание Тогда 
			Возврат;
		КонецЕсли;	
		//--dar 11.03.26 (309302)
		#КонецВставки
	КонецЕсли;

	Отказ = Истина;

	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.ЭтоРольФайла Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.ЭтоДокумент Тогда
		Возврат;
	КонецЕсли;

	ОткрытьКарточкуФайлаРеализация(ТекущиеДанные.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура УВМ_ЯвляетсяКопиейПриИзменении(Элемент)
	
	ТекущиеДанные = ТекущиеДанныеСпискаФайлов();
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоРольФайла Тогда 
		ТекущиеДанные.УВМ_ЯвляетсяКопией = Не ТекущиеДанные.УВМ_ЯвляетсяКопией;
		ПоказатьПредупреждение(, НСтр("ru = 'Нельзя отметить как копию роль файла.'"));
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.СозданИзШаблона Тогда 
		ТекущиеДанные.УВМ_ЯвляетсяКопией = Не ТекущиеДанные.УВМ_ЯвляетсяКопией;
		ПоказатьПредупреждение(, НСтр("ru = 'Нельзя отметить как копию файл, созданный из шаблона.'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"УВМ_ЯвляетсяКопиейПриИзмененииПродолжение",
		ЭтотОбъект,
		Новый Структура("ТекущиеДанные", ТекущиеДанные));
	
	КоличествоРасширенийСканКопий = 0;
	ЭтоРасширениеСканКопии = ДелопроизводствоКлиентСервер.ЭтоРасширениеСканКопии(
		ТекущиеДанные.Расширение, КоличествоРасширенийСканКопий);
	Если ТекущиеДанные.УВМ_ЯвляетсяКопией 
		И Не ЭтоРасширениеСканКопии И КоличествоРасширенийСканКопий > 0 Тогда  
		ТекстВопроса = НСтр("ru = 'Выбранный файл, возможно, не является скан-копией. 
		|Вы действительно хотите отметить его как копию?'");
			
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет, 
			НСтр("ru = 'Отметка копии'"));
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура УВМ_ЯвляетсяКопиейПриИзмененииПродолжение(Результат, Параметры) Экспорт 
	
	ТекущиеДанные = Параметры.ТекущиеДанные;

	Если Результат <> КодВозвратаДиалога.Да Тогда
		ТекущиеДанные.УВМ_ЯвляетсяКопией = Не ТекущиеДанные.УВМ_ЯвляетсяКопией;
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
&После("ФайлыПередУдалениемПродолжение")
Процедура АБ_ФайлыПередУдалениемПродолжение(Результат, Параметры)
	АБ_ВызовСервера.УВМ_УдалитьПомеченныеФайлыИзСведений(Объект.Ссылка);
КонецПроцедуры
//--dar 11.03.26 (309302)

#КонецОбласти

#Область ОбработчикиКомандФормы

//++dar 25.11.25 (296038)
&НаКлиенте
Процедура УВМ_ДействияОтправить(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда // ни разу не был записан
		ПодключитьОбработчикОжидания("ЗаписатьДокументИЗапуститьОбработкуОтправить", 0.2, Истина);
	Иначе
		ДействияОтправить(Элементы["УВМ_ДействияОтправить"]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокументИЗапуститьОбработкуОтправить()

	Состояние(НСтр("ru = 'Выполняется запись документа...'"));
	
	ПараметрыЗаписи = Новый Структура;
	//++GIV 31032026 (320030)
	ПараметрыЗаписи.Вставить("ЭтоНовыйОбъект", Не ЗначениеЗаполнено(Объект.Ссылка));
	ПередЗаписью(Ложь, ПараметрыЗаписи);
	//--GIV 31032026 (320030)    
	
	Записать(ПараметрыЗаписи);

	ДействияОтправить(Элементы["УВМ_ДействияОтправить"]);
	
КонецПроцедуры

&НаКлиенте
Процедура УВМ_ДействияОстановить(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда // ни разу не был записан
		ПодключитьОбработчикОжидания("ЗаписатьДокументИЗапуститьОбработкуОстановить", 0.2, Истина);
	Иначе
		ДействияОстановить(Элементы["УВМ_ДействияОстановить"]);
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаписатьДокументИЗапуститьОбработкуОстановить()

	Состояние(НСтр("ru = 'Выполняется запись документа...'"));
	
	ПараметрыЗаписи = Новый Структура;
	Записать(ПараметрыЗаписи);

	ДействияОстановить(Элементы["УВМ_ДействияОстановить"]);
	
КонецПроцедуры
//--dar 25.11.25 (296038) 

//++dar 02.06.26 (330921)
&НаКлиенте
Процедура УВМ_ОтправитьКонтрагенту(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		Записать();
	КонецЕсли;
	УВМ_ОбщиеДоработкиКлиент.УВМ_ПрикрепитьФайлPDF(Объект.Ссылка);
	УВМ_ОбщиеДоработкиКлиент.УВМ_СформироватьИОтправитьПисьмаКлиентам(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
КонецПроцедуры
//--dar 02.06.26 (330921)

#КонецОбласти

// +++ Миляев (295800) 2026-02-11
#Область ДействующиеДоговоры


&НаКлиенте
Процедура УВМ_ДействующиеДоговорыКоманда(Элемент)
	
	НаименованиеСтрон_Поставщик = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","Сторона_Покупатель"),Неопределено);
	Если ЗначениеЗаполнено(НаименованиеСтрон_Поставщик) И ЗначениеЗаполнено(Объект.ВидДокумента) тогда
		НайдСтрокиПокупатель = Объект.Стороны.НайтиСтроки(Новый Структура("Наименование",НаименованиеСтрон_Поставщик));
		Если НайдСтрокиПокупатель.Количество()>0 
			и ЗначениеЗаполнено(НайдСтрокиПокупатель[0].Сторона)
			и ТипЗнч(НайдСтрокиПокупатель[0].Сторона) = Тип("СправочникСсылка.Контрагенты") тогда 
			
			
			ФоноваяОперация = ВыполнитьЗапросКВнешнейБазеДляПолученияДоговоров(НайдСтрокиПокупатель[0].Сторона);
			
			Если ФоноваяОперация = Неопределено тогда
				Возврат;
			КонецЕсли;
			
			ОповещениеОЗавершенииФоновогоЗадания = Новый ОписаниеОповещения("ОповещениеЗавершениеОперацииЗапросаПолученияДоговоров",ЭтаФорма
				,Новый Структура("Контрагент,АдресРезультата,ВидДокумента",НайдСтрокиПокупатель[0].Сторона,ФоноваяОперация.АдресРезультата,Объект.ВидДокумента));			
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма); 
			ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоноваяОперация,ОповещениеОЗавершенииФоновогоЗадания,ПараметрыОжидания);
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапросКВнешнейБазеДляПолученияДоговоров(пКонтрагент)
	
	ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(пКонтрагент,"ИНН");
	Если не ЗначениеЗаполнено(ИНН) тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"АБ_ВызовСервера.МассивДействующихДоговоровИзВнешнейБазы",ИНН); 
	
КонецФункции

&НаКлиенте
Процедура ОповещениеЗавершениеОперацииЗапросаПолученияДоговоров(Результат, ДополнительныеПараметры) Экспорт
	Если Результат.Статус = "Выполнено" Тогда
		ОткрытьФорму("ОбщаяФорма.АБ_ФормаПросмотраДействующихДоговоров",ДополнительныеПараметры,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);			 	   		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УВМ_ОбновитьВидимостьОформление()
	НаименованиеСтрон_Поставщик = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","Сторона_Покупатель"),Неопределено);
	ВидДокумента10_МыПоставщик  = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","ВД_ДоговорПоставкиМыПоставщик"),Неопределено);
	Если ЗначениеЗаполнено(НаименованиеСтрон_Поставщик) 
		И ЗначениеЗаполнено(ВидДокумента10_МыПоставщик)
		И Объект.ВидДокумента = ВидДокумента10_МыПоставщик тогда
		
		НайдСтрокиПокупатель = Объект.Стороны.НайтиСтроки(Новый Структура("Наименование",НаименованиеСтрон_Поставщик));
		Если НайдСтрокиПокупатель.Количество()>0 
			и ЗначениеЗаполнено(НайдСтрокиПокупатель[0].Сторона)
			и ТипЗнч(НайдСтрокиПокупатель[0].Сторона) = Тип("СправочникСсылка.Контрагенты") тогда
			
			Элементы.УВМ_ДействующиеДоговорыКоманда.Видимость = Истина;
			Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайдСтрокиПокупатель[0].Сторона,"ИНН")) тогда
				Элементы.УВМ_ДействующиеДоговорыКоманда.Заголовок = "Действующие договоры с контрагентом";
				Элементы.УВМ_ДействующиеДоговорыКоманда.Доступность = Истина;
			Иначе
				Элементы.УВМ_ДействующиеДоговорыКоманда.Заголовок = "Действующие договоры (у контрагента не указан ИНН)";
				Элементы.УВМ_ДействующиеДоговорыКоманда.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;	
	Иначе
		Элементы.УВМ_ДействующиеДоговорыКоманда.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
// --- Миляев (295800) 2026-02-11

#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("УстановитьДоступностьРеквизитовРегистрации")
Процедура АБ_УстановитьДоступностьРеквизитовРегистрации(ТекущийОбъект)

	ЭтоДелопроизводитель = РольДоступна("РегистрацияДокументовПредприятия") Или РольДоступна("ПолныеПрава");
	Если Не ЭтоДелопроизводитель Тогда 

		Элементы.Зарегистрировать.Видимость = Ложь;
		Элементы.ЗарегистрироватьЕще.Видимость = Ложь;
		Элементы.ГруппаРегНомер.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Если Не ЗначениеЗаполнено(Объект.РегистрационныйНомер) 
			И Не ЗначениеЗаполнено(Объект.ДатаРегистрации) Тогда 
			Элементы.РегистрационныйНомер.Видимость = Ложь;
			Элементы.ДатаРегистрации.Видимость = Ложь;
		КонецЕсли;

	Иначе

		Элементы.Зарегистрировать.Видимость = Истина;
		Элементы.ЗарегистрироватьЕще.Видимость = Истина;
		Элементы.ГруппаРегНомер.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;

		Если Не ЗначениеЗаполнено(ТекущийОбъект.ВидДокумента) Тогда // не известен вид нумерации

			Элементы.РегистрационныйНомер.Доступность = Ложь;
			Элементы.ДатаРегистрации.Доступность = Ложь;
			Элементы.ГруппаРегНомер.Подсказка = 
			НСтр("ru = 'Для регистрации документа используйте кнопку ""Зарегистрировать"" в командной панели.'");

			Элементы.ФайлыВставитьРегистрационныйНомер.Доступность = Ложь;
			Элементы.КонтекстноеМенюФайлыВставитьРегистрационныйНомер.Доступность = Ложь;
			Элементы.ФайлыВставитьРегистрационныйНомерСоздание.Доступность = Ложь;
			Элементы.КонтекстноеМенюФайлыВставитьРегистрационныйНомерСоздание.Доступность = Ложь;

		Иначе

			Если ЗначениеЗаполнено(ТекущийОбъект.РегистрационныйНомер) Тогда // документ зарегистрирован
				Элементы.РегистрационныйНомер.Доступность = Истина;
				Элементы.ДатаРегистрации.Доступность = Истина;
				Элементы.Зарегистрировать.Видимость = Ложь;
				Элементы.ЗарегистрироватьЕще.Заголовок = НСтр("ru = 'Перерегистрировать'");
				Элементы.РегистрационныйНомер.ОтображениеПредупрежденияПриРедактировании = 
				ОтображениеПредупрежденияПриРедактировании.Отображать;
				Элементы.ГруппаРегНомер.Подсказка = 
				НСтр("ru = 'Для перерегистрации документа используйте команду ""Еще \ Документ \ Перерегистрировать"".'");

				Элементы.ФайлыВставитьРегистрационныйНомер.Доступность = Истина;
				Элементы.КонтекстноеМенюФайлыВставитьРегистрационныйНомер.Доступность = Истина;
				Элементы.ФайлыВставитьРегистрационныйНомерСоздание.Доступность = Истина;
				Элементы.КонтекстноеМенюФайлыВставитьРегистрационныйНомерСоздание.Доступность = Истина;
			Иначе
				Элементы.РегистрационныйНомер.Доступность = Ложь;
				Элементы.ДатаРегистрации.Доступность = Ложь;
				Элементы.ЗарегистрироватьЕще.Заголовок = НСтр("ru = 'Зарегистрировать'");
				Элементы.ГруппаРегНомер.Подсказка = 
				НСтр("ru = 'Для регистрации документа используйте кнопку ""Зарегистрировать"" в командной панели.'");

				Элементы.ФайлыВставитьРегистрационныйНомер.Доступность = Ложь;
				Элементы.КонтекстноеМенюФайлыВставитьРегистрационныйНомер.Доступность = Ложь;
				Элементы.ФайлыВставитьРегистрационныйНомерСоздание.Доступность = Ложь;
				Элементы.КонтекстноеМенюФайлыВставитьРегистрационныйНомерСоздание.Доступность = Ложь;
				#Вставка
				//++dar 17.02.26 (309302)
				Элементы.РегистрационныйНомер.Доступность = Истина;
				Элементы.РегистрационныйНомер.ТолькоПросмотр = Ложь;
				Элементы.ДатаРегистрации.Доступность = Истина;
				Элементы.ДатаРегистрации.ТолькоПросмотр = Ложь;
				//--dar 17.02.26 (309302)
				#КонецВставки
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Если ЭтоМобильныйКлиент Тогда
		Элементы.ГруппаРегНомер.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;

	РаботаСКорреспонденцией.УстановитьДоступностьОтправки(ЭтаФорма, ТекущийОбъект.РегистрационныйНомер);
	#Вставка
	//++dar 17.02.26 (309302)
	Элементы.Зарегистрировать.Видимость = Ложь;
	Элементы.ЗарегистрироватьЕще.Видимость = Ложь;
	//--dar 17.02.26 (309302)
	#КонецВставки

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриИзмененииВидаДокумента")
Процедура АБ_ПриИзмененииВидаДокумента(ПриСозданииНаСервере)

	ТекстСообщения = "";
	Если Делопроизводство.ПолучитьЗапретСозданияДокументовНеПоШаблону(Объект.Ссылка, Объект.ВидДокумента, 
		ПараметрШаблонДокумента, ТекстСообщения, Ложь) Тогда

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ВидДокумента");

		Объект.ВидДокумента = Неопределено;
		Возврат;

	КонецЕсли;

	ВидДокументаИзменен = Истина;	

	ПредыдущийВидДокумента = ВидДокументаКэш.Ссылка;

	Делопроизводство.ЗаполнитьКэшВидаДокументаНаФорме(ЭтотОбъект, Объект.ВидДокумента);

	ВестиУчетПоКонтрагентам = ВидДокументаКэш.ВестиУчетПоКонтрагентам;
	ВестиУчетПоОрганизациям = ВидДокументаКэш.ВестиУчетПоОрганизациям;
	ВариантПодписания = ВидДокументаКэш.ВариантПодписания;
	ЯвляетсяЗаявкойНаОплату = ВидДокументаКэш.ЯвляетсяЗаявкойНаОплату;

	Если ЗначениеЗаполнено(Основание) Тогда
		Если ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
			Если ВидДокументаКэш.ВестиУчетСторон Тогда
				Если  ВстроеннаяПочтаКлиентСервер.ЭтоВходящееПисьмо(Основание)Тогда

					Адрес = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание.ОтправительАдресат, "Адрес");
					СтруктураРезультата = 
					ВстроеннаяПочтаСервер.ПолучитьКонтрагентаИКонтактноеЛицоПоСтрокеАдреса(Адрес);

					Если СтруктураРезультата <> Неопределено Тогда
						Объект.Стороны.Очистить();
						ДобавитьСторону(СтруктураРезультата.Контрагент, СтруктураРезультата.КонтактноеЛицо, 1);

					КонецЕсли;

				ИначеЕсли ВстроеннаяПочтаКлиентСервер.ЭтоИсходящееПисьмо(Основание)Тогда

					МассивАдресов = Новый Массив;

					Для Каждого СтрПолучатель Из Основание.ПолучателиПисьма Цикл 
						МассивАдресов.Добавить(СтрПолучатель.Адресат);
					КонецЦикла;
					Для Каждого СтрПолучатель Из Основание.ПолучателиКопий Цикл 
						МассивАдресов.Добавить(СтрПолучатель.Адресат);
					КонецЦикла;
					Для Каждого СтрПолучатель Из Основание.ПолучателиСкрытыхКопий Цикл 
						МассивАдресов.Добавить(СтрПолучатель.Адресат);
					КонецЦикла;

					Объект.Стороны.Очистить();
					Если ЗначениеЗаполнено(Объект.Организация) Тогда
						ДобавитьСторону(Объект.Организация);
					КонецЕсли;

					Для Каждого Адресат Из МассивАдресов Цикл 
						Адрес = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Адресат, "Адрес");
						СтруктураРезультата = 
						ВстроеннаяПочтаСервер.ПолучитьКонтрагентаИКонтактноеЛицоПоСтрокеАдреса(Адрес);

						Если СтруктураРезультата <> Неопределено Тогда
							Строка = Объект.Стороны.Добавить();
							ДобавитьСторону(СтруктураРезультата.Контрагент, СтруктураРезультата.КонтактноеЛицо, 1);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			ИначеЕсли ВидДокументаКэш.ВестиУчетПоКонтрагентам И Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
				Если  ВстроеннаяПочтаКлиентСервер.ЭтоВходящееПисьмо(Основание)Тогда

					Адрес = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание.ОтправительАдресат, "Адрес");
					СтруктураРезультата = 
					ВстроеннаяПочтаСервер.ПолучитьКонтрагентаИКонтактноеЛицоПоСтрокеАдреса(Адрес);

					Если СтруктураРезультата <> Неопределено Тогда
						Объект.Контрагент = СтруктураРезультата.Контрагент;
						Объект.КонтактноеЛицо = СтруктураРезультата.КонтактноеЛицо;

						Объект.Контрагенты.Очистить();	
						Строка = Объект.Контрагенты.Добавить();
						Строка.Контрагент = СтруктураРезультата.Контрагент;
						Строка.КонтактноеЛицо = СтруктураРезультата.КонтактноеЛицо;

					КонецЕсли;

				ИначеЕсли  ВстроеннаяПочтаКлиентСервер.ЭтоИсходящееПисьмо(Основание)Тогда

					МассивАдресов = Новый Массив;

					Для Каждого СтрПолучатель Из Основание.ПолучателиПисьма Цикл 
						МассивАдресов.Добавить(СтрПолучатель.Адресат);
					КонецЦикла;
					Для Каждого СтрПолучатель Из Основание.ПолучателиКопий Цикл 
						МассивАдресов.Добавить(СтрПолучатель.Адресат);
					КонецЦикла;
					Для Каждого СтрПолучатель Из Основание.ПолучателиСкрытыхКопий Цикл 
						МассивАдресов.Добавить(СтрПолучатель.Адресат);
					КонецЦикла;

					Объект.Контрагенты.Очистить();
					Для Каждого Адресат Из МассивАдресов Цикл 
						Адрес = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Адресат, "Адрес");
						СтруктураРезультата = 
						ВстроеннаяПочтаСервер.ПолучитьКонтрагентаИКонтактноеЛицоПоСтрокеАдреса(Адрес);

						Если СтруктураРезультата <> Неопределено Тогда
							Строка = Объект.Контрагенты.Добавить();
							Строка.Контрагент = СтруктураРезультата.Контрагент;
							Строка.КонтактноеЛицо = СтруктураРезультата.КонтактноеЛицо;
						КонецЕсли;
					КонецЦикла;	

					Если Объект.Контрагенты.Количество() > 0 Тогда 
						Объект.Контрагент = Объект.Контрагенты[0].Контрагент;
						Объект.КонтактноеЛицо = Объект.Контрагенты[0].КонтактноеЛицо;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	НесколькоКонтрагентов = (Объект.Контрагенты.Количество() > 1);
	УстановитьВидимостьКонтрагентов();

	УстановитьСрокИсполнения(Объект, Истина);

	// Срок действия
	СрокДействияПриИзмененииВидаДокумента();

	// Недействующие документы
	Если ЗначениеЗаполнено(Объект.ВидДокумента)
		И ВидДокументаКэш.УчитыватьНедействующиеДокументы
		И ВидДокументаКэш.ЯвляетсяДоговором Тогда
		Элементы.НеДействует.Заголовок = НСтр("ru = 'Расторгнут'");
	КонецЕсли;

	// Реквизиты по виду документа
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("ВидДокумента", Объект.ВидДокумента));
	НеобходимоНапечататьШтрихкодПриСоздании = ВидДокументаКэш.НеобходимаПечатьШтрихкода;
	УчитыватьСрокДействия = ВидДокументаКэш.УчитыватьСрокДействия;

	// Статьи ДДС.
	ВестиУчетПоСтатьямДДС = ?(ЗначениеЗаполнено(Объект.ВидДокумента),
	ВидДокументаКэш.ВестиУчетПоСтатьямДДС, 
	Ложь);
	Элементы.ГруппаСуммаНДССтатьиДДС.Видимость = ВестиУчетПоСтатьямДДС;
	Если Не ВестиУчетПоСтатьямДДС Тогда
		СтатьиДвиженияДенежныхСредств.Очистить();
	КонецЕсли;
	СформироватьПредставлениеСтатейДДС();

	// Заявка на оплату.
	Если ЗначениеЗаполнено(Объект.ВидДокумента)
		И ВидДокументаКэш.ЯвляетсяЗаявкойНаОплату Тогда
		Элементы.ГруппаПолучатель.Видимость = Истина;
		Элементы.Организация.Заголовок = НСтр("ru = 'Плательщик'");
		Элементы.ГруппаОрганизация.ОтображатьЗаголовок = Ложь;
		Элементы.Сумма.АвтоОтметкаНезаполненного = Истина;
		Элементы.Сумма1.АвтоОтметкаНезаполненного = Истина;
		Элементы.Получатель.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.ГруппаПолучатель.Видимость = Ложь;
		Элементы.Организация.Заголовок = РедакцииКонфигурацииКлиентСервер.Организация();
		Элементы.ГруппаОрганизация.ОтображатьЗаголовок = Истина;
		Элементы.Сумма.АвтоОтметкаНезаполненного = Неопределено;
		Элементы.Сумма1.АвтоОтметкаНезаполненного = Неопределено;
		Элементы.Получатель.АвтоОтметкаНезаполненного = Неопределено;
	КонецЕсли;

	// Заполнение валюты
	Если Не ЗначениеЗаполнено(Объект.Валюта)
		И ЗначениеЗаполнено(Объект.ВидДокумента) 
		И ПолучитьФункциональнуюОпцию("ИспользоватьСуммуВоВнутренних",
		Новый Структура("ВидДокумента", Объект.ВидДокумента)) Тогда
		Объект.Валюта = Делопроизводство.ПолучитьВалютуПоУмолчанию();
	КонецЕсли;

	// Доступность реквизитов регистрации
	Если Не ПриСозданииНаСервере Тогда
		УстановитьДоступностьРеквизитовРегистрации(Объект);
	КонецЕсли;

	// Обработчик механизма "Свойства"
	ОбновитьЭлементыДополнительныхРеквизитов();

	// Рабочие группы
	РаботаСРабочимиГруппами.ПриИзмененииВидаОбъекта(ЭтотОбъект);

	// Комплекты документов
	РаботаСКомплектамиДокументовСервер.ДокументПриИзмененииВидаДокументаНаСервере(ЭтотОбъект);

	// Смена заголовка организации и установка видимости при взаимодействии ФО.
	ИспользоватьУчетПоОрганизациям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям");
	Если ИспользоватьУчетПоОрганизациям
		И (Не ВидДокументаКэш.ВестиУчетСторон Или ЯвляетсяЗаявкойНаОплату) Тогда
		Если ПолучитьФункциональнуюОпцию("ВестиУчетПоОрганизациям",
			Новый Структура("ВидДокумента", Объект.ВидДокумента)) Тогда
			Элементы.Организация.Видимость = Истина;
			Элементы.Организация.АвтоОтметкаНезаполненного = Истина;
			Элементы.ГруппаОрганизация.Заголовок = РедакцииКонфигурацииКлиентСервер.ИмяОрганизацииБезУчетаСторон();
			Элементы.ГруппаОрганизация.Подсказка = РедакцииКонфигурацииКлиентСервер.ПодсказкаОрганизацииБезУчетаСторон();
		Иначе
			Элементы.Организация.Видимость = Ложь;
			Элементы.ГруппаОрганизация.Заголовок = РедакцииКонфигурацииКлиентСервер.ИмяОрганизацииУчетСторон();
			Элементы.ГруппаОрганизация.Подсказка = РедакцииКонфигурацииКлиентСервер.ПодсказкаОрганизацииУчетСторон();
			Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;

	ИначеЕсли ВидДокументаКэш.ВестиУчетСторон Тогда
		Элементы.Организация.Видимость = Ложь;

		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда 
			Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
	Иначе
		Элементы.Организация.Видимость = Ложь;
		Элементы.ГруппаОрганизация.Заголовок = РедакцииКонфигурацииКлиентСервер.ИмяОрганизацииУчетСторон();
		Элементы.ГруппаОрганизация.Подсказка = РедакцииКонфигурацииКлиентСервер.ПодсказкаОрганизацииУчетСторон();
		Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;

	Элементы.ГруппаСтороны.Видимость = ВидДокументаКэш.ВестиУчетСторон 
	И Не ЯвляетсяЗаявкойНаОплату;
	Элементы.СтороныПодписан.Видимость = ВидДокументаКэш.ВестиУчетСторон
	И Не ЯвляетсяЗаявкойНаОплату
	И ВариантПодписания <> Перечисления.ВариантыПодписания.НеПодписывается;
	Элементы.СтороныДатаПодписи.Видимость = ВидДокументаКэш.ВестиУчетСторон
	И Не ЯвляетсяЗаявкойНаОплату
	И ВариантПодписания <> Перечисления.ВариантыПодписания.НеПодписывается;
	#Вставка
	//++dar 29.04.26 (326008)
	Элементы.СтороныПодписан.ТолькоПросмотр = Истина;
	Элементы.СтороныДатаПодписи.ТолькоПросмотр = Истина;
	//--dar 29.04.26 (326008)
	#КонецВставки

	Если ВидДокументаКэш.ВестиУчетСторон Тогда
		ДобавитьСторону(Объект.Организация);	
	Иначе
		Объект.Стороны.Очистить();
	КонецЕсли;

	#Вставка
	//++dar 07.10.25 (281937)
	Если НЕ ЗначениеЗаполнено(Справочники.Организации.ОрганизацияПоУмолчанию()) Тогда
		Для Каждого УВМ_Сторона Из Объект.Стороны Цикл
			Если ТипЗнч(УВМ_Сторона.Сторона) = Тип("СправочникСсылка.Организации") И ЗначениеЗаполнено(УВМ_Сторона.Сторона) Тогда
				УВМ_Сторона.Сторона = Справочники.Организации.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//--dar 07.10.25 (281937)
	#КонецВставки
	ВывестиДекорациюОтсутствуетОригинал(Объект);

	//Копирование дополнительных реквизитов основания 
	Если ЗначениеЗаполнено(Основание) 
		И ТипЗнч(Основание) = Тип("СправочникСсылка.ДокументыПредприятия")
		И ЭтаФорма.Свойства_ИспользоватьСвойства Тогда

		Для Каждого Реквизит Из Основание.ДополнительныеРеквизиты Цикл
			СтруктураПоиска = Новый Структура("Свойство", Реквизит.Свойство);
			МассивСтрок = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() > 0 Тогда
				НоваяСтрока = МассивСтрок[0];
				ЭтаФорма[НоваяСтрока.ИмяРеквизитаЗначение] = Реквизит.Значение;
			КонецЕсли;
		КонецЦикла;
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;

	// Обновить инструкции
	ПолучитьИнструкции();

	ВключитьАвтоОтметкуИЗаполнитьПолеОтветственный();	

	Делопроизводство.ПрочитатьОбязательныеТипыСвязей(ЭтаФорма, ОбязательныеТипыСвязей, Объект.Ссылка, Объект.ВидДокумента);	

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.ДокументыПредприятия") И Не ТипСвязиВыбран Тогда
		МассивТиповСвязей = ПолучитьТипыСвязей(Основание, Объект.ВидДокумента);	
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ВидДокумента)
		И ВидДокументаКэш.ВестиУчетТоваровИУслуг Тогда
		ВестиУчетТоваровИУслуг = Истина;
		Элементы.СтраницаТовары.Видимость = Истина;

		Если Объект.Товары.Количество() > 0 И Объект.Сумма <> Объект.Товары.Итог("Сумма") Тогда 
			Элементы.Сумма1.Видимость = Истина;
			Элементы.Сумма.Видимость = Ложь;
		Иначе 
			Элементы.Сумма1.Видимость = Ложь;
			Элементы.Сумма.Видимость = Истина;
		КонецЕсли;
	Иначе 
		Элементы.СтраницаТовары.Видимость = Ложь;
		ВестиУчетТоваровИУслуг = Ложь;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
		Элементы.Проект.АвтоОтметкаНезаполненного = ВидДокументаКэш.ОбязательноУказаниеПроекта;
	КонецЕсли;

	Элементы.ПодписьТекст.Видимость = ИспользоватьПодписание И Не ВидДокументаКэш.ВестиУчетСторон;

	РаботаСПодписямиДокументов.ЗаполнитьТаблицуСторон(ЭтотОбъект);
	УстановитьУсловноеОформление();

	Делопроизводство.ЗаполнитьСписокВыбораФормыДокумента(ЭтотОбъект);
	ФормаДокументаПриОткрытии = Объект.ФормаДокумента;

	Если Не ПриСозданииНаСервере Тогда
		Делопроизводство.ОбновитьСведенияОПолученииОригинала(ЭтотОбъект);
	КонецЕсли;
	Делопроизводство.ОбновитьВидимостьРеквизитовХранения(ЭтотОбъект, ВидДокументаКэш);

	ВидИТематикаТекст = СокрЛП(Объект.ВидДокумента);
	Если ВидДокументаКэш.ВестиУчетПоТематикам Тогда 
		Элементы.ВидИТематикаТекст.Подсказка = НСтр("ru = 'Вид и тематика документа'");

		Если ЗначениеЗаполнено(Объект.Тематика) Тогда 
			ВидИТематикаТекст = СтрШаблон("%1 - %2",
			СокрЛП(Объект.ВидДокумента), СокрЛП(Объект.Тематика));
		КонецЕсли;
	Иначе 
		Элементы.ВидИТематикаТекст.Подсказка = НСтр("ru = 'Вид документа'");
	КонецЕсли;

	Элементы.ГруппаОтменен.Видимость = Делопроизводство.ЭтотВидДокументаМожноОтменить(Объект.ВидДокумента);	
	ПоказатьДелаетНедействующими();

	// Методы ниже будут вызваны из ПриСозданииНаСервере
	Если Не ПриСозданииНаСервере Тогда

		// Не заполняем данные корреспонденции на форме этой процедурой при создании на сервере,
		// чтобы не дублировать вызов метода РаботаСКорреспонденцией.ПриИзмененииВидаДокуметаНаФорме
		РаботаСКорреспонденцией.ПриИзмененииВидаДокуметаНаФорме(ЭтотОбъект);

		УстановитьВидимостьИТекстНадписиРабочихДней();

	КонецЕсли;

	Нумерация.УстановитьВидимостьВременногоНомера(ЭтотОбъект);

	УстановитьВидимостьКомандыПечатиКонверта();

	УстановитьРекомендованныеНастройки();
	ОтобразитьВажность(ЭтотОбъект);

	Элементы.Сканировать.Видимость = ВидДокументаКэш.ЯвляетсяВходящейКорреспонденцией;

	ДокументыПредприятияЛокализация.ПриИзмененииВидаДокументаФормаЭлемента(ЭтотОбъект, ПриСозданииНаСервере);
	#Вставка
	//++dar 04.05.26 (326149)
	УВМ_ПриИзмененииВидаДокумента();
	//--dar 04.05.26 (326149)
	#КонецВставки

КонецПроцедуры

//++dar 19.02.26 (309302)
&НаСервере
Функция УВМ_ПочтыКонтрагентаИКонтактногоЛица(Контрагент, КонтактноеЛицо, УказанныеПочты)
	
	Результат = "";
	МсвРезультат = Новый Массив;
	
	МсвУказанныеПочты = СтрРазделить(СтрЗаменить(УказанныеПочты, " ", ""), ", ", Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МсвРезультат, МсвУказанныеПочты, Истина);
	
	ПочтыКонтрагента = УВМ_ЭлектронныеПочты(Контрагент);
	МсвПочтыКонтрагента = СтрРазделить(СтрЗаменить(ПочтыКонтрагента, " ", ""), ",", Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МсвРезультат, МсвПочтыКонтрагента, Истина);
	
	ПочтыКонтактногоЛица = УВМ_ЭлектронныеПочты(КонтактноеЛицо);
	МсвПочтыКонтактногоЛица = СтрРазделить(СтрЗаменить(ПочтыКонтактногоЛица, " ", ""), ",", Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МсвРезультат, МсвПочтыКонтактногоЛица, Истина);
	
	Результат = СтрСоединить(МсвРезультат, ", ");
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция УВМ_ЭлектронныеПочты(СсылкаНаОбъект)
	
	Результат = "";
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Результат = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(СсылкаНаОбъект, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента, , ТекущаяДатаСеанса());
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Результат = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(СсылкаНаОбъект, Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица, , ТекущаяДатаСеанса());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//--dar 19.02.26 (309302)

// +++ Миляев (293293) 2026-02-19
&НаКлиенте
Процедура УВМ_СтороныОснованиеНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Стороны.ТекущиеДанные;
	ДанныеВыбора = ПолучитьДанныеВыбораСтороныОснование(ТекущиеДанные.Сторона,ТекущиеДанные.Наименование,ТекущиеДанные.Подписал);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеВыбораСтороныОснование(пСторона,пНаименованиеСтороны,пПодписал)
	
	СписокВозврат = Новый СписокЗначений;
	
	//++GIV 31032026 (320030)
	//Если спрСсылка.Сотрудники тогда По ответственным лицам организации ИНАЧЕ по УВМ_ОснованиеПодписи
	Если ТипЗнч(пПодписал) = Тип("СправочникСсылка.Сотрудники") И ТипЗнч(пСторона) = Тип("СправочникСсылка.Организации") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Тематика", Объект.Тематика);
		Запрос.УстановитьПараметр("Организация", пСторона);
		Запрос.УстановитьПараметр("Сотрудник", пПодписал);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТематикиДокументов.АБ_ВходящиеДокументы КАК ВходящийДокумент
		               |ПОМЕСТИТЬ ВТВходящийДокумент
		               |ИЗ
		               |	Справочник.ТематикиДокументов КАК ТематикиДокументов
		               |ГДЕ
		               |	ТематикиДокументов.Ссылка = &Тематика
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ВходящийДокумент
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	АБ_ПраваИОснованияПравилПодписиДокументов.НомерДокументаПраваПодписи КАК НомерДокументаПраваПодписи,
		               |	АБ_ПраваИОснованияПравилПодписиДокументов.ДатаДокументаПраваПодписи КАК ДатаДокументаПраваПодписи,
		               |	АБ_ПраваИОснованияПравилПодписиДокументов.ДокументПраваПодписи КАК ДокументПраваПодписи,
		               |	Сотрудники.Должность КАК Должность,
		               |	Сотрудники.ПредставлениеВДокументах КАК ПредставлениеВДокументах
		               |ИЗ
		               |	РегистрСведений.АБ_ПраваИОснованияПравилПодписиДокументов КАК АБ_ПраваИОснованияПравилПодписиДокументов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		               |		ПО АБ_ПраваИОснованияПравилПодписиДокументов.ФизическоеЛицо = Сотрудники.Владелец
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТВходящийДокумент КАК ВТВходящийДокумент
		               |		ПО (ИСТИНА)
		               |ГДЕ
		               |	АБ_ПраваИОснованияПравилПодписиДокументов.Организация = &Организация
		               |	И Сотрудники.Действует
		               |	И НЕ Сотрудники.ПометкаУдаления
		               |	И ВЫБОР
		               |			КОГДА ВТВходящийДокумент.ВходящийДокумент
		               |					И АБ_ПраваИОснованияПравилПодписиДокументов.ПравоПодписиВходящихДокументов
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ ВЫБОР
		               |					КОГДА НЕ ВТВходящийДокумент.ВходящийДокумент
		               |							И АБ_ПраваИОснованияПравилПодписиДокументов.ПравоПодписиИсходящихДокументов
		               |						ТОГДА ИСТИНА
		               |					ИНАЧЕ ЛОЖЬ
		               |				КОНЕЦ
		               |		КОНЕЦ
		               |	И Сотрудники.Ссылка = &Сотрудник"; 
		Выборка = Запрос.Выполнить().Выбрать();
		мДолжностей = ДолжностиДляОснованияУстав();
		Пока Выборка.Следующий() Цикл
			//++dar 22.05.26 (330168)
			//Если мДолжностей.Найти(Выборка.Должность) = Неопределено Тогда 
			//	СписокВозврат.Добавить(СтрШаблон("%1 %2, %3 %4 от %5", Выборка.Должность, 
			//	Выборка.ПредставлениеВДокументах, 
			//	?(ЗначениеЗаполнено(Выборка.ДокументПраваПодписи),Выборка.ДокументПраваПодписи, "Документ права подписи не заполнен"), 
			//	?(ЗначениеЗаполнено(Выборка.НомерДокументаПраваПодписи),Выборка.НомерДокументаПраваПодписи, "Номер документа права подписи не заполнен"),
			//	?(ЗначениеЗаполнено(Выборка.ДатаДокументаПраваПодписи), Формат(Выборка.ДатаДокументаПраваПодписи, "ДЛФ=DD"), 
			//	"Дата документа права подписи не заполнена")));
			//Иначе
			//	СписокВозврат.Добавить(СтрШаблон("%1 %2 Устав", Выборка.Должность, 
			//	Выборка.ПредставлениеВДокументах));
			//КонецЕсли;
			Если мДолжностей.Найти(Выборка.Должность) = Неопределено Тогда
				СписокВозврат.Добавить(СтрШаблон("%1 %2 от %3",
				?(ЗначениеЗаполнено(Выборка.ДокументПраваПодписи), Выборка.ДокументПраваПодписи, "Документ права подписи не заполнен"),
				?(ЗначениеЗаполнено(Выборка.НомерДокументаПраваПодписи), Выборка.НомерДокументаПраваПодписи, "Номер документа права подписи не заполнен"),
				?(ЗначениеЗаполнено(Выборка.ДатаДокументаПраваПодписи), Формат(Выборка.ДатаДокументаПраваПодписи, "ДЛФ=DD"),
				"Дата документа права подписи не заполнена")));
			Иначе
				СписокВозврат.Добавить("Устав");
			КонецЕсли;
			//--dar 22.05.26 (330168)
		КонецЦикла;
	ИначеЕсли ТипЗнч(пПодписал) = Тип("СправочникСсылка.КонтактныеЛица") И ТипЗнч(пСторона) = Тип("СправочникСсылка.Контрагенты") Тогда
		ОснованиеПодписиКЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(пПодписал,"УВМ_ОснованиеПодписи");
		Если ЗначениеЗаполнено(ОснованиеПодписиКЛ) тогда
			СписокВозврат.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(пПодписал,"УВМ_ОснованиеПодписи"));
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокВозврат;
	//--GIV 06042026 (320030)
КонецФункции  

&НаСервереБезКонтекста
Функция ДолжностиДляОснованияУстав()
	мДолжностей = Новый Массив;
	мДолжностей.Добавить(АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","Должность_директор"),Справочники.Должности.ПустаяСсылка()));
	мДолжностей.Добавить(АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","Должность_ген_директор"),Справочники.Должности.ПустаяСсылка()));
	Возврат мДолжностей;
КонецФункции

&НаСервере
Процедура УВМ_СоздатьСтруктуруКонстант()
	
	ДобРеквизиты = Новый Массив;
	НовРеквизит = Новый РеквизитФормы("СтруктураКонстантУВМ",Новый ОписаниеТипов());
	ДобРеквизиты.Добавить(НовРеквизит);
	ЭтаФорма.ИзменитьРеквизиты(ДобРеквизиты);	
	СтруктураКонстант = Новый Структура();
	ВидДокумента10_МыПоставщик  = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","ВД_ДоговорПоставкиМыПоставщик"),Неопределено);
	Если ЗначениеЗаполнено(ВидДокумента10_МыПоставщик) тогда
		СтруктураКонстант.Вставить("ВД_ДоговорПоставкиМыПоставщик",ВидДокумента10_МыПоставщик);
	КонецЕсли;
	НаименованиеСтрон_Покупатель = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","Сторона_Покупатель"),Неопределено);
	Если ЗначениеЗаполнено(НаименованиеСтрон_Покупатель) тогда
		СтруктураКонстант.Вставить("Сторона_Покупатель",НаименованиеСтрон_Покупатель);
	КонецЕсли;
	НаименованиеСтрон_Поставщик  = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","Сторона_Поставщик"),Неопределено);
	Если ЗначениеЗаполнено(НаименованиеСтрон_Поставщик) тогда
		СтруктураКонстант.Вставить("Сторона_Поставщик",НаименованиеСтрон_Поставщик);
	КонецЕсли;
	Должность_Директор  = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","Должность_Директор"),Неопределено);
	Если ЗначениеЗаполнено(Должность_Директор) тогда
		СтруктураКонстант.Вставить("Должность_Директор",Строка(Должность_Директор));
	КонецЕсли;
	ЭтаФорма.СтруктураКонстантУВМ = СтруктураКонстант;
	
КонецПроцедуры

&НаСервере
Процедура УВМ_ТЧСтороныУказатьОснованиеСтроки(пДанныеСтроки)
	Если ТипЗнч(пДанныеСтроки) = Тип("Число") тогда
		ТекущиеДанные = Объект.Стороны.НайтиПоИдентификатору(пДанныеСтроки);
	Иначе
		ТекущиеДанные = пДанныеСтроки;
	КонецЕсли;
	Если ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбора = ПолучитьДанныеВыбораСтороныОснование(ТекущиеДанные.Сторона,ТекущиеДанные.Наименование,ТекущиеДанные.Подписал);
	Если СписокВыбора.Количество()>0 тогда
		Если СписокВыбора.НайтиПоЗначению(ТекущиеДанные.УВМ_Основание)=Неопределено тогда
			ТекущиеДанные.УВМ_Основание = СписокВыбора[0].Значение;
		КонецЕсли;
	Иначе
		ТекущиеДанные.УВМ_Основание = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УВМ_ТЧСтороныУказатьПодписавшего(пДанныеСтроки)
	Если ТипЗнч(пДанныеСтроки) = Тип("Число") тогда
		ТекущиеДанные = Объект.Стороны.НайтиПоИдентификатору(пДанныеСтроки);
	Иначе
		ТекущиеДанные = пДанныеСтроки;
	КонецЕсли;
	Если ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Подписал) или Не ЗначениеЗаполнено(ТекущиеДанные.Сторона) тогда
		Возврат;
	КонецЕсли;
	
	Если  ЭтаФорма.СтруктураКонстантУВМ.Свойство("ВД_ДоговорПоставкиМыПоставщик") 
		и Объект.ВидДокумента = ЭтаФорма.СтруктураКонстантУВМ.ВД_ДоговорПоставкиМыПоставщик тогда
		
		Если ЭтаФорма.СтруктураКонстантУВМ.Свойство("Сторона_Покупатель") 
			и ТекущиеДанные.Наименование = ЭтаФорма.СтруктураКонстантУВМ.Сторона_Покупатель тогда
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("Контрагент",ТекущиеДанные.Сторона);
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			|	КонтактныеЛица.Ссылка КАК КонтактноеЛицоСсылка
			|ИЗ
			|	Справочник.КонтактныеЛица КАК КонтактныеЛица
			|ГДЕ
			|	КонтактныеЛица.Владелец=&Контрагент И КонтактныеЛица.УВМ_ОснованиеПодписи <> """" ";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() тогда
				ТекущиеДанные.Подписал = Выборка.КонтактноеЛицоСсылка;
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Объект.Подразделение)
			и ЭтаФорма.СтруктураКонстантУВМ.Свойство("Должность_Директор")
			и ЭтаФорма.СтруктураКонстантУВМ.Свойство("Сторона_Поставщик") 
			и ТекущиеДанные.Наименование = ЭтаФорма.СтруктураКонстантУВМ.Сторона_Поставщик тогда
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("Организация",ТекущиеДанные.Сторона);
			Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса());
			Запрос.УстановитьПараметр("ДолжностьДиректор",ЭтаФорма.СтруктураКонстантУВМ.Должность_Директор);
			Запрос.УстановитьПараметр("Подразделение",Объект.Подразделение);
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сотрудники.Ссылка КАК СотрудникСсылка
			|ИЗ
			|	РегистрСведений.ОсновныеСотрудники КАК ОсновныеСотрудники
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО (ОсновныеСотрудники.Сотрудник = Сотрудники.Ссылка)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АБ_ОтветственныеЛицаОрганизаций КАК АБ_ОтветственныеЛицаОрганизаций
			|		ПО (ОсновныеСотрудники.ФизическоеЛицо = АБ_ОтветственныеЛицаОрганизаций.ФизическоеЛицо)
			|ГДЕ
			|	Сотрудники.Подразделение = &Подразделение
			|	И АБ_ОтветственныеЛицаОрганизаций.Владелец = &Организация
			|	И АБ_ОтветственныеЛицаОрганизаций.ЕстьПравоПодписиИсходящихДоговоров
			|	И АБ_ОтветственныеЛицаОрганизаций.ДатаНачала < &ТекущаяДата
			|	И ВЫБОР
			|			КОГДА АБ_ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ДАТАВРЕМЯ(2500, 1, 1)
			|			ИНАЧЕ АБ_ОтветственныеЛицаОрганизаций.ДатаОкончания
			|		КОНЕЦ > &ТекущаяДата
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|ВЫБРАТЬ 
			|	Сотрудники.Ссылка КАК СотрудникСсылка
			|ИЗ
			|	РегистрСведений.ОсновныеСотрудники КАК ОсновныеСотрудники
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО (ОсновныеСотрудники.Сотрудник = Сотрудники.Ссылка)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АБ_ОтветственныеЛицаОрганизаций КАК АБ_ОтветственныеЛицаОрганизаций
			|		ПО (ОсновныеСотрудники.ФизическоеЛицо = АБ_ОтветственныеЛицаОрганизаций.ФизическоеЛицо)
			|ГДЕ
			|	АБ_ОтветственныеЛицаОрганизаций.Владелец = &Организация
			|	И АБ_ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ""Руководитель""
			|	И АБ_ОтветственныеЛицаОрганизаций.ДолжностьСсылка = &ДолжностьДиректор
			|	И АБ_ОтветственныеЛицаОрганизаций.ДатаНачала < &ТекущаяДата
			|	И ВЫБОР
			|			КОГДА АБ_ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ДАТАВРЕМЯ(2500, 1, 1)
			|			ИНАЧЕ АБ_ОтветственныеЛицаОрганизаций.ДатаОкончания
			|		КОНЕЦ > &ТекущаяДата";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() тогда
				ТекущиеДанные.Подписал = Выборка.СотрудникСсылка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// --- Миляев (293293) 2026-02-19

&НаСервере
&ИзменениеИКонтроль("УстановитьДоступностьПоЭП")
Процедура АБ_УстановитьДоступностьПоЭП()

	УстановитьТолькоПросмотр = Объект.ПодписанЭП
	Или КопироватьПодписиЭП; // При копировании ЭП тоже нужно защищать поля от изменений

	ИспользоватьСостоянияДокументов = ПолучитьФункциональнуюОпцию("ИспользоватьСостоянияДокументов");
	ДоступныПолныеПрава = РольДоступна("ПолныеПрава");
	УстановитьДоступностьПоСостояниюНеРаботает = ДоступныПолныеПрава ИЛИ НЕ ИспользоватьСостоянияДокументов;

	// если не ПодписанЭП - делаем доступными ключевые поля - только для роли ПолныеПрава
	// - для неполных прав сработает УстановитьДоступностьПоСостоянию
	Если Объект.ПодписанЭП Или (НЕ Объект.ПодписанЭП И УстановитьДоступностьПоСостояниюНеРаботает) Тогда

		МассивИмен = Справочники.ДокументыПредприятия.ПолучитьИменаКлючевыхРеквизитов();

		ПрефиксОбъекта = "Объект.";
		МассивИменСОбъектом = Новый Массив;
		Для Каждого ИмяПоля Из МассивИмен Цикл
			ИмяСОбъектом = ПрефиксОбъекта + ИмяПоля;
			Если ИмяПоля = "Файлы" Тогда
				МассивИменСОбъектом.Добавить(ИмяПоля);
			Иначе
				МассивИменСОбъектом.Добавить(ИмяСОбъектом);
			КонецЕсли;
		КонецЦикла;

		ЭлементыДляИмен = Новый Массив;
		ЭлементыДляИмен.Добавить(Элементы.Заголовок);
		ЭлементыДляИмен.Добавить(Элементы.Содержание);
		ЭлементыДляИмен.Добавить(Элементы.Организация);
		ЭлементыДляИмен.Добавить(Элементы.Сумма);
		ЭлементыДляИмен.Добавить(Элементы.Валюта);
		ЭлементыДляИмен.Добавить(Элементы.Файлы);
		ЭлементыДляИмен.Добавить(Элементы.ФайлыСоздание);
		ЭлементыДляИмен.Добавить(Элементы.СтороныСторона);
		ЭлементыДляИмен.Добавить(Элементы.СтороныПодписан);
		ЭлементыДляИмен.Добавить(Элементы.СтороныПодписал);
		ЭлементыДляИмен.Добавить(Элементы.СтороныДатаПодписи);

		Для Каждого Элем Из ЭлементыДляИмен Цикл

			Если ТипЗнч(Элем) = Тип("ПолеФормы") ИЛИ ТипЗнч(Элем) = Тип("ТаблицаФормы") Тогда

				Если МассивИменСОбъектом.Найти(Элем.ПутьКДанным) <> Неопределено Тогда
					Если Элем.ПутьКДанным = "Файлы" Тогда 
						Элем.ИзменятьСоставСтрок = Не УстановитьТолькоПросмотр;
					Иначе
						Элем.ТолькоПросмотр = УстановитьТолькоПросмотр;
					КонецЕсли;	
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;
		#Вставка
		//++dar 29.04.26 (326008)
		Элементы.СтороныПодписан.ТолькоПросмотр = Истина;
		Элементы.СтороныДатаПодписи.ТолькоПросмотр = Истина;
		//--dar 29.04.26 (326008)
		#КонецВставки

	КонецЕсли;

КонецПроцедуры

&НаСервере
&После("ПриИзмененииДатыРегистрации")
Процедура АБ_ПриИзмененииДатыРегистрации()
	//++dar 29.04.26 (326008)
	Для Каждого ТекущаяСторона Из Объект.Стороны Цикл
		ТекущаяСторона.ДатаПодписи = Объект.ДатаРегистрации;
	КонецЦикла;
	//--dar 29.04.26 (326008)
КонецПроцедуры

//++dar 30.04.26 (326008)
&НаКлиенте
Процедура ПересчитатьСуммуНДС()
	
	СтруктураПересчетаСуммы = Новый Структура;
	СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
	СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Объект.УВМ_НалогообложениеНДС);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);

	ПересчитатьСуммуНДСВСтрокеТЧ(Объект, СтруктураДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий) 
	
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДС", СтруктураПараметровДействия) Тогда
		
		НалогообложениеНДС = Неопределено;
		СтруктураПараметровДействия.Свойство("НалогообложениеНДС", НалогообложениеНДС);
		
		СтавкаНДС = Неопределено;
		Если Не СтруктураПараметровДействия.Свойство("СтавкаНДС", СтавкаНДС) Тогда
			СтавкаНДС = ТекущаяСтрока.УВМ_СтавкаНДС;
		КонецЕсли;
		
		ТекПроцентНДС = Неопределено;
		Если ТекПроцентНДС = Неопределено Тогда
			ТекПроцентНДС = УВМ_КлиентСервер.ЗначениеСтавкиНДС(СтавкаНДС);
		КонецЕсли;
		
		ТекущаяСтрока.СуммаНДС = УВМ_КлиентСервер.РассчитатьСуммуНДС(
			ТекущаяСтрока.Сумма,
			ТекПроцентНДС,
			СтруктураПараметровДействия.ЦенаВключаетНДС,
			НалогообложениеНДС);
	КонецЕсли;
	
КонецПроцедуры
//--dar 30.04.26 (326008)

//++dar 04.05.26 (326149)
Процедура УВМ_ПриИзмененииВидаДокумента()
	
	РеквизитыВидаДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ВидДокумента, "УВМ_ВариантыДоговоров, УВМ_ТипКонтрагента, УВМ_СкрыватьПолеТипНеустойки");
	ВыборкаВариантыДоговоров = РеквизитыВидаДокумента.УВМ_ВариантыДоговоров.Выбрать();
	Элементы.УВМ_ВариантДоговора.СписокВыбора.Очистить();
	
	Пока ВыборкаВариантыДоговоров.Следующий() Цикл
		Элементы.УВМ_ВариантДоговора.СписокВыбора.Добавить(ВыборкаВариантыДоговоров.ВариантДоговора);
	КонецЦикла;
	
	Если Элементы.УВМ_ВариантДоговора.СписокВыбора.Количество() = 0 Тогда
		Для Каждого ТекущийВариант Из Перечисления.УВМ_ВариантыДоговоров Цикл
			Элементы.УВМ_ВариантДоговора.СписокВыбора.Добавить(ТекущийВариант);
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) ИЛИ Элементы.УВМ_ВариантДоговора.СписокВыбора.НайтиПоЗначению(Объект.УВМ_ВариантДоговора) = Неопределено Тогда
		Объект.УВМ_ВариантДоговора = Неопределено;
		Если Элементы.УВМ_ВариантДоговора.СписокВыбора.Количество() = 1 Тогда
			Объект.УВМ_ВариантДоговора = Элементы.УВМ_ВариантДоговора.СписокВыбора[0].Значение;
		КонецЕсли;                                
	КонецЕсли;

	ЭтотОбъект.УВМ_ТипКонтрагента = РеквизитыВидаДокумента.УВМ_ТипКонтрагента;
	
	//++dar 01.06.26 (330575)
	Элементы.УВМ_ТипНеустойки.Видимость = НЕ (РеквизитыВидаДокумента.УВМ_СкрыватьПолеТипНеустойки = Истина);
	Элементы.УВМ_ПроцентНеустойки.Видимость = НЕ (РеквизитыВидаДокумента.УВМ_СкрыватьПолеТипНеустойки = Истина);
	//--dar 01.06.26 (330575)
	
КонецПроцедуры
//--dar 04.05.26 (326149)

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	//++dar 18.03.26 (317077)
	Если Объект.УВМ_НалогообложениеНДСОпределяетсяВДокументе Тогда
		ЭтотОбъект.РежимНалогообложения = 1;
	Иначе
		ЭтотОбъект.РежимНалогообложения = 0;
	КонецЕсли;
	
	УВМ_УстановитьСписокВыбораНалогообложенияНДС();

	УстановитьСвойстваЭлементовНалогообложенияИРаздельногоУчетаНДС(ЭтотОбъект.ТипДоговораЕРП);
	//--dar 18.03.26 (317077)
КонецПроцедуры

//++dar 18.03.26 (317077)
&НаСервере
Процедура ЗаполнитьСписокСтавокНДС(ПолеФормыСтавкаНДС)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиНДС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	НЕ СтавкиНДС.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПолеФормыСтавкаНДС.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры
//--dar 18.03.26 (317077)

&НаКлиенте
&ИзменениеИКонтроль("СтороныПриАктивизацииЯчейки")
Процедура АБ_СтороныПриАктивизацииЯчейки(Элемент)

	ТекущиеДанные = Элементы.Стороны.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	РаботаСПодписямиДокументовКлиент.СтороныПриАктивизацииЯчейки(ЭтаФорма, Элементы, ТекущиеДанные);
	#Вставка
	//++GIV 02042026 (320030)
	Если ТипЗнч(ТекущиеДанные.Сторона) = Тип("СправочникСсылка.Организации") И ЗначениеЗаполнено(ТекущиеДанные.Сторона) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтороныПодписал", "КнопкаВыбора", Ложь);
		Элементы.СтороныПодписал.КнопкаВыбора = Ложь;
		Элементы.СтороныПодписал.КнопкаВыпадающегоСписка = Истина;
		Элементы.СтороныПодписал.КнопкаСоздания = Ложь;
		Элементы.СтороныПодписал.СписокВыбора.ЗагрузитьЗначения(ВозможныеПодписантыОрганизации(ТекущиеДанные.Сторона, Объект.Тематика, Объект.Ответственный));
	Иначе
		Элементы.СтороныПодписал.КнопкаВыбора = Истина;
		Элементы.СтороныПодписал.КнопкаСоздания = Неопределено;
		Элементы.СтороныПодписал.СписокВыбора.Очистить();
	КонецЕсли;
	//--GIV 02042026 (320030)
    #КонецВставки
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВозможныеПодписантыОрганизации(Организация, Тематика, Ответственный)
	
	//++dar 06.05.26 (327054)
	МассивПодписантов = Новый Массив;
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Возврат МассивПодписантов;
	КонецЕсли;
	
	Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный, "Подразделение");
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		Возврат МассивПодписантов;
	КонецЕсли;
	
	ЭтоВходящий = Ложь;
	Если ЗначениеЗаполнено(Тематика) Тогда
		ЭтоВходящий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тематика, "АБ_ВходящиеДокументы");
	КонецЕсли;
	
	МассивПодразделений = Новый Массив;
	ТекущееПодразделение = Подразделение;
	Пока ЗначениеЗаполнено(ТекущееПодразделение) Цикл
		МассивПодразделений.Добавить(ТекущееПодразделение);
		ТекущееПодразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущееПодразделение, "Родитель");
	КонецЦикла;
	Если МассивПодразделений.Количество() = 0 Тогда
		Возврат МассивПодписантов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|    СтруктураПредприятия.Ссылка КАК Подразделение,
	|    СтруктураПредприятия.Руководитель КАК Руководитель
	|ПОМЕСТИТЬ втПодразделения
	|ИЗ
	|    Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|    СтруктураПредприятия.Ссылка В (&МассивПодразделений)
	|    И СтруктураПредприятия.Руководитель <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    втПодразделения.Руководитель КАК Сотрудник
	|ПОМЕСТИТЬ втПодписанты
	|ИЗ
	|    втПодразделения КАК втПодразделения
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|        ПО втПодразделения.Руководитель = Сотрудники.Ссылка
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АБ_ПраваИОснованияПравилПодписиДокументов КАК Права
	|        ПО Сотрудники.Владелец = Права.ФизическоеЛицо
	|ГДЕ
	|    Сотрудники.Действует
	|    И НЕ Сотрудники.ПометкаУдаления
	|    И Права.Организация = &Организация
	|    И (&ЭтоВходящий
	|            И Права.ПравоПодписиВходящихДокументов
	|        ИЛИ НЕ &ЭтоВходящий
	|            И Права.ПравоПодписиИсходящихДокументов)
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка
	|ИЗ
	|	втПодразделения КАК втПодразделения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО втПодразделения.Подразделение = Сотрудники.Подразделение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АБ_ПраваИОснованияПравилПодписиДокументов КАК Права
	|		ПО (Сотрудники.Владелец = Права.ФизическоеЛицо)
	|ГДЕ
	|	Сотрудники.Действует
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И Права.Организация = &Организация
	|	И (&ЭтоВходящий
	|				И Права.ПравоПодписиВходящихДокументов
	|			ИЛИ НЕ &ЭтоВходящий
	|				И Права.ПравоПодписиИсходящихДокументов)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	Сотрудники.Ссылка
	|ИЗ
	|	РегистрСведений.ОсновныеСотрудники КАК ОсновныеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО (ОсновныеСотрудники.Сотрудник = Сотрудники.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АБ_ОтветственныеЛицаОрганизаций КАК АБ_ОтветственныеЛицаОрганизаций
	|		ПО (ОсновныеСотрудники.ФизическоеЛицо = АБ_ОтветственныеЛицаОрганизаций.ФизическоеЛицо)
	|ГДЕ
	|	АБ_ОтветственныеЛицаОрганизаций.Владелец = &Организация
	|	И АБ_ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ""Руководитель""
	|	И АБ_ОтветственныеЛицаОрганизаций.ДолжностьСсылка = &ДолжностьДиректор
	|	И АБ_ОтветственныеЛицаОрганизаций.ДатаНачала < &ТекущаяДата
	|	И ВЫБОР
	|			КОГДА АБ_ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДАТАВРЕМЯ(2500, 1, 1)
	|			ИНАЧЕ АБ_ОтветственныеЛицаОрганизаций.ДатаОкончания
	|		КОНЕЦ > &ТекущаяДата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	| ОтветственныеЛица.Сотрудник
	|ИЗ
	| РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(, Организация = &Организация) КАК ОтветственныеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	| втПодписанты.Сотрудник КАК Сотрудник
	|ИЗ
	| втПодписанты КАК втПодписанты
	|
	|УПОРЯДОЧИТЬ ПО
	| Сотрудник.Наименование";	
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДолжностьДиректор", СокрЛП(АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","Должность_Директор"),Неопределено)));
	Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЭтоВходящий", ЭтоВходящий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивПодписантов.Добавить(Выборка.Сотрудник);
	КонецЦикла;
	
	Возврат МассивПодписантов;
	//--dar 06.05.26 (327054)

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("СтороныПодписалОбработкаВыбора")
Процедура АБ_СтороныПодписалОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.Стороны.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда

		Если Не ЗначениеЗаполнено(ТекущиеДанные.Сторона)
			ИЛИ (ЗначениеЗаполнено(ТекущиеДанные.Сторона) И ТипЗнч(ТекущиеДанные.Сторона) = Тип("СправочникСсылка.Контрагенты")) Тогда
			ТекущиеДанные.Сторона = РаботаСОрганизациями.ОрганизацияПоУмолчанию();
		КонецЕсли;	

		ТекущиеДанные.Подписал = ВыбранноеЗначение;   
		#Вставка
		//++GIV 03042026 (320030)
		ТекущиеДанные.УВМ_Основание = "";
		//--GIV 03042026 (320030)
		#КонецВставки

	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КонтактныеЛица") Тогда

		Контрагент = ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Владелец");
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Сторона)
			ИЛИ Контрагент <> ТекущиеДанные.Сторона Тогда
			ТекущиеДанные.Сторона = Контрагент;
		КонецЕсли;
		ТекущиеДанные.Подписал = ВыбранноеЗначение;

	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда

		Если РаботаСПодписямиДокументовКлиентСервер.ЭтоОрганизация(ТекущиеДанные.Сторона)
			И ПодписантыИзДействий.Количество() Тогда
			Возврат;
		КонецЕсли;

		ТекущиеДанные.Подписал = ВыбранноеЗначение;

	КонецЕсли;

	Модифицированность = Истина;

	УстановитьПараметрыТаблицыСтороны(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СтороныПодписалАвтоПодбор")
Процедура АБ_СтороныПодписалАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	#Вставка
	//++GIV 03042026 (320030)
	ТекущиеДанные = Элементы.Стороны.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТипЗнч(ТекущиеДанные.Сторона) = Тип("СправочникСсылка.Организации") Тогда
		СтандартнаяОбработка = Ложь;
		Текст = "";		
		Возврат;
	КонецЕсли;
	//--GIV 03042026 (320030)
	#КонецВставки
	СтороныПодписалАвтоПодборОкончаниеВводаТекста(Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
&После("ДействияОтправитьЗавершение")
Процедура АБ_ДействияОтправитьЗавершение(Результат, Параметры)

	//++dar 17.04.26 (323881)
	Если Результат.Свойство("ПрерванПроцесс") И Результат.ПрерванПроцесс Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Тематика) Тогда
		РеквизитыТематики = ОбщегоНазначенияДокументооборотВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Тематика, "УВМ_ОтправитьДоговорКонтрагенту, УВМ_СформироватьДоговорВЕРП");
		
		Если РеквизитыТематики.УВМ_СформироватьДоговорВЕРП Тогда
			АБ_ВызовСервера.СоздатьДоговорВоВнешнейБазе(Объект.Ссылка);
		КонецЕсли;
		
		Если Объект.ФормаДокумента = ПредопределенноеЗначение("Перечисление.ВариантыФормДокументов.Бумажная") И РеквизитыТематики.УВМ_ОтправитьДоговорКонтрагенту Тогда
			УВМ_ОбщиеДоработкиКлиент.УВМ_ПрикрепитьФайлPDF(Объект.Ссылка);
			УВМ_ОбщиеДоработкиКлиент.УВМ_СформироватьИОтправитьПисьмаКлиентам(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));			
		КонецЕсли;
	КонецЕсли; 
	//--dar 17.04.26 (323881)
	
КонецПроцедуры
#КонецОбласти
