
&После("ПриНачальномЗаполненииЭлементов")
Процедура АБ_ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти)
	//++dar 01.06.26 (330575)
	// Группа-владелец контактной информации справочника "Объекты аренды".
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СправочникУВМ_ОбъектыАренды";
	Элемент.ЭтоГруппа    = Истина;
	Элемент.Используется = Истина;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
		МодульМультиязычностьСервер = ОбщегоНазначения.ОбщийМодуль("МультиязычностьСервер");
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Контактная информация справочника ""Объекты аренды""'", КодыЯзыков); // @НСтр-1
	Иначе
		Элемент.Наименование = НСтр("ru = 'Контактная информация справочника ""Объекты аренды""'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	// Вид контактной информации "Адрес".
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных          = "АдресОбъектаАренды";
	Элемент.Тип                                = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Элемент.Родитель                           = Справочники.ВидыКонтактнойИнформации.СправочникУВМ_ОбъектыАренды;
	Элемент.ИдентификаторДляФормул             = "Адрес";
	Элемент.ВидРедактирования                  = "Диалог";
	Элемент.МожноИзменятьСпособРедактирования  = Истина;
	Элемент.РазрешитьВводНесколькихЗначений    = Ложь;
	Элемент.ОтображатьВсегда                   = Истина;
	Элемент.Используется                       = Истина;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Мультиязычность") Тогда
		МодульМультиязычностьСервер = ОбщегоНазначения.ОбщийМодуль("МультиязычностьСервер");
		МодульМультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Адрес'", КодыЯзыков); // @НСтр-1
	Иначе
		Элемент.Наименование = НСтр("ru = 'Адрес'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	//--dar 01.06.26 (330575)
КонецПроцедуры
