#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Записать данные.
// 
// Параметры:
//  СоответствиеВидовДокументов - ТаблицаЗначений
Процедура ЗаписатьДанные(СоответствиеВидовДокументов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Набор = СоздатьНаборЗаписей();
	Набор.Загрузить(СоответствиеВидовДокументов);
	Набор.Записать(Истина);
	
КонецПроцедуры	

// Вид формализованного документа.
// 
// Параметры:
//  ТипФормализованногоДокумента - ПеречислениеСсылка.ТипыФормализованныхДокументов
// 
// Возвращаемое значение:
//  Неопределено, Структура - Вид формализованного документа:
// * ВидДокумента - СправочникСсылка.ВидыДокументов - 
// * Тематика - СправочникСсылка.ТематикиДокументов - 
Функция ВидФормализованногоДокумента(ТипФормализованногоДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	СоответствиеВидовРаспознаваемыхДокументов.ВидДокумента,
		|	СоответствиеВидовРаспознаваемыхДокументов.Тематика
		|ИЗ
		|	РегистрСведений.СоответствиеВидовРаспознаваемыхДокументов КАК СоответствиеВидовРаспознаваемыхДокументов
		|ГДЕ
		|	СоответствиеВидовРаспознаваемыхДокументов.ТипФормализованногоДокумента = &ТипДокумента");

	Запрос.УстановитьПараметр("ТипДокумента", ТипФормализованногоДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ВидДокумента, Тематика", Выборка.ВидДокумента, Выборка.Тематика);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Соответствие видов распознаваемых документов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Соответствие видов распознаваемых документов
Функция СоответствиеВидовРаспознаваемыхДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	СоответствиеВидовРаспознаваемыхДокументов.ТипФормализованногоДокумента,
		|	СоответствиеВидовРаспознаваемыхДокументов.ВидДокумента,
		|	СоответствиеВидовРаспознаваемыхДокументов.Тематика
		|ИЗ
		|	РегистрСведений.СоответствиеВидовРаспознаваемыхДокументов КАК СоответствиеВидовРаспознаваемыхДокументов
		|");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли