
&ИзменениеИКонтроль("ОписаниеHTMLПосле")
Функция АБ_ОписаниеHTMLПосле_ИК(ЗадачаОбъект, ТекущееДействиеЗадачи, КешДанных, ВключатьНавигационныеСсылки, КодЯзыка)

	УстановитьПривилегированныйРежим(Истина);

	ТекстКонцаHTML = "";

	КэшОбластиПросмотра = КэшиНаВремяВызоваПовтИсп.КэшЗадачаОбластьПросмотра();

	Если КэшОбластиПросмотра.Заполнен И КэшОбластиПросмотра.ДействиеЗадачи = ТекущееДействиеЗадачи Тогда
		ИсточникДействияЗадачи = КэшОбластиПросмотра.РеквизитыДействияЗадачи.Источник;
	Иначе
		ИсточникДействияЗадачи = РаботаСЗадачами.ИсточникДействияЗадачи(ТекущееДействиеЗадачи);
	КонецЕсли;

	Если ЗначениеЗаполнено(ИсточникДействияЗадачи)
		И ТипЗнч(ИсточникДействияЗадачи) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда

		РеквизитыИсточника = Неопределено;
		Если КешДанных <> Неопределено И КешДанных.Свойство("ДанныеЗадачИсполнителей") Тогда
			РеквизитыИсточника = КешДанных.ДанныеЗадачИсполнителей[ИсточникДействияЗадачи];
		КонецЕсли;
		Если РеквизитыИсточника = Неопределено Тогда
			РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ИсточникДействияЗадачи,
			"БизнесПроцесс, Предметы, ТочкаМаршрута");
		КонецЕсли;

		// Обзор предмета.
		ПредметыИсточника = РеквизитыИсточника.Предметы.Выгрузить();
		ПредметыИсточника.Сортировать("НомерСтроки Возр");

		ПредметДокумент = ОбзорЗадач.ПолучитьОсновнойПредметДокумент(ПредметыИсточника);
		Если ЗначениеЗаполнено(ПредметДокумент) Тогда

			ДанныеПредмета = Неопределено;
			Если КешДанных <> Неопределено И КешДанных.Свойство("ДанныеПредметов") Тогда
				ДанныеПредмета = КешДанных.ДанныеПредметов[ПредметДокумент];
			КонецЕсли;
			Если ДанныеПредмета <> Неопределено Тогда
				ОбзорПредмета = ДанныеПредмета.Обзор;
			Иначе
				ОбзорПредмета = ОбзорЗадач.ПолучитьОбзорПредметаЗадачи(ПредметДокумент, КешДанных, КодЯзыка);
			КонецЕсли;

			Если Не ПустаяСтрока(ОбзорПредмета) Тогда
				ТекстКонцаHTML = ТекстКонцаHTML + "<p>" + ОбзорПредмета + "</p>";
			КонецЕсли;

		КонецЕсли;

		ПредметМероприятие = ОбзорЗадач.ПолучитьОсновнойПредметМероприятие(ПредметыИсточника);
		Если ЗначениеЗаполнено(ПредметМероприятие) Тогда

			ДанныеПредмета = Неопределено;
			Если КешДанных <> Неопределено И КешДанных.Свойство("ДанныеПредметов") Тогда
				ДанныеПредмета = КешДанных.ДанныеПредметов[ПредметДокумент];
			КонецЕсли;
			Если ДанныеПредмета <> Неопределено Тогда
				ОбзорПредмета = ДанныеПредмета.Обзор;
			Иначе
				ОбзорПредмета = ОбзорЗадач.ПолучитьОбзорПредметаЗадачиМероприятия(ПредметМероприятие, КешДанных, КодЯзыка);
			КонецЕсли;

			Если Не ПустаяСтрока(ОбзорПредмета) Тогда
				ТекстКонцаHTML = ТекстКонцаHTML + "<p>" + ОбзорПредмета + "</p>";
			КонецЕсли;

		КонецЕсли;

		// Обзор задачи, специфичный для процесса.
		Попытка

			МенеджерШаблона = ОбщегоНазначения.МенеджерОбъектаПоСсылке(РеквизитыИсточника.БизнесПроцесс);
			МенеджерШаблона.ЗаполнитьОбзорЗадачи(
			ТекстКонцаHTML,
			РеквизитыИсточника.БизнесПроцесс,
			РеквизитыИсточника.ТочкаМаршрута,
			ИсточникДействияЗадачи,
			ВключатьНавигационныеСсылки,
			КодЯзыка);

		Исключение

			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			СобытиеЖурналаРегистрации = РаботаСЗадачами.СобытиеЖурналаРегистрации();
			КомментарийЖурналаРегистрации = СтрШаблон(
			"%1:
			|%2",
			НСтр("ru = 'Не удалось заполнить обзор задачи по данным процесса'"),
			ПодробноеПредставлениеОшибки);

			ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации,
			УровеньЖурналаРегистрации.Ошибка,,,
			КомментарийЖурналаРегистрации);

		КонецПопытки;

		ТекстКонцаHTML = СокрЛП(ТекстКонцаHTML);
		Если Не ЗначениеЗаполнено(ТекстКонцаHTML) Тогда
			ТекстКонцаHTML = Неопределено;
		КонецЕсли;

	Иначе

		Если ЗадачаОбъект.Приложения.Количество() = 1
			И ТипЗнч(ЗадачаОбъект.Приложения[0].Приложение) = Тип("СправочникСсылка.ДокументыПредприятия") Тогда

			ПредметДокумент = ЗадачаОбъект.Приложения[0].Приложение;

		Иначе

			ПредметДокумент = Неопределено;

		КонецЕсли;

		Если ЗначениеЗаполнено(ПредметДокумент) Тогда

			Если КешДанных <> Неопределено И КешДанных.Свойство("ДанныеПредметов") Тогда
				ДанныеПредмета = КешДанных.ДанныеПредметов[ПредметДокумент];
			КонецЕсли;
			Если ДанныеПредмета <> Неопределено Тогда
				ОбзорПредмета = ДанныеПредмета.Обзор;
			Иначе
				ОбзорПредмета = ОбзорЗадач.ПолучитьОбзорПредметаЗадачи(ПредметДокумент, КешДанных, КодЯзыка);
			КонецЕсли;

			Если Не ПустаяСтрока(ОбзорПредмета) Тогда
				ТекстКонцаHTML = ТекстКонцаHTML + "<p>" + ОбзорПредмета + "</p>";
			КонецЕсли;

		КонецЕсли;

		Если ЗадачаОбъект.Приложения.Количество() = 1
			И ТипЗнч(ЗадачаОбъект.Приложения[0].Приложение) = Тип("СправочникСсылка.Мероприятия") Тогда

			ПредметМероприятие = ЗадачаОбъект.Приложения[0].Приложение;

		Иначе

			ПредметМероприятие = Неопределено;

		КонецЕсли;

		Если ЗначениеЗаполнено(ПредметМероприятие) Тогда

			Если КешДанных <> Неопределено И КешДанных.Свойство("ДанныеПредметов") Тогда
				ДанныеПредмета = КешДанных.ДанныеПредметов[ПредметДокумент];
			КонецЕсли;
			Если ДанныеПредмета <> Неопределено Тогда
				ОбзорПредмета = ДанныеПредмета.Обзор;
			Иначе
				ОбзорПредмета = ОбзорЗадач.ПолучитьОбзорПредметаЗадачиМероприятия(ПредметМероприятие, КешДанных, КодЯзыка);
			КонецЕсли;

			Если Не ПустаяСтрока(ОбзорПредмета) Тогда
				ТекстКонцаHTML = ТекстКонцаHTML + "<p>" + ОбзорПредмета + "</p>";
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	ТекстКонцаHTML = СокрЛП(ТекстКонцаHTML);
	Если Не ЗначениеЗаполнено(ТекстКонцаHTML) Тогда
		ТекстКонцаHTML = Неопределено;
	КонецЕсли;
	
	#Вставка
	// +++ Миляев (295800) 2026-01-23
	ТекстКонцаHTML = СтрШаблон("%1%2",ТекстКонцаHTML,АБ_ВызовСервера.ПолучитьТекстHTMLПоВнешнимНавигационнымСсылкам(ЗадачаОбъект));
	// --- Миляев (295800) 2026-01-23
	#КонецВставки
	
	
	Возврат ТекстКонцаHTML;

КонецФункции
