
&ИзменениеИКонтроль("УстановитьВидимостьКомандОбработки")
Процедура АБ_УстановитьВидимостьКомандОбработки(Форма, ОбъектОбработки, Параметры)

	Элементы = Форма.Элементы;
	Состояние = Неопределено;
	ТекущийПользователь = Форма.ТекущийПользователь;
	ИспользоватьВизыСогласования = ПолучитьФункциональнуюОпцию("ИспользоватьВизыСогласования");
	ТекущаяОбработкаОбъекта = Справочники.ОбработкиОбъектов.ОбработкаОбъекта(ОбъектОбработки);

	Если Элементы.Найти("ГруппаСостояниеОбработки") <> Неопределено Тогда

		ДатаИзмененияСостоянияОбработки = Неопределено;
		ДатаНачалаОбработки = Неопределено;
		Состояние = ТекущееСостояниеОбработки(
		ОбъектОбработки, ДатаИзмененияСостоянияОбработки, ДатаНачалаОбработки, ТекущаяОбработкаОбъекта);

		Элементы.ДекорацияСостояния.Видимость = Ложь;
		Элементы.ДекорацияОписание.Видимость = Истина;
		Элементы.ДекорацияОписание.Заголовок = НСтр("ru = 'Не запущена'");
		Элементы.ДекорацияОписание.Подсказка = Элементы.ДекорацияОписание.Заголовок;

		Если Элементы.Найти("ДействияОтправить") <> Неопределено Тогда
			Элементы.ДействияОтправить.Видимость = Форма.КоличествоДействий <> 0;
		КонецЕсли;
		#Вставка
		//++dar 26.11.25 (296038)
		Если Элементы.Найти("УВМ_ДействияОтправить") <> Неопределено Тогда
			Элементы.УВМ_ДействияОтправить.Видимость = Форма.КоличествоДействий <> 0;
		КонецЕсли;
		//--dar 26.11.25 (296038)
		#КонецВставки

		Форма.СостояниеОбработки = Состояние;
		Элементы.ДекорацияОшибкаДействия.Видимость = Ложь;

		Если Элементы.Найти("ДействияПерезапуститьОбработку") <> Неопределено Тогда
			Элементы.ДействияПерезапуститьОбработку.Видимость = Ложь;
		КонецЕсли;	

		Если Элементы.Найти("ДействияПечатьЛистСогласования") <> Неопределено
			И Элементы.Найти("ПечатьЛистСогласованияСИсторией") <> Неопределено Тогда

			Элементы.ДействияПечатьЛистСогласования.Видимость = Параметры.ЕстьДействияСогласования И ИспользоватьВизыСогласования;
			Элементы.ПечатьЛистСогласованияСИсторией.Видимость = Параметры.ЕстьДействияСогласования И ИспользоватьВизыСогласования;

		КонецЕсли;
		Если Элементы.Найти("ЛистОзнакомления") <> Неопределено Тогда
			Элементы.ЛистОзнакомления.Видимость = Параметры.ЕстьДействияОзнакомления;
		КонецЕсли;
		Если Элементы.Найти("ХодОзнакомления") <> Неопределено Тогда
			Элементы.ХодОзнакомления.Видимость = Параметры.ЕстьДействияОзнакомленияЗапущенные;
		КонецЕсли;

		Если Элементы.Найти("ДействияПротоколРазногласий") <> Неопределено Тогда
			Элементы.ДействияПротоколРазногласий.Видимость 
			= ДействиеЗавершеноОтрицательноИЕстьЗамечания(Форма.ДействиеСогласованияВРежимеЗамечаний);
		КонецЕсли;

		Если Элементы.Найти("ДействияЗамечанияСогласования") <> Неопределено Тогда
			Элементы.ДействияЗамечанияСогласования.Видимость = 
			Параметры.ЕстьАктивноеИлиЗавершенноеДействиеСогласованияВРежимеЗамечаний;
		КонецЕсли;
		Если Элементы.Найти("ДействияОстановить") <> Неопределено Тогда
			Элементы.ДействияОстановить.Видимость = Ложь;
		КонецЕсли;
		#Вставка
		//++dar 26.11.25 (296038)
		Если Элементы.Найти("УВМ_ДействияОстановить") <> Неопределено Тогда
			Элементы.УВМ_ДействияОстановить.Видимость = Ложь;
		КонецЕсли;
		//--dar 26.11.25 (296038)
		#КонецВставки

		Если Элементы.Найти("ДекорацияОтступСостояния") <> Неопределено Тогда
			Элементы.ДекорацияОтступСостояния.Видимость = Ложь;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Состояние)
			Или Состояние = Перечисления.СостоянияОбработкиОбъектов.Прервана Тогда

			Если (Форма.КоличествоДействий <> 0) И (Параметры.ЕстьЗавершенныеДействияБезОбработки = Ложь) Тогда

				Если Элементы.Найти("ДействияОтправить") <> Неопределено Тогда
					Элементы.ДействияОтправить.Заголовок = НСтр("ru = 'Начать обработку'");
					Если ТипЗнч(Параметры.ВидОбъекта) = Тип("СправочникСсылка.ВидыДокументов")Тогда	
						Подсказка = НСтр("ru = 'Начать обработку документа'");
					Иначе
						Подсказка = НСтр("ru = 'Начать обработку мероприятия'");
					КонецЕсли;

					Если ТипЗнч(Элементы.ДействияОтправить) = Тип("КнопкаФормы") Тогда
						Форма.Команды[Элементы.ДействияОтправить.ИмяКоманды].Подсказка = Подсказка;
					Иначе
						Элементы.ДействияОтправить.Подсказка = Подсказка;
					КонецЕсли;
				КонецЕсли;

				Если Элементы.Найти("ДействияОтправить") <> Неопределено Тогда
					Элементы.ДействияОтправить.Отображение = ОтображениеКнопки.КартинкаИТекст;
					Элементы.ДействияОтправить.Картинка = БиблиотекаКартинок.СформироватьОтчет;
				КонецЕсли;
				#Вставка
				//++dar 26.11.25 (296038)
				Если Элементы.Найти("УВМ_ДействияОтправить") <> Неопределено Тогда
					Элементы.УВМ_ДействияОтправить.Заголовок = НСтр("ru = 'Начать обработку'");
					Если ТипЗнч(Параметры.ВидОбъекта) = Тип("СправочникСсылка.ВидыДокументов")Тогда	
						Подсказка = НСтр("ru = 'Начать обработку документа'");
					Иначе
						Подсказка = НСтр("ru = 'Начать обработку мероприятия'");
					КонецЕсли;

					Если ТипЗнч(Элементы.УВМ_ДействияОтправить) = Тип("КнопкаФормы") Тогда
						Форма.Команды[Элементы.УВМ_ДействияОтправить.ИмяКоманды].Подсказка = Подсказка;
					Иначе
						Элементы.УВМ_ДействияОтправить.Подсказка = Подсказка;
					КонецЕсли;
				КонецЕсли;

				Если Элементы.Найти("УВМ_ДействияОтправить") <> Неопределено Тогда
					Элементы.УВМ_ДействияОтправить.Отображение = ОтображениеКнопки.КартинкаИТекст;
					Элементы.УВМ_ДействияОтправить.Картинка = БиблиотекаКартинок.СформироватьОтчет;
				КонецЕсли;
				//--dar 26.11.25 (296038)
				#КонецВставки

				// нет действий	
			ИначеЕсли Элементы.Найти("ДействияОтправить") <> Неопределено Тогда
				Элементы.ДействияОтправить.Видимость = Ложь;
				#Вставка
				//++dar 26.11.25 (296038)
				Элементы.УВМ_ДействияОтправить.Видимость = Ложь;
				//--dar 26.11.25 (296038)
				#КонецВставки
			КонецЕсли;
			Элементы.ДекорацияОписание.Видимость = Ложь;

		ИначеЕсли Состояние = Перечисления.СостоянияОбработкиОбъектов.Выполняется 
			Или Состояние = Перечисления.СостоянияОбработкиОбъектов.Остановлена Тогда

			ОбработкаВОчередиНаОстановку = ОбработкаОчередиЗаданийСервер.ОбъектЕстьВОчереди(ТекущаяОбработкаОбъекта, ,
			Перечисления.ТипыЗаданий.ОстановитьОбработку);

			ОбработкаВОчередиНаПродолжение = ОбработкаОчередиЗаданийСервер.ОбъектЕстьВОчереди(ТекущаяОбработкаОбъекта, ,
			Перечисления.ТипыЗаданий.ПродолжитьОбработку);

			Если Элементы.Найти("ДействияОтправить") <> Неопределено Тогда

				Если ЕстьПравоОстановкиОбработки(
					Параметры.ПараметрыОбъектаОбработки,
					ТекущийПользователь) Тогда
					Элементы.ДействияОтправить.Заголовок = НСтр("ru = 'Прервать'");
					Если ТипЗнч(Параметры.ВидОбъекта) = Тип("СправочникСсылка.ВидыДокументов")Тогда	
						Подсказка = НСтр("ru = 'Прервать обработку документа'");
					Иначе
						Подсказка = НСтр("ru = 'Прервать обработку мероприятия'");
					КонецЕсли;
					Если ТипЗнч(Элементы.ДействияОтправить) = Тип("КнопкаФормы") Тогда
						Форма.Команды[Элементы.ДействияОтправить.ИмяКоманды].Подсказка = Подсказка;
					Иначе
						Элементы.ДействияОтправить.Подсказка = Подсказка;
					КонецЕсли;
					#Вставка
					//++dar 26.11.25 (296038)
					Элементы.УВМ_ДействияОтправить.Заголовок = НСтр("ru = 'Прервать'");
					Если ТипЗнч(Параметры.ВидОбъекта) = Тип("СправочникСсылка.ВидыДокументов")Тогда	
						Подсказка = НСтр("ru = 'Прервать обработку документа'");
					Иначе
						Подсказка = НСтр("ru = 'Прервать обработку мероприятия'");
					КонецЕсли;
					Если ТипЗнч(Элементы.УВМ_ДействияОтправить) = Тип("КнопкаФормы") Тогда
						Форма.Команды[Элементы.УВМ_ДействияОтправить.ИмяКоманды].Подсказка = Подсказка;
					Иначе
						Элементы.УВМ_ДействияОтправить.Подсказка = Подсказка;
					КонецЕсли;
					//--dar 26.11.25 (296038)
					#КонецВставки

					Элементы.ДействияОтправить.Отображение = ОтображениеКнопки.Картинка;
					Элементы.ДействияОтправить.Картинка = БиблиотекаКартинок.ПрерватьОбработку;
					#Вставка
					//++dar 26.11.25 (296038)
					Элементы.УВМ_ДействияОтправить.Отображение = ОтображениеКнопки.Картинка;
					Элементы.УВМ_ДействияОтправить.Картинка = БиблиотекаКартинок.ПрерватьОбработку;
					//--dar 26.11.25 (296038)
					#КонецВставки
					Элементы.ДекорацияОтступСостояния.Видимость = Истина;

					Элементы.ДействияОстановить.Видимость = Истина;
					#Вставка
					//++dar 26.11.25 (296038)
					Элементы.УВМ_ДействияОстановить.Видимость = Истина;
					//--dar 26.11.25 (296038)
					#КонецВставки
					Если Состояние = Перечисления.СостоянияОбработкиОбъектов.Выполняется
						И Не ОбработкаВОчередиНаОстановку Тогда 
						Элементы.ДействияОстановить.Заголовок = НСтр("ru = 'На паузу'");
						#Вставка
						//++dar 26.11.25 (296038)
						Элементы.УВМ_ДействияОстановить.Заголовок = НСтр("ru = 'На паузу'");
						//--dar 26.11.25 (296038)
						#КонецВставки
						Если ТипЗнч(Параметры.ВидОбъекта) = Тип("СправочникСсылка.ВидыДокументов")Тогда	
							Подсказка = НСтр("ru = 'Поставить обработку документа на паузу'");
						Иначе
							Подсказка = НСтр("ru = 'Поставить обработку мероприятия на паузу'");
						КонецЕсли;
						Элементы.ДействияОстановить.Картинка = БиблиотекаКартинок.ЗнакПауза;
						#Вставка
						//++dar 26.11.25 (296038)
						Элементы.УВМ_ДействияОстановить.Картинка = БиблиотекаКартинок.ЗнакПауза;
						//--dar 26.11.25 (296038)
						#КонецВставки

					ИначеЕсли Состояние = Перечисления.СостоянияОбработкиОбъектов.Остановлена
						И Не ОбработкаВОчередиНаПродолжение Тогда
						Элементы.ДействияОстановить.Заголовок = НСтр("ru = 'Продолжить'");
						#Вставка
						//++dar 26.11.25 (296038)
						Элементы.УВМ_ДействияОстановить.Заголовок = НСтр("ru = 'Продолжить'");
						//--dar 26.11.25 (296038)
						#КонецВставки
						Элементы.ДекорацияОтступСостояния.Видимость = Истина;
						Если ТипЗнч(Параметры.ВидОбъекта) = Тип("СправочникСсылка.ВидыДокументов")Тогда	
							Подсказка = НСтр("ru = 'Продолжить обработку документа'");
						Иначе
							Подсказка = НСтр("ru = 'Продолжить обработку мероприятия'");
						КонецЕсли;

						Элементы.ДействияОстановить.Картинка = БиблиотекаКартинок.СформироватьОтчет;
						#Вставка
						//++dar 26.11.25 (296038)
						Элементы.УВМ_ДействияОстановить.Картинка = БиблиотекаКартинок.СформироватьОтчет;
						//--dar 26.11.25 (296038)
						#КонецВставки
					Иначе
						Элементы.ДействияОстановить.Видимость = Ложь;
						#Вставка
						//++dar 26.11.25 (296038)
						Элементы.УВМ_ДействияОстановить.Видимость = Ложь;
						//--dar 26.11.25 (296038)
						#КонецВставки
					КонецЕсли;

					Если ТипЗнч(Элементы.ДействияОтправить) = Тип("КнопкаФормы") Тогда
						Форма.Команды[Элементы.ДействияОстановить.ИмяКоманды].Подсказка = Подсказка;
					Иначе
						Элементы.ДействияОстановить.Подсказка = Подсказка;
					КонецЕсли;
					#Вставка
					//++dar 26.11.25 (296038)
					Если ТипЗнч(Элементы.УВМ_ДействияОтправить) = Тип("КнопкаФормы") Тогда
						Форма.Команды[Элементы.УВМ_ДействияОстановить.ИмяКоманды].Подсказка = Подсказка;
					Иначе
						Элементы.УВМ_ДействияОстановить.Подсказка = Подсказка;
					КонецЕсли;
					//--dar 26.11.25 (296038)
					#КонецВставки

				Иначе
					Элементы.ДействияОтправить.Видимость = Ложь; // простой пользователь не может прервать процесс
					Элементы.ДействияОтправить.Заголовок = "";
					Элементы.ДействияОстановить.Видимость = Ложь;
					Если ТипЗнч(Элементы.ДействияОтправить) = Тип("КнопкаФормы") Тогда
						Форма.Команды[Элементы.ДействияОтправить.ИмяКоманды].Подсказка = Элементы.ДействияОтправить.Заголовок;
					Иначе
						Элементы.ДействияОтправить.Подсказка = Элементы.ДействияОтправить.Заголовок;
					КонецЕсли;
					#Вставка
					//++dar 26.11.25 (296038)
					Элементы.УВМ_ДействияОтправить.Видимость = Ложь; // простой пользователь не может прервать процесс
					Элементы.УВМ_ДействияОтправить.Заголовок = "";
					Элементы.УВМ_ДействияОстановить.Видимость = Ложь;
					Если ТипЗнч(Элементы.УВМ_ДействияОтправить) = Тип("КнопкаФормы") Тогда
						Форма.Команды[Элементы.УВМ_ДействияОтправить.ИмяКоманды].Подсказка = Элементы.УВМ_ДействияОтправить.Заголовок;
					Иначе
						Элементы.УВМ_ДействияОтправить.Подсказка = Элементы.УВМ_ДействияОтправить.Заголовок;
					КонецЕсли;
					//--dar 26.11.25 (296038)
					#КонецВставки
				КонецЕсли;
			КонецЕсли;

			ПереместитьДекорациюОписание(Элементы, Элементы.ГруппаСостояниеОбработки, Неопределено, 1, 25);

			Если Состояние = Перечисления.СостоянияОбработкиОбъектов.Выполняется Тогда
				Элементы.ДекорацияСостояния.Картинка = БиблиотекаКартинок.СформироватьОтчет;	
				Если ОбработкаВОчередиНаОстановку Тогда
					ПереместитьДекорациюОписание(Элементы, Элементы.ГруппаКнопкиЗапуска,
					Элементы.ГруппаДействияКомПанель, 0, 0);
					Элементы.ДекорацияСостояния.Картинка = БиблиотекаКартинок.ЗнакПауза;
					Элементы.ДекорацияОписание.Заголовок = Новый ФорматированнаяСтрока(
					НСтр("ru = 'Обработка будет поставлена на паузу.
					|Ожидайте выполнение.'"));
				Иначе
					Элементы.ДекорацияОписание.Заголовок = СтрШаблон(НСтр("ru = 'Обработка начата %1'"),
					Формат(ДатаНачалаОбработки, "ДФ='dd.MM.yyyy HH:mm'"));
				КонецЕсли;
			ИначеЕсли Состояние = Перечисления.СостоянияОбработкиОбъектов.Остановлена Тогда
				Элементы.ДекорацияСостояния.Картинка = БиблиотекаКартинок.ЗнакПауза;
				Если ОбработкаВОчередиНаПродолжение Тогда
					ПереместитьДекорациюОписание(Элементы, Элементы.ГруппаКнопкиЗапуска,
					Элементы.ГруппаДействияКомПанель, 0, 0);
					Элементы.ДекорацияСостояния.Картинка = БиблиотекаКартинок.СформироватьОтчет;
					Элементы.ДекорацияОписание.Заголовок = Новый ФорматированнаяСтрока(
					НСтр("ru = 'Будет выполнено продолжение обработки.
					|Ожидайте выполнение.'"));
				Иначе
					Элементы.ДекорацияОписание.Заголовок = СтрШаблон(НСтр("ru = 'Обработка на паузе с %1'"),
					Формат(ДатаИзмененияСостоянияОбработки, "ДФ='HH:mm dd.MM.yyyy'"));
				КонецЕсли;
			КонецЕсли;
			Элементы.ДекорацияОписание.Подсказка = Элементы.ДекорацияОписание.Заголовок;
			Элементы.ДекорацияСостояния.Видимость = Истина;

		ИначеЕсли Состояние = Перечисления.СостоянияОбработкиОбъектов.Завершена Тогда

			Если Элементы.Найти("ДействияПерезапуститьОбработку") <> Неопределено Тогда
				Элементы.ДействияПерезапуститьОбработку.Видимость = Истина;
			КонецЕсли;	

			Если Элементы.Найти("ДействияОтправить") <> Неопределено Тогда
				Элементы.ДействияОтправить.Видимость = Ложь;
			КонецЕсли;
			#Вставка
			//++dar 26.11.25 (296038)
			Если Элементы.Найти("УВМ_ДействияОтправить") <> Неопределено Тогда
				Элементы.УВМ_ДействияОтправить.Видимость = Ложь;
			КонецЕсли;
			//--dar 26.11.25 (296038)
			#КонецВставки

			Если Элементы.Найти("ВыполнитьДействие") <> Неопределено Тогда
				Элементы.ВыполнитьДействие.Видимость = Ложь;
			КонецЕсли;

			Элементы.ДекорацияСостояния.Картинка = БиблиотекаКартинок.ЗеленаяГалочка;
			Элементы.ДекорацияОписание.Заголовок = СтрШаблон(НСтр("ru = 'Обработка завершена  %1'"),
			Формат(ДатаИзмененияСостоянияОбработки, "ДФ='dd.MM.yyyy HH:mm'"));
			Элементы.ДекорацияОписание.Подсказка = Элементы.ДекорацияОписание.Заголовок;
			Элементы.ДекорацияСостояния.Видимость = Истина;

		КонецЕсли;
		Если Элементы.Найти("ДействияОтправить") <> Неопределено Тогда
			Элементы.ДействияОтправить.Доступность = Не Форма.ТолькоПросмотр;
		КонецЕсли;
		#Вставка
		//++dar 26.11.25 (296038)
		Если Элементы.Найти("УВМ_ДействияОтправить") <> Неопределено Тогда
			Элементы.УВМ_ДействияОтправить.Доступность = Не Форма.ТолькоПросмотр;
		КонецЕсли;
		//--dar 26.11.25 (296038)
		#КонецВставки
		Если Элементы.Найти("ДействияОстановить") <> Неопределено Тогда
			Элементы.ДействияОстановить.Доступность = Не Форма.ТолькоПросмотр;
		КонецЕсли;
		#Вставка
		//++dar 26.11.25 (296038)
		Если Элементы.Найти("УВМ_ДействияОстановить") <> Неопределено Тогда
			Элементы.УВМ_ДействияОстановить.Доступность = Не Форма.ТолькоПросмотр;
		КонецЕсли;
		//--dar 26.11.25 (296038)
		#КонецВставки

		Если Не Параметры.НужнаИсторияОбработки Тогда	
			УстановитьВидимостьКомандУправленияОбработкой(
			ОбъектОбработки,
			Элементы,
			Параметры.ПараметрыВидаОбъекта,
			Форма.СостояниеОбработки);
		КонецЕсли;
	КонецЕсли;

	Если Параметры.ЕстьРодительскийКомплексныйПроцесс Тогда
		Форма.КомплексныйПроцессПоПредмету = Параметры.КППоПредмету;
		Форма.ЕстьПравоИзмененияПроцессаПоПредмету = Параметры.ЕстьПравоИзмененияПроцессаПоПредмету;
	КонецЕсли;

	ГруппаИнформацияОПрерыванииОбработки = Элементы.Найти("ГруппаИнформацияОПрерыванииОбработки");
	Если ГруппаИнформацияОПрерыванииОбработки <> Неопределено Тогда
		Элементы.ГруппаИнформацияОПрерыванииОбработки.Видимость = Ложь;
		Элементы.ГруппаПрервалОбработку.Видимость = Ложь;
		Если Состояние <> Перечисления.СостоянияОбработкиОбъектов.Выполняется 
			И Состояние <> Перечисления.СостоянияОбработкиОбъектов.Завершена
			И Состояние <> Перечисления.СостоянияОбработкиОбъектов.Остановлена Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Обработки.Ссылка КАК Ссылка,
			|	Обработки.ПричинаПрерывания КАК ПричинаПрерывания,
			|	Обработки.ДатаОкончания КАК ДатаОкончания,
			|	Обработки.Прервал КАК Прервал,
			|	ПРЕДСТАВЛЕНИЕ(Обработки.Прервал) КАК ПрервалПредставление,
			|	Обработки.Состояние
			|ПОМЕСТИТЬ ВТ_Обработки
			|ИЗ
			|	Справочник.ОбработкиОбъектов КАК Обработки
			|ГДЕ
			|	Обработки.Владелец = &Документ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Обработки.ДатаНачала УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Обработки.Ссылка,
			|	ВТ_Обработки.ПричинаПрерывания,
			|	ВТ_Обработки.ДатаОкончания,
			|	ВТ_Обработки.Прервал,
			|	ВТ_Обработки.ПрервалПредставление
			|ИЗ
			|	ВТ_Обработки КАК ВТ_Обработки
			|ГДЕ
			|	ВТ_Обработки.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОбработкиОбъектов.Прервана)";

			Запрос.УстановитьПараметр("Документ", ОбъектОбработки);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Элементы.ГруппаИнформацияОПрерыванииОбработки.Видимость = Истина;
				Элементы.ДействияНадписьПричинаПрерыванияОбработки.АвтомаксимальнаяШирина = Ложь;
				ЖирныйШрифт = ШрифтыСтиля.ВажнаяНадписьШрифт;
				МассивСтрок = Новый Массив;
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.ПрерватьОбработку));
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр(
				"ru = ' Обработка прервана:'"), ЖирныйШрифт));
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Символы.НПП));
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Формат(Выборка.ДатаОкончания,
				"ДФ='dd.MM.yyyy HH:mm'")));
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
				Если ЗначениеЗаполнено(Выборка.ПричинаПрерывания) Тогда
					МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = ' Причина:'"), ЖирныйШрифт));
					МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Символы.НПП));
					МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Выборка.ПричинаПрерывания));
					МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
				КонецЕсли;
				Элементы.ДействияНадписьПричинаПрерыванияОбработки.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
				Если ЗначениеЗаполнено(Выборка.Прервал) Тогда
					Элементы.ГруппаПрервалОбработку.Видимость = Истина;
					Форма.ПрервалРасшифровка = Выборка.Прервал;
					МассивСтрок = Новый Массив;
					МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = ' Прервал:'"), ЖирныйШрифт));
					МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Символы.НПП));
					Элементы.ДействияНадписьПрервал.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
					Элементы.РасшифроватьПрервавшегоОбработку.Заголовок = Выборка.ПрервалПредставление;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
