
#Область ОбработчикиСобытийФормы

&НаКлиенте
&Перед("ПриОткрытии")
Процедура АБ_ПриОткрытии(Отказ)
	//++dar 01.11.25 (291067)	
	ВидПросмотра = ПредопределенноеЗначение(
		"Перечисление.ВидыПросмотраСпискаОбъектов.ПоВидамДокументов");
	ВидПросмотраПриИзменении();
	//--dar 01.11.25 (291067)
КонецПроцедуры

&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//++dar 11.03.26 (309302)
	УВМ_РеквизитыФайлов = Новый Структура;
	УВМ_РеквизитыФайлов.Вставить("УВМ_ЯвляетсяКопией", УВМ_РаботаСФормами.ОписаниеТипаБулево());
	УВМ_РаботаСФормами.СоздатьРеквизитыТаблицы(ЭтотОбъект, "Файлы", УВМ_РеквизитыФайлов);                                                                            
	
	СвойстваЯвляетсяКопией = Новый Структура;
	СвойстваЯвляетсяКопией.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	СвойстваЯвляетсяКопией.Вставить("КартинкаШапки", БиблиотекаКартинок.СкопироватьВБуферОбмена);
	СвойстваЯвляетсяКопией.Вставить("Подсказка", "Копия");
	СвойстваЯвляетсяКопией.Вставить("ТолькоПросмотр", Истина);
	
	УВМ_РаботаСФормами.НоваяКолонкаТаблицыФормы(ЭтотОбъект, "УВМ_ЯвляетсяКопией", Элементы.ФайлыДокумента, "Файлы.УВМ_ЯвляетсяКопией", 2, "Копия", 
													Истина, Истина, СвойстваЯвляетсяКопией, , Элементы.Оригинал);
	//--dar 11.03.26 (309302)

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
&ИзменениеИКонтроль("СоздатьНовыйДокумент")
Процедура АБ_СоздатьНовыйДокумент(Копирование, ПараметрыФормы)

	Если Копирование Тогда

		ТекущиеДанные = РаботаСоСпискамиДокументовКлиент.ПолучитьДанныеТекущейСтрокиСписка(
		Элементы.Список, Элементы.Список.ТекущаяСтрока);

		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначениеКопирования", ТекущиеДанные.Ссылка);
			Открытьформу("Справочник.ДокументыПредприятия.ФормаОбъекта", ПараметрыФормы,
			Элементы.Список, Новый УникальныйИдентификатор);
		КонецЕсли;

	Иначе

		Если ЕстьДоступныеШаблоныДокументов Тогда
			ДополнительныеПараметры = Новый Структура;
			#Удаление
			Если ДоступныеВидыДокументов.Количество() > 0 Тогда
				ДополнительныеПараметры.Вставить("ДоступныеВидыДокументов", ДоступныеВидыДокументов);
			КонецЕсли;
			#КонецУдаления
			#Вставка
			//++dar 01.11.25 (290658)
			Если ВидПросмотра = ПредопределенноеЗначение("Перечисление.ВидыПросмотраСпискаОбъектов.ПоВидамДокументов")
				И Элементы.СтраницаВидыДокументов.Видимость Тогда
				Если НЕ ЗначениеЗаполнено(ТекущийВидДокумента) ИЛИ ЭтоГруппаВидДокумента(ТекущийВидДокумента) Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Выберите вид документа",));
					Возврат;
				Иначе
					УВМ_ДоступныеВидыДокументов = Новый СписокЗначений;
					УВМ_ДоступныеВидыДокументов.ЗагрузитьЗначения(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущийВидДокумента));
					ДополнительныеПараметры.Вставить("ДоступныеВидыДокументов", УВМ_ДоступныеВидыДокументов);
				КонецЕсли;
			Иначе
				Если ДоступныеВидыДокументов.Количество() > 0 Тогда
					ДополнительныеПараметры.Вставить("ДоступныеВидыДокументов", ДоступныеВидыДокументов);
				КонецЕсли;
			КонецЕсли;
			//--dar 01.11.25 (290658)
			#КонецВставки
			Если ЭтоРежимОбращенияГраждан Тогда
				ДополнительныеПараметры.Вставить("СозданиеОбращенияГраждан", Истина);
			КонецЕсли;
			ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьНовыйДокументПродолжение",
			ЭтотОбъект, ПараметрыФормы);
			РаботаСШаблонамиДокументовКлиент.ПоказатьФормуСозданияДокументаПоШаблону(
			ОписаниеОповещения, "ШаблоныДокументов", ДополнительныеПараметры);
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			ДелопроизводствоКлиентСервер.Текст_НетШаблоновИлиДоступаКНим());
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

//++dar 01.11.25 (290658)
&НаСервере
Функция ЭтоГруппаВидДокумента(УВМ_ВидДокумента)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УВМ_ВидДокумента, "ЭтоГруппа");
КонецФункции
//--dar 01.11.25 (290658)

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
&ИзменениеИКонтроль("ОбзорHTMLПриНажатии")
Процедура АБ_ОбзорHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		Возврат;
	КонецЕсли;

	Если СтрНайти(ДанныеСобытия.Href, "goods") > 0 Тогда
		ПараметрыОткрытия = Новый Структура("Ключ, ОткрытьЗакладкуТовары", ТекущийДокумент, Истина);
		ОткрытьФорму("Справочник.ДокументыПредприятия.ФормаОбъекта", ПараметрыОткрытия);
		Возврат;

	ИначеЕсли СтрНайти(ДанныеСобытия.Href, "ShowLinks") > 0 Тогда

		ОбзорСпискаДокументовКлиент.ПоказатьСвязи(ДанныеСобытия.Href);

		Возврат;

	ИначеЕсли СтрНайти(ДанныеСобытия.Href, "ShowInReplyTo") > 0 Тогда

		РаботаС_HTMLКлиент.ОткрытьСсылку(Элемент, ДанныеСобытия, СтандартнаяОбработка, ЭтотОбъект);
		Возврат;
	#Вставка
	//+++ Миляев (295800) 2026-01-23
	ИначеЕсли СтрНачинаетсяС(ДанныеСобытия.Href, "http") или СтрНачинаетсяС(ДанныеСобытия.Href,"e1c://server/") Тогда
		РаботаС_HTMLКлиент.ОткрытьСсылку(Элемент, ДанныеСобытия, СтандартнаяОбработка, ЭтотОбъект);
		Возврат;
	//--- Миляев (295800) 2026-01-23
	#КонецВставки
	ИначеЕсли Лев(ДанныеСобытия.Href, 6) <> "v8doc:" Тогда
		Возврат;
	КонецЕсли;

	НавигационнаяСсылкаПоля = Сред(ДанныеСобытия.Href, 7);
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаПоля);

КонецПроцедуры

#КонецОбласти
