&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	// +++ Миляев (293293) 2026-01-30
	ГруппаПодменю = УВМ_РаботаСФормами.НоваяГруппа(ЭтаФорма,"АБ_КП_Сервис",Элементы.ГруппаКоманднаяПанель
		,Новый Структура("Вид, Заголовок, ВажностьПриОтображении",ВидГруппыФормы.Подменю,"Сервис",ВажностьПриОтображении.ОченьНизкая));
	УВМ_РаботаСФормами.НоваяКоманда(ЭтаФорма, "АБ_СохранитьСкриптыВФайл", "Сохранить скрипты в файл", "АБ_СохранитьСкриптыВФайл");
	УВМ_РаботаСФормами.НоваяКнопка(ЭтаФорма , "АБ_СохранитьСкриптыВФайл", ГруппаПодменю, "Сохранить скрипты в файл", "АБ_СохранитьСкриптыВФайл");
	УВМ_РаботаСФормами.НоваяКоманда(ЭтаФорма, "АБ_ЗагрузитьСкриптыИзФайла", "Загрузить скрипты из файла", "АБ_ЗагрузитьСкриптыИзФайла");
	УВМ_РаботаСФормами.НоваяКнопка(ЭтаФорма , "АБ_ЗагрузитьСкриптыИзФайла", ГруппаПодменю, "Загрузить скрипты из файла", "АБ_ЗагрузитьСкриптыИзФайла");
	// --- Миляев (293293) 2026-01-30
КонецПроцедуры

// +++ Миляев (293293) 2026-01-30
&НаКлиенте
Асинх Процедура АБ_СохранитьСкриптыВФайл(Команда) Экспорт	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.ПолноеИмяФайла = СтрШаблон("script%1.xml",Формат(ТекущаяДата(),"ДФ=yyyy_MM_dd"));
	Диалог.Фильтр = "xml (*.xml)|*.xml";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Сохранение файла скриптов";	
	Результат = Ждать Диалог.ВыбратьАсинх();
	Если ЗначениеЗаполнено(Результат) и Результат.Количество()>0 тогда
		ПутьКФайлу = Результат[0];
		АдресФайлаДляСохранения = ПолучитьАдресФайлаСкриптовНаСервере();
		ПолучитьИзВременногоХранилища(АдресФайлаДляСохранения).Записать(ПутьКФайлу);
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Асинх Процедура АБ_ЗагрузитьСкриптыИзФайла(Команда) Экспорт	
	Если СписокСкриптов.Количество()>0 тогда
		Ответ = Ждать ВопросАсинх("Очистить таблицу скриптов?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да тогда
			СписокСкриптов.Очистить();
		КонецЕсли;	
	КонецЕсли;	
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "xml (*.xml)|*.xml";
	Результат = Ждать Диалог.ВыбратьАсинх();
	Если ЗначениеЗаполнено(Результат) и Результат.Количество()>0 тогда
		ПутьКФайлу = Результат[0];
		АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));
		ОбработатьФайлСкриптовНаСервере(АдресВХ);
	КонецЕсли;	
КонецПроцедуры	                                                 

&НаСервере
Процедура ОбработатьФайлСкриптовНаСервере(АдресВХ)
	ДанныеФайл = ПолучитьИзВременногоХранилища(АдресВХ);
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	ДанныеФайл.Записать(ИмяФайла);
	
	лЧтениеXML = Новый ЧтениеXML;
	лЧтениеXML.ОткрытьФайл(ИмяФайла);
	РезультатЧтения = СериализаторXDTO.ПрочитатьXML(лЧтениеXML);
	
	Для Каждого ЗаписьЧтения из РезультатЧтения цикл
		ЗаполнитьЗначенияСвойств(СписокСкриптов.Добавить(),ЗаписьЧтения);
	КонецЦикла;
	лЧтениеXML.Закрыть();		
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресФайлаСкриптовНаСервере()
	ТаблицаДляВыгрузки = СписокСкриптов.Выгрузить();
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("xml");
	лXML = Новый ЗаписьXML;
	лXML.ОткрытьФайл(ПутьКФайлу);
	
	лСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	лСериализаторXDTO.ЗаписатьXML(лXML,ТаблицаДляВыгрузки);
	лXML.Закрыть();
	
	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу),ЭтаФорма.УникальныйИдентификатор);
КонецФункции
// --- Миляев (293293) 2026-01-30 