#Область ПрограммныйИнтерфейс

// Определяет состав реквизитов для 
// 
// Параметры:
//  ТипДокумента - ПеречислениеСсылка.ТипыДокументовРаспознаваниеДокументов
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить сопоставление реквизитов и свойств JSON:
// * ИмяРеквизита - Строка - Так реквизит будет назван в РаспознанныйДокумент.РеквизитыДокумента.ИмяРеквизита
// * ОписаниеТипа - ОписаниеТипов - Тип реквизита, определяет тип РаспознанныйДокумент.РеквизитыДокумента.Значение
// * Адрес - Строка - для v1 показывает откуда из старого формата взять значение
// * НеОтображать - Булево - где-то используется
// * НетНаПечатнойФорме - Булево - где-то используется
// * КлассСущности - Строка - для v2 для поиска среди сущностей
// * ПодклассСущности - Строка - для v2 для поиска среди сущностей
// * Путь - Строка - для v2 для поиска среди сущностей
//
Функция ПолучитьСопоставлениеРеквизитовИСвойствJSON(ТипДокумента = Неопределено) Экспорт
	
	Типы = Типы();
	
	РеквизитыДокумента = Новый ТаблицаЗначений;
	РеквизитыДокумента.Колонки.Добавить("ИмяРеквизита", Типы.ИмяРеквизита);
	РеквизитыДокумента.Колонки.Добавить("ОписаниеТипа");
	РеквизитыДокумента.Колонки.Добавить("Адрес", Типы.Строка);
	
	РеквизитыДокумента.Колонки.Добавить("НеОтображать", Типы.Булево);
	РеквизитыДокумента.Колонки.Добавить("НетНаПечатнойФорме", Типы.Булево);
	РеквизитыДокумента.Колонки.Добавить("ЭтоРеквизитТабличнойЧасти", Типы.Булево);
	
	// Новые колонки универсального формата
	РеквизитыДокумента.Колонки.Добавить("КлассСущности", Типы.Строка);
	РеквизитыДокумента.Колонки.Добавить("ПодклассСущности", Типы.Строка);
	РеквизитыДокумента.Колонки.Добавить("Путь", Типы.Строка);
		
	РеквизитыДокумента.Индексы.Добавить("КлассСущности");
	РеквизитыДокумента.Индексы.Добавить("Путь");
	
	#Область Формат_в_1
	
	Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыФормализованныхДокументов.УПД") Тогда
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "СчетФактура.Номер", "НомерДокумента", Типы.Строка);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "СчетФактура.Дата", "ДатаДокумента", Типы.Дата);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец.Наименование", "Продавец", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель.Наименование", "Покупатель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузоотправитель.Наименование", "Грузоотправитель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузополучатель.Наименование.Наименование", "Грузополучатель", Типы.Контрагент);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец.Наименование", "ПродавецОрганизация", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.ВсегоКОплате.Стоимость", "ИтогоСумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.ВсегоКОплате.СуммаНДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.ВсегоКОплате.Всего", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец.ИНН", "ИННПродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель.ИНН", "ИННПокупателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ОснованиеПередачи.Основание.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ОснованиеПередачи.Основание.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		
		// Таблица
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Номенклатура", Типы.Номенклатура);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Количество", "Количество", Типы.Количество);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмерения", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Стоимость", "Сумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Всего", "Всего", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ПредставлениеСтраны", "СтранаПроисхождения", Типы.СтраныМира);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварКод", "Артикул", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмеренияКод", "КодЕдиницыИзмерения", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтранаПроисхожденияКод", "КодСтраныПроисхождения", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Содержание", Типы.Строка);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыФормализованныхДокументов.ТОРГ12") Тогда
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ТаблицаТоварнаяНакладная.НомерДокумента", "НомерДокумента", Типы.Строка);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "ТаблицаТоварнаяНакладная.ДатаСоставления", "ДатаДокумента", Типы.Дата);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.Наименование", "Продавец", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.Наименование", "Покупатель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерИнформацияОбОрганизации.КонтейнерОрганизация.ПредставлениеОрганизации.Наименование", "Грузоотправитель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерГрузополучатель.ПредставлениеГрузополучателя.Наименование", "Грузополучатель", Типы.Контрагент);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.Наименование", "ПродавецОрганизация", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Всего по накладной.СуммаБезНДС", "ИтогоСумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Всего по накладной.СуммаНДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Всего по накладной.СуммаСНДС", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.ИНН", "ИННПродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.ИНН", "ИННПокупателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерИнформацияОбОрганизации.КонтейнерОрганизация.ПредставлениеОрганизации.ИНН", "ИННГрузоотправителя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерГрузополучатель.ПредставлениеГрузополучателя.ИНН", "ИННГрузополучателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерОснование.Основание.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерОснование.Основание.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПоставщик.ПредставлениеПоставщика.КПП", "КПППродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерПлательщик.ПредставлениеПлательщика.КПП", "КПППокупателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерИнформацияОбОрганизации.КонтейнерОрганизация.ПредставлениеОрганизации.КПП", "КППГрузоотправителя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "КонтейнерГрузополучатель.ПредставлениеГрузополучателя.КПП", "КППГрузополучателя", Типы.Строка, Истина);
		
		// Таблица
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.НаименованиеТовара", "Номенклатура", Типы.Номенклатура);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.КоличествНетто", "Количество", Типы.Количество);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.наименование", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаБезНДС", "Сумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаСНДС", "Всего", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.код", "Артикул", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.кодПоОКЕИ", "КодЕдиницыИзмерения", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.НаименованиеТовара", "Содержание", Типы.Строка);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыФормализованныхДокументов.СчетФактура") Тогда
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Номер_к.Номер", "НомерДокумента", Типы.Строка);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Номер_к.Дата", "ДатаДокумента", Типы.Дата);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец_к.ПредставлениеПоставщика", "Продавец", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель_к.ПредставлениеПокупателя", "Покупатель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузоотправитель_к.ПредставлениеГрузоотправителя", "Грузоотправитель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузополучатель_к.ПредставлениеГрузополучателя.Наименование", "Грузополучатель", Типы.Контрагент);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец_к.ПредставлениеПоставщика", "ПродавецОрганизация", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель_к.ПредставлениеПокупателя", "ПокупательОрганизация", Типы.Организация);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.НадписьВсего.Стоимость", "ИтогоСумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.НадписьВсего.СуммаНДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.НадписьВсего.Всего", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Продавец_к.ИННПоставщика", "ИННКПППродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Покупатель_к.ИННПокупателя", "ИННКПППокупателя", Типы.Строка, Истина);
		
		// Таблица
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Номенклатура", Типы.Номенклатура);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Количество", "Количество", Типы.Количество);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмерения", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Стоимость", "Сумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.Всего", "Всего", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ПредставлениеСтраны", "СтранаПроисхождения", Типы.СтраныМира);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ЕдиницаИзмеренияКод", "КодЕдиницыИзмерения", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.СтранаПроисхожденияКод", "КодСтраныПроисхождения", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица_1.Строка.ТоварНаименование", "Содержание", Типы.Строка);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыФормализованныхДокументов.АктОбОказанииУслуг") Тогда
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Номер", "НомерДокумента", Типы.Строка);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Дата", "ДатаДокумента", Типы.Дата);
		
		// КонтейнерПоставщик.ПредставлениеПоставщика
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.Наименование", "Продавец", Типы.Контрагент);
		// КонтейнерПлательщик.ПредставлениеПлательщика
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "Покупатель", Типы.Контрагент);
		
		// Нет на печатной форме
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузоотправитель", "Грузоотправитель", Типы.Контрагент, Истина, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Грузополучатель", "Грузополучатель", Типы.Контрагент, Истина, Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.Наименование", "ПродавецОрганизация", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.Итого", "ИтогоСумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.НДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Сумма.Значение", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.ИНН", "ИННПродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.ИНН", "ИННПокупателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.ВТомЧислеНДС", "СуммаВключаетНДС", Типы.Булево);
		
		// Таблица
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Наименование", "Номенклатура", Типы.Номенклатура);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Количество", "Количество", Типы.Количество);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Единиц", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Сумма", "Сумма", Типы.ДенежнаяСумма);
		
		// Нет на печатной форме
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС, , Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма, , Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаСНДС", "Всего", Типы.ДенежнаяСумма, , Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Артикул", "Артикул", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Наименование", "Содержание", Типы.Строка);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыФормализованныхДокументов.СчетНаОплату") Тогда
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Номер", "НомерДокумента", Типы.Строка);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заголовок.Дата", "ДатаДокумента", Типы.Дата);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Наименование.НаименованиеОрганизации", "Продавец", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "Покупатель", Типы.Контрагент);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.КПП.Номер", "КПППродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.КПП", "КПППокупателя", Типы.Строка, Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "СрокОплаты.Дата", "СрокОплаты", Типы.Дата);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Наименование.НаименованиеОрганизации", "ПродавецОрганизация", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.Наименование", "ПокупательОрганизация", Типы.Организация);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.Итого", "ИтогоСумма", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.НДС", "ИтогоСуммаНДС", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.Всего", "ИтогоВсего", Типы.ДенежнаяСумма);
		
		// Прочие реквизиты
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.ИНН.Номер", "ИННПродавца", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Заказчик.Реквизиты.ИНН", "ИННПокупателя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.НомерДоговора", "НомерДоговора", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Основание.Наименование.ДатаДоговора", "ДатаДоговора", Типы.Дата, Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.Наименование", "Исполнитель", Типы.Организация);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.ИНН", "ИННИсполнителя", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Исполнитель.Реквизиты.КПП", "КППИсполнителя", Типы.Строка, Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Счет.Номер", "БанковскийСчетКонтрагента", Типы.БанковскиеСчета);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Получатель.Счет.Номер", "БанковскийСчетОрганизации", Типы.БанковскиеСчета);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Банк.Наименование.НаименованиеБанка", "БанкНаименование", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Банк.СчётБанка.Номер", "БанкСчет", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "БанковскиеРеквизиты.Банк.БИК.Номер", "Банк", Типы.Банк, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Итог.ВТомЧислеНДС", "СуммаВключаетНДС", Типы.Булево);
		
		// Таблица
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Товары", "Номенклатура", Типы.Номенклатура);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Количество", "Количество", Типы.Количество);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Единицы", "ЕдиницаИзмерения", Типы.ЕдиницаИзмерения, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Цена", "Цена", Типы.ДенежнаяСумма);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Сумма", "Сумма", Типы.ДенежнаяСумма);
		
		// Нет на печатной форме
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.ПроцентСкидки", "ПроцентСкидки", Типы.ДенежнаяСумма, , Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СтавкаНДС", "СтавкаНДС", Типы.СтавкаНДС, , Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаНДС", "СуммаНДС", Типы.ДенежнаяСумма, , Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.СуммаСНДС", "Всего", Типы.ДенежнаяСумма, , Истина);
		
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Артикул", "Артикул", Типы.Строка, Истина);
		ДобавитьСоответствиеРеквизита(РеквизитыДокумента, "Таблица1.Строка.Товары", "Содержание", Типы.Строка);
		
	Иначе
		ИспользоватьНовыйФормат = Истина;
	КонецЕсли;
	#КонецОбласти
	
	Если ИспользоватьНовыйФормат = Истина Тогда
	//=====================================ЗАГОЛОВОК ДОКУМЕНТА=========================================================
	
		// "Р_0"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "НомерДокумента";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ЗаголовокДокумента";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Номер";
		
		// "Р_1"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ДатаДокумента";
		Правило.ОписаниеТипа = Типы.Дата;
		Правило.КлассСущности = "ЗаголовокДокумента";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Дата";
		
		// "Р_4"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Заголовок";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ЗаголовокДокумента";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Наименование";		
		
		//=====================================ПОСТАВЩИК=========================================================
		
		// "Р_4"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Поставщик";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_9"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ПоставщикОрганизация"; //ПродавецОрганизация
		Правило.ОписаниеТипа = Типы.Организация;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
			
		// "Р_19"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННПоставщика"; //ИННПродавца
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_44"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КПППоставщика"; //КПППродавца
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		
		// "Р_27"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанковскийСчетКонтрагента";
		Правило.ОписаниеТипа = Типы.БанковскиеСчета;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НомерСчета";
		
		// "Р_28"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанковскийСчетОрганизации";
		Правило.ОписаниеТипа = Типы.БанковскиеСчета;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НомерСчета";
		
		// "Р_29"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанкСчет";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НомерСчетаКорреспондента";
		
		// "Р_30"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Банк";
		Правило.ОписаниеТипа = Типы.Банк;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.БИК";
		
		// "Р_47"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "БанкНаименование";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Поставщик";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.БанковскийСчет.НаименованиеБанка";
		
		//=====================================ПОКУПАТЕЛЬ=========================================================
	
		// "Р_5"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Покупатель";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_10"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ПокупательОрганизация";
		Правило.ОписаниеТипа = Типы.Организация;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_20"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННПокупателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_46"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КПППокупателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Покупатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		
		//=====================================ГРУЗООТПРАВИТЕЛЬ=========================================================
	
		// "Р_6"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Грузоотправитель";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Грузоотправитель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_39"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННГрузоотправителя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузоотправитель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_40"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КППГрузоотправителя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузоотправитель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";
		
		//=====================================ГРУЗОПОЛУЧАТЕЛЬ=========================================================
			
		// "Р_7"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Грузополучатель";
		Правило.ОписаниеТипа = Типы.Контрагент;
		Правило.КлассСущности = "Грузополучатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.Наименование";
		
		// "Р_41"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИННГрузополучателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузополучатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.ИНН";
		
		// "Р_42"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "КППГрузополучателя";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "Грузополучатель";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Компания.КПП";	
		
		//=====================================ДОКУМЕНТ ОСНОВАНИЕ=========================================================
		
		// "Р_21"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "НомерДокументаОснования";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ДокументОснование";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Документ.Номер";
		
		// "Р_22"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ДатаДокументаОснования";
		Правило.ОписаниеТипа = Типы.Дата;
		Правило.КлассСущности = "ДокументОснование";
		Правило.ПодклассСущности = "Свойства";
		Правило.Путь = "Документ.Дата";
		
		//=====================================ТАБЛИЦА НОМЕНКЛАТУР=========================================================
		
		// "Р_11"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "Сумма";
		
		// "Р_12"
		Правило = РеквизитыДокумента.Добавить(); // Переопределит ПодвалИтого.Сумма
		Правило.ИмяРеквизита = "ИтогоСумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаБезНДС";
		
		// "Р_13"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоСуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаНДС";
		
		// "Р_14"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "СуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаНДС";
		
		// "Р_15"
		Правило = РеквизитыДокумента.Добавить(); // Переопределит ПодвалИтого.СуммаНДС
		Правило.ИмяРеквизита = "ИтогоСуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалСуммаНДС";
		Правило.Путь = "Сумма";
		
		// "Р_16"
		Правило = РеквизитыДокумента.Добавить(); // Переопределит ПодвалСуммаНДС.Сумма
		Правило.ИмяРеквизита = "ИтогоСуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалВТомЧислеНДС";
		Правило.Путь = "Сумма";
		
		// "Р_17"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоВсего";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаСНДС";
		
		// "Р_18"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "Сумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтого";
		Правило.Путь = "СуммаСНДС";
		
		// "Р_33"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаУменьшение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУменьшение";
		Правило.Путь = "СуммаБезНДС";
		
		// "Р_34"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаНДСУменьшение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУменьшение";
		Правило.Путь = "СуммаНДС";
		
		// "Р_35"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоВсегоУменьшение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУменьшение";
		Правило.Путь = "СуммаСНДС";
		
		// "Р_36"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаУвеличение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУвеличение";
		Правило.Путь = "СуммаБезНДС";
		
		// "Р_37"
		Правило = РеквизитыДокумента.Добавить(); 
		Правило.ИмяРеквизита = "ИтогоСуммаНДСУвеличение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУвеличение";
		Правило.Путь = "СуммаНДС";
		
		// "Р_38"
		Правило = РеквизитыДокумента.Добавить();
		Правило.ИмяРеквизита = "ИтогоВсегоУвеличение";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "ПодвалИтогоУвеличение";
		Правило.Путь = "СуммаСНДС";
		
		//=====================================СТРОКИ ТАБЛИЦЫ НОМЕНКЛАТУР==================================================
	
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "НомерИсходнойСтроки";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НомерИсходнойСтроки";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Номенклатура";
		Правило.ОписаниеТипа = Типы.Номенклатура;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеНоменклатуры";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Артикул";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "АртикулНоменклатуры";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Содержание";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеНоменклатуры";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Количество";
		Правило.ОписаниеТипа = Типы.Количество;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "Количество";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Цена";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "Цена";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Сумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "Сумма";
		
		Правило = РеквизитыДокумента.Добавить(); // Переопределит Сумма
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Сумма";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаБезНДС";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтавкаНДС";
		Правило.ОписаниеТипа = Типы.СтавкаНДС;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СтавкаНДС";
		
		Правило = РеквизитыДокумента.Добавить(); // Переопределит СтавкаНДС
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтавкаНДС";
		Правило.ОписаниеТипа = Типы.СтавкаНДС;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СтавкаНДСТип";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СуммаНДС";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаНДС";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "Всего";
		Правило.ОписаниеТипа = Типы.ДенежнаяСумма;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "СуммаСНДС";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "ЕдиницаИзмерения";
		Правило.ОписаниеТипа = Типы.ЕдиницаИзмерения;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеЕдиницыИзмерения";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "КодЕдиницыИзмерения";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "КодЕдиницыИзмерения";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "СтранаПроисхождения";
		Правило.ОписаниеТипа = Типы.СтраныМира;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "НаименованиеСтраныПроисхождения";
		
		Правило = РеквизитыДокумента.Добавить();
		Правило.ЭтоРеквизитТабличнойЧасти = Истина;
		Правило.ИмяРеквизита = "КодСтраныПроисхождения";
		Правило.ОписаниеТипа = Типы.Строка;
		Правило.КлассСущности = "ТаблицаНоменклатур";
		Правило.ПодклассСущности = "Строки";
		Правило.Путь = "КодСтраныПроисхождения";
	
	КонецЕсли;
	
	Возврат РеквизитыДокумента;
	
КонецФункции

// Типы.
// 
// Возвращаемое значение:
//  Структура - Типы:
// * ИмяРеквизита - ОписаниеТипов - 
// * Строка - ОписаниеТипов - 
// * Дата - ОписаниеТипов - 
// * Булево - ОписаниеТипов - 
// * Количество - ОписаниеТипов - 
// * ДенежнаяСумма - ОписаниеТипов - 
// * Организация - ОписаниеТипов - 
// * Контрагент - ОписаниеТипов - 
// * БанковскиеСчета - ОписаниеТипов - 
// * Номенклатура - ОписаниеТипов - 
// * СтавкаНДС - ОписаниеТипов - 
// * ЕдиницаИзмерения - ОписаниеТипов - 
// * СтраныМира - ОписаниеТипов - 
// * Банк - ОписаниеТипов - 
Функция Типы() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяРеквизита", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(40)));
	
	Результат.Вставить("Строка", Новый ОписаниеТипов("Строка"));
	Результат.Вставить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Результат.Вставить("Булево", Новый ОписаниеТипов("Булево"));
	Результат.Вставить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	Результат.Вставить("ДенежнаяСумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Результат.Вставить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Вставить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Результат.Вставить("БанковскиеСчета", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
	Результат.Вставить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Вставить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	Результат.Вставить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	Результат.Вставить("СтраныМира", Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
	Результат.Вставить("Банк", Новый ОписаниеТипов("СправочникСсылка.КлассификаторБанков"));
	
	Возврат Результат;
	
КонецФункции

// Помощник добавления соответствий для См. РаспознаваниеДокументовПереопределяемый.ПриСопоставленииРеквизитовДокумента
// 
// Параметры:
//   ОбработанныеРеквизиты - ТаблицаЗначений
//   ИмяАтрибутаJSON - Строка
//   ИмяРеквизита - Строка
//   ОписаниеТипа - ОписаниеТипов
//   НеОтображать - Булево
//   НетНаПечатнойФорме - Булево
//
Процедура ДобавитьСоответствиеРеквизита(ОбработанныеРеквизиты, ИмяАтрибутаJSON, ИмяРеквизита, ОписаниеТипа, НеОтображать = Ложь, НетНаПечатнойФорме = Ложь) Экспорт
	
	СвойстваРеквизита = ОбработанныеРеквизиты.Добавить();
	СвойстваРеквизита.Адрес = ИмяАтрибутаJSON;
	СвойстваРеквизита.ИмяРеквизита = ИмяРеквизита;
	СвойстваРеквизита.ОписаниеТипа = ОписаниеТипа;
	СвойстваРеквизита.НеОтображать = НеОтображать;
	СвойстваРеквизита.НетНаПечатнойФорме = НетНаПечатнойФорме;
	СвойстваРеквизита.ЭтоРеквизитТабличнойЧасти = (СтрНайти(СвойстваРеквизита.Адрес, ".Строка.") > 0);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СброситьПризнакВерификацииПриНеобходимости(ДокументСсылка, ИмяРеквизита, УстановленноеЗначение, 
				ТабличнаяЧасть = Неопределено, НомерСтроки = Неопределено, Выполнено = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВерификации = Новый Структура("Проверен, УстановленноеЗначение", Истина, УстановленноеЗначение);
	
	Если ТабличнаяЧасть = Неопределено Тогда
		
		Если РегистрыСведений.ВерификацияРеквизитовРаспознанныхДокументов.НеобходимаПроверкаРеквизита(ДокументСсылка, 
			ИмяРеквизита) Тогда
				Выполнено = Истина;
				РегистрыСведений.ВерификацияРеквизитовРаспознанныхДокументов.
					УстановитьСтатусПроверкиРеквизита(ДокументСсылка, ИмяРеквизита, ПараметрыВерификации);
					
		КонецЕсли;
		
	Иначе
		
		Если  РегистрыСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов.НеобходимаПроверкаРеквизита(ДокументСсылка, 
			ИмяРеквизита, ТабличнаяЧасть, НомерСтроки) Тогда
				
				РегистрыСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов.
					УстановитьСтатусПроверкиРеквизита(ДокументСсылка, ИмяРеквизита, ТабличнаяЧасть, НомерСтроки,
						ПараметрыВерификации);
						
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановкаВерификацииПриЗаписиДокумента(ДокументСсылка, ВерифицируемыеРеквизиты, Отказ) Экспорт
	
	Если Пользователи.РолиДоступны("ПроверкаРаспознанныхДокументов") = Ложь Тогда
		Возврат;	
	КонецЕсли;  
	
	КоличествоНеПроверенных = 0;
	
	Для Каждого Стр Из 	ВерифицируемыеРеквизиты Цикл
		
		Если Стр.Проверен = Ложь и Стр.ИмяРеквизита <> РаспознаваниеДокументов.ИмяРеквизитаВсе() Тогда
			КоличествоНеПроверенных = КоличествоНеПроверенных + 1;
			Продолжить;
		КонецЕсли; 
		
		Если ПустаяСтрока(Стр.ТабличнаяЧасть) Тогда
			
			ПараметрыВерификации = Новый Структура;  
			ПараметрыВерификации.Вставить("Проверен", Истина);
			ПараметрыВерификации.Вставить("УстановленноеЗначение", Стр.ТекущееЗначение);
			
			РегистрыСведений.ВерификацияРеквизитовРаспознанныхДокументов.
					УстановитьСтатусПроверкиРеквизита(ДокументСсылка, Стр.ИмяРеквизита, ПараметрыВерификации);			
			
		Иначе 
					
			ПараметрыВерификации = Новый Структура;  
			ПараметрыВерификации.Вставить("Проверен", Истина);
			ПараметрыВерификации.Вставить("УстановленноеЗначение", Стр.ТекущееЗначение);
			
			РегистрыСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов.
					УстановитьСтатусПроверкиРеквизита(ДокументСсылка, Стр.ИмяРеквизита, Стр.ТабличнаяЧасть, 
						Стр.НомерСтрокиТЧ, ПараметрыВерификации);	
						
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоНеПроверенных = 0 Тогда
		Делопроизводство.ЗаписатьДанныеДокумента(ДокументСсылка, "ТребуетПроверки", Ложь); 	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВерифицируемыеРеквизитыПриОткрытииФормыДокумента(ДокументСсылка, ВерифицируемыеРеквизиты) Экспорт
	
	ТаблицаРеквизитовДляПроверки = 
		РегистрыСведений.ВерификацияРеквизитовРаспознанныхДокументов.РеквизитыТребующиеПроверки(ДокументСсылка);
	ТаблицаРеквизитовТЧДляПроверки = 
		РегистрыСведений.ВерификацияРеквизитовТЧРаспознанныхДокументов.РеквизитыТребующиеПроверки(ДокументСсылка);
		
	Если ТаблицаРеквизитовДляПроверки.Количество() > 0 или ТаблицаРеквизитовТЧДляПроверки.Количество() > 0 Тогда
		ЗаполнитьТаблицуПроверяемыхРеквизитов(ТаблицаРеквизитовДляПроверки, ТаблицаРеквизитовТЧДляПроверки, ВерифицируемыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриФормированииДанныхТабличныхЧастей(ТипДокумента, ИмяТаблицы, АдресJSON, ДанныеСтрок) Экспорт
	
	Если ТипДокумента = Перечисления.ТипыФормализованныхДокументов.ТОРГ12 И ИмяТаблицы = "ТаблицаТоварнаяНакладная" Тогда
		АдресJSON = ИмяТаблицы + ".";
		ИмяТаблицы = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВариантыНайденныеПоискомПоНесколькимРеквизитам(ДанныеРеквизитов, СоздаватьЕслиНеНайден = Ложь) Экспорт
	
	РеквизитыДокумента = ДанныеРеквизитов.ТаблицаРеквизитов;
	РеквизитыТабличныхЧастей = ДанныеРеквизитов.ТаблицаРеквизитовТЧ;
	
	ОбъединяемыеРеквизиты = Новый Массив;
	ОбъединяемыеРеквизиты.Добавить("Наименование");
	ОбъединяемыеРеквизиты.Добавить("НаименованиеПолное");
	ПараметрыОбъединенияРеквизитов = Новый Структура("Наименование", ОбъединяемыеРеквизиты);
	
	// Поставщик
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("Поставщик", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННПоставщика", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = РеквизитыДокумента.Найти("КПППоставщика", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов,
			Отбор
		);
		
		Если Кандидаты.Количество() = 0 И СоздаватьЕслиНеНайден И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда

			СоздатьКонтрагентаПоИННИДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
				
		КонецЕсли;
	
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "Поставщик", Кандидаты);
		
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов
		);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "ПоставщикОрганизация", Кандидаты);
		
	КонецЕсли;

	// Продавец
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("Продавец", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННПродавца", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = РеквизитыДокумента.Найти("КПППродавца", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов,
			Отбор
		);
		
		Если Кандидаты.Количество() = 0 И СоздаватьЕслиНеНайден И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда

			СоздатьКонтрагентаПоИННИДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
				
		КонецЕсли;
	
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "Продавец", Кандидаты);
		
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаКонтрагентОрганизация,
			Тип,
			ПараметрыОбъединенияРеквизитов
		);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "ПродавецОрганизация", Кандидаты);
		
	КонецЕсли;
	
	// Покупатель
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("Покупатель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННПокупателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = РеквизитыДокумента.Найти("КПППокупателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
			
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		
		Если Отбор.Количество() > 0 Тогда
			
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			Если Кандидаты.Количество() = 0 И СоздаватьЕслиНеНайден И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда

				СоздатьКонтрагентаПоИННИДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
					
			КонецЕсли;
			
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "Покупатель", Кандидаты);
			
		КонецЕсли;
			
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "ПокупательОрганизация", Кандидаты);
		КонецЕсли;
		
	КонецЕсли;
	
	// Грузополучатель
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("Грузополучатель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;

	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННКППГрузополучателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		ДобавитьИННКПП(РеквизитыПоискаКонтрагентОрганизация, НайденнаяСтрока.РаспознанныйТекст);
	КонецЕсли;
	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННГрузополучателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = РеквизитыДокумента.Найти("КППГрузополучателя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			Если Кандидаты.Количество() = 0 И СоздаватьЕслиНеНайден И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда

				СоздатьКонтрагентаПоИННИДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
					
			КонецЕсли;
				
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "Грузополучатель", Кандидаты);
		КонецЕсли;
		
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "ГрузополучательОрганизация", Кандидаты);
		КонецЕсли;
	КонецЕсли;
	
	// Грузоотправитель
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("Грузоотправитель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	
	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННГрузоотправителя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = РеквизитыДокумента.Найти("КППГрузоотправителя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			Если Кандидаты.Количество() = 0 И СоздаватьЕслиНеНайден И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда

				СоздатьКонтрагентаПоИННИДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
					
			КонецЕсли;
				
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "Грузоотправитель", Кандидаты);
		КонецЕсли;
		
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "ГрузоотправительОрганизация", Кандидаты);
		КонецЕсли;
	КонецЕсли;
	
	РеквизитыПоискаКонтрагентОрганизация = Новый Структура();
	НайденнаяСтрока = РеквизитыДокумента.Найти("Исполнитель", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		Наименование = УбратьОрганизационнуюФорму(НайденнаяСтрока.РаспознанныйТекст);
		РеквизитыПоискаКонтрагентОрганизация.Вставить("Наименование", Наименование);
	КонецЕсли;
	НайденнаяСтрока = РеквизитыДокумента.Найти("ИННИсполнителя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("ИНН", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	НайденнаяСтрока = РеквизитыДокумента.Найти("КППИсполнителя", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаКонтрагентОрганизация.Вставить("КПП", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	Если РеквизитыПоискаКонтрагентОрганизация.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
				
			Если Кандидаты.Количество() = 0 И СоздаватьЕслиНеНайден И РеквизитыПоискаКонтрагентОрганизация.Свойство("ИНН") Тогда

				СоздатьКонтрагентаПоИННИДобавитьВКандидаты(РеквизитыПоискаКонтрагентОрганизация, Кандидаты);
					
			КонецЕсли;

			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "Исполнитель", Кандидаты);
		КонецЕсли;
		Тип = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Отбор = ОтборПоРеквизитам(РеквизитыПоискаКонтрагентОрганизация, Тип);
		Если Отбор.Количество() > 0 Тогда
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаКонтрагентОрганизация,
				Тип,
				ПараметрыОбъединенияРеквизитов,
				Отбор);
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "ИсполнительОрганизацияИсполнитель", Кандидаты);
		КонецЕсли;	
	КонецЕсли;
	
	// Банк
	РеквизитыПоискаБанк = Новый Структура();
	НайденнаяСтрока = РеквизитыДокумента.Найти("Банк", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаБанк.Вставить("Код", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	Если РеквизитыПоискаБанк.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.КлассификаторБанков.ПустаяСсылка");
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаБанк,
			Тип);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "Банк", Кандидаты);
	КонецЕсли;
	
	// Банковский счет
	РеквизитыПоискаБанковскийСчет = Новый Структура();
	НайденнаяСтрока = РеквизитыДокумента.Найти("БанковскийСчетКонтрагента", "ИмяРеквизита");
	Если НЕ НайденнаяСтрока = Неопределено И НЕ ПустаяСтрока(НайденнаяСтрока.РаспознанныйТекст) Тогда
		РеквизитыПоискаБанковскийСчет.Вставить("Наименование", ИзвлечьЦифрыИзСтроки(НайденнаяСтрока.РаспознанныйТекст));
	КонецЕсли;
	Если РеквизитыПоискаБанковскийСчет.Количество() Тогда
		Тип = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаБанковскийСчет,
			Тип);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "БанковскийСчетКонтрагента", Кандидаты);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "БанковскийСчетОрганизации", Кандидаты);
	КонецЕсли;
	
	//////////////////////////////
	// Табличная часть
	/////////////////////////////
	
	// Номенклатура
	НайденныеСтроки = РеквизитыТабличныхЧастей.НайтиСтроки(Новый Структура("ИмяРеквизита", "Номенклатура"));
	
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		
		// Номенклатура
		
		РеквизитыПоискаНоменклатура = Новый Структура();
		РеквизитыПоискаНоменклатура.Вставить("Наименование", СтрокаТаблицы.РаспознанныйТекст);
		
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "Артикул", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			Артикул = ИзвлечьАртикулИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			Если Не ПустаяСтрока(Артикул) Тогда
				РеквизитыПоискаНоменклатура.Вставить("Артикул", Артикул);
			КонецЕсли;
		КонецЕсли;
		
		Тип = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		Кандидаты = ПолучитьКандидатов(
			РеквизитыПоискаНоменклатура,
			Тип,
			ПараметрыОбъединенияРеквизитов);
		ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "Номенклатура", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		
		// СтранаПроисхождения
		
		РеквизитыПоискаСтранаПроисхождения = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "СтранаПроисхождения", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаСтранаПроисхождения.Вставить("Наименование", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Отбор.ИмяРеквизита = "КодСтраныПроисхождения";
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			Код = ИзвлечьЦифрыИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			Если Не ПустаяСтрока(Код) Тогда
				РеквизитыПоискаСтранаПроисхождения.Вставить("Код", Код);
			КонецЕсли;
		КонецЕсли;
		Если РеквизитыПоискаСтранаПроисхождения.Количество() Тогда
			Тип = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка");
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаСтранаПроисхождения,
				Тип,
				ПараметрыОбъединенияРеквизитов);
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "СтранаПроисхождения", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		КонецЕсли;
		
		// ЕдиницаИзмерения
		
		РеквизитыПоискаЕдиницаИзмерения = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "ЕдиницаИзмерения", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаЕдиницаИзмерения.Вставить("Наименование", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Отбор.ИмяРеквизита = "КодЕдиницыИзмерения";
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 Тогда
			Код = ИзвлечьЦифрыИзСтроки(НайденнаяСтрока[0].РаспознанныйТекст);
			Если Не ПустаяСтрока(Код) Тогда
				РеквизитыПоискаЕдиницаИзмерения.Вставить("Код", Код);
			КонецЕсли;
		КонецЕсли;
		Если РеквизитыПоискаЕдиницаИзмерения.Количество() Тогда
			Тип = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка");
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаЕдиницаИзмерения,
				Тип,
				ПараметрыОбъединенияРеквизитов);
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "ЕдиницаИзмерения", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		КонецЕсли;
		
		// СтавкаНДС
		
		РеквизитыПоискаСтавкаНДС = Новый Структура();
		Отбор = Новый Структура("ИмяРеквизита, НомерСтрокиТЧ", "СтавкаНДС", СтрокаТаблицы.НомерСтрокиТЧ);
		НайденнаяСтрока = РеквизитыТабличныхЧастей.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() <> 0 И НЕ ПустаяСтрока(НайденнаяСтрока[0].РаспознанныйТекст) Тогда
			РеквизитыПоискаСтавкаНДС.Вставить("Представление", НайденнаяСтрока[0].РаспознанныйТекст);
		КонецЕсли;
		Если РеквизитыПоискаСтавкаНДС.Количество() Тогда
			
			Тип = ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка");
			
			Кандидаты = ПолучитьКандидатов(
				РеквизитыПоискаСтавкаНДС,
				Тип,
				ПараметрыОбъединенияРеквизитов);
			ДобавитьКандидатовВСписокВыбора(ДанныеРеквизитов, "СтавкаНДС", Кандидаты, СтрокаТаблицы.НомерСтрокиТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция УбратьОрганизационнуюФорму(Знач СтрокаПоиска) Экспорт
	
	МассивЗамен = Новый Массив;
	МассивЗамен.Добавить("ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ");
	МассивЗамен.Добавить("ПУБЛИЧНОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО");
	МассивЗамен.Добавить("ОТКРЫТОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО");
	МассивЗамен.Добавить("ЗАКРЫТОЕ АКЦИОНЕРНОЕ ОБЩЕСТВО");
	МассивЗамен.Добавить("АКЦИОНЕРНОЕ ОБЩЕСТВО");
	МассивЗамен.Добавить("ИНДИВИДУАЛЬНЫЙ ПРЕДПРИНИМАТЕЛЬ");
	МассивЗамен.Добавить("ФЕДЕРАЛЬНОЕ ГОСУДАРСТВЕННОЕ УНИТАРНОЕ ПРЕДПРИЯТИЕ");
	
	СтрокаПоискаВРег = ВРег(СтрокаПоиска);
	Для Каждого СтрокаЗамены Из МассивЗамен Цикл
		ДлинаЗамены = СтрДлина(СтрокаЗамены);
		Если Лев(СтрокаПоискаВРег, ДлинаЗамены) = СтрокаЗамены Тогда
			СтрокаПоиска = СокрЛП(Сред(СтрокаПоиска, ДлинаЗамены + 1));
		КонецЕсли;
		Если Прав(СтрокаПоискаВРег, ДлинаЗамены) = СтрокаЗамены Тогда
			СтрокаПоиска = СокрЛП(Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - ДлинаЗамены));
		КонецЕсли;
	КонецЦикла;
	
	Подстрока = Лев(СтрокаПоиска, 4);
	Если Подстрока = "ООО " Или Подстрока = "ПАО " Или Подстрока = "ОАО "  Или Подстрока = "ЗАО " Тогда
		СтрокаПоиска = Сред(СтрокаПоиска, 5);
	Иначе
		Подстрока = Лев(СтрокаПоиска, 3);
		Если Подстрока = "АО " Или Подстрока = "ИП " Тогда
			СтрокаПоиска = Сред(СтрокаПоиска, 4);
		ИначеЕсли Лев(СтрокаПоиска, 5) = "ФГУП " Тогда
			СтрокаПоиска = Сред(СтрокаПоиска, 6);
		КонецЕсли;
	КонецЕсли;
	
	Подстрока = Прав(СтрокаПоиска, 4);
	Если Подстрока = " ООО" Или Подстрока = " ПАО" Или Подстрока = " ОАО"  Или Подстрока = " ЗАО" Тогда
		СтрокаПоиска = Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - 4);
	Иначе
		Подстрока = Прав(СтрокаПоиска, 3);
		Если Подстрока = " АО" Или Подстрока = " ИП" Тогда
			СтрокаПоиска = Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - 3);
		ИначеЕсли Прав(СтрокаПоиска, 5) = " ФГУП" Тогда
			СтрокаПоиска = Лев(СтрокаПоиска, СтрДлина(СтрокаПоиска) - 5);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СокрЛП(СтрокаПоиска);
	
КонецФункции

// Описание реквизита модели распознанного документа.
// Если не найден - при указании СоздаватьЕслиНеНайдено = Истина будет добавлен с пустым значением.
// 
// Параметры:
//  ТаблицаРеквизитов - ТаблицаЗначений
//  ИмяРеквизита - Строка
//  СоздаватьЕслиНеНайдено - Булево - Создавать если не найдено
// 
// Возвращаемое значение:
//  Неопределено, СтрокаТаблицыЗначений - Реквизит документа
Функция РеквизитДокумента(ТаблицаРеквизитов, ИмяРеквизита, СоздаватьЕслиНеНайдено = Истина) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяРеквизита", ИмяРеквизита);
	НайденныеСтроки = ТаблицаРеквизитов.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0];
	КонецЕсли;
	
	Если Не СоздаватьЕслиНеНайдено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция РеквизитТаблицыДокумента(ТаблицаРеквизитов, НомерСтрокиТЧ, ИмяРеквизита, СоздаватьЕслиНеНайдено = Истина) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерСтрокиТЧ", НомерСтрокиТЧ);
	Отбор.Вставить("ИмяРеквизита", ИмяРеквизита);
	НайденныеСтроки = ТаблицаРеквизитов.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0];
	КонецЕсли;
	
	Если Не СоздаватьЕслиНеНайдено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.НомерСтрокиТЧ = НомерСтрокиТЧ;
	НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция ЮрФизЛицоПоОрганизационнойФорме() Экспорт
	
	Результат = Новый Соответствие;
	РаспознаваниеДокументовПереопределяемый.ПриОпределенииЮрФизЛицаПоОрганизационнойФорме(Результат);
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

Процедура ДобавитьКандидатовВСписокВыбора(ДанныеДокумента, ИмяРеквизита, Кандидаты, НомерСтроки = Неопределено) Экспорт
	
	Если Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НомерСтроки = Неопределено Тогда
		
		НССтр = ДанныеДокумента.ТаблицаРеквизитов.Найти(ИмяРеквизита, "ИмяРеквизита");
		Если НССтр <> Неопределено Тогда
			ДанныеДокумента.СпискиКандидатов.Вставить(НССтр, Кандидаты);
		КонецЕсли;
		
	Иначе
		Отбор = Новый Структура("ТабличнаяЧасть, ИмяРеквизита, НомерСтрокиТЧ", "", ИмяРеквизита, НомерСтроки);
		НССтр = ДанныеДокумента.ТаблицаРеквизитовТЧ.НайтиСтроки(Отбор);
		Если НССтр.Количество() > 0 Тогда
			ДанныеДокумента.СпискиКандидатов.Вставить(НССтр[0], Кандидаты);
		КонецЕсли;

	КонецЕсли;
	
	
КонецПроцедуры

Функция ИзвлечьЦифрыИзСтроки(Строка) Экспорт
	
	ДоступныеСимволы = "0123456789";
	Возврат ИзвлечьСимволыИзСтроки(Строка, ДоступныеСимволы);
	
КонецФункции

Функция ИзвлечьАртикулИзСтроки(Строка) Экспорт
	
	ДоступныеСимволы = "-_./:"
		+ "0123456789"
		+ "абвгдежзиклмнопрстуфхцчшщъыьэюя"
		+ "АБВГДЕЖЗИКЛМНОПРЕСТУФХЦЧШЩЪЫЬЭЮЯ"
		+ "abcdefghijklmnopqrstuvwxwz"
		+ "ABCDEFGHIGKLMNOPQRSTUVWXYZ";
	Возврат ИзвлечьСимволыИзСтроки(Строка, ДоступныеСимволы);
	
КонецФункции

Функция ИзвлечьИННКППИзСтроки(ИННКПП, ИмяРеквизита) Экспорт
	
	НаборЗначений = СтрРазделить(ИННКПП, "/", Ложь);
	
	Если НаборЗначений.Количество() И ИмяРеквизита = "ИНН" Тогда
		Возврат ИзвлечьЦифрыИзСтроки(НаборЗначений[0]);
	ИначеЕсли НаборЗначений.Количество() > 1 И ИмяРеквизита = "КПП" Тогда
		Возврат ИзвлечьЦифрыИзСтроки(НаборЗначений[1]);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьКонтрагентаПоИННИДобавитьВКандидаты(РеквизитыПоиска, Кандидаты)
	
	ЭтоЮридическоеЛицо = Истина;
	ИНН = "";
	Если РеквизитыПоиска.Свойство("ИНН") Тогда
		ИНН = РеквизитыПоиска.ИНН;
	КонецЕсли;
	
	Если ПустаяСтрока(ИНН) Тогда 
		 Возврат;
	КонецЕсли;
	
	КПППоиска = "";
	Если РеквизитыПоиска.Свойство("КПП") Тогда
		КПППоиска = РеквизитыПоиска.КПП;
	КонецЕсли;
	
	Если СтрДлина(ИНН) = 12 Тогда
		ЭтоЮридическоеЛицо = Ложь;
	КонецЕсли;
	
	Если ЭтоЮридическоеЛицо Тогда
		СведенияОЮрлице = КонтрагентыЛокализация.СведенияОЮридическомЛицеПоИНН(ИНН);
		СведенияОКонтрагенте = СведенияОЮрлице.ЕГРЮЛ;
	Иначе
		СведенияОКонтрагенте = КонтрагентыЛокализация.РеквизитыПредпринимателяПоИНН(ИНН);
	КонецЕсли;
	
	Попытка 
		
		РеквизитыКонтрагента = Новый Структура;
		РеквизитыКонтрагента.Вставить("Наименование", СведенияОКонтрагенте.НаименованиеСокращенное);
		РеквизитыКонтрагента.Вставить("ИНН", СведенияОКонтрагенте.ИНН);
		ЗначениеКПП = "";
		
		Если КПППоиска = "" Тогда
			ЗначениеКПП = СведенияОКонтрагенте.КПП;
		КонецЕсли;
		
		РеквизитыКонтрагента.Вставить("КПП", ЗначениеКПП);
		Контрагент = Неопределено;
		КонтрагентыЛокализация.СоздатьКонтрагентаПоРеквизитам(РеквизитыКонтрагента, Контрагент);
		
		Если Контрагент <> Неопределено Тогда
			НовыйКандидат = Кандидаты.Добавить();
			НовыйКандидат.Ссылка = Контрагент;  
			НовыйКандидат.Коэффициент = 0;
			
			Если КПППоиска = "" Тогда
				НовыйКандидат.Коэффициент = 0.5;
			ИначеЕсли КПППоиска = ЗначениеКПП Тогда
				НовыйКандидат.Коэффициент = 1;
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Распознавание документов'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
					
КонецПроцедуры

Функция ОтборПоРеквизитам(РеквизитыОбъекта, ТипОбъекта)
	
	Отбор = Новый Массив;
	
	Если ТипОбъекта = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Или ТипОбъекта = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка") Тогда
		
		ДанныеСравнения = Новый Структура;
		
		Для Каждого Реквизит Из РеквизитыОбъекта Цикл
			
			Если Реквизит.Ключ = "ИНН" И Не ПустаяСтрока(Реквизит.Значение) Тогда
				ДобавитьОтбор(ДанныеСравнения, Реквизит, ВидСравнения.Равно);
			КонецЕсли;	
			
			Если ДанныеСравнения.Свойство("ИНН") И Реквизит.Ключ = "КПП" И Не ПустаяСтрока(Реквизит.Значение) Тогда
				ДобавитьОтбор(ДанныеСравнения, Реквизит.Значение, ВидСравнения.Равно);
			КонецЕсли;	
		
		КонецЦикла;
		
		Если ДанныеСравнения.Количество() > 0 Тогда
			Отбор.Добавить(ДанныеСравнения);
		КонецЕсли;	
			
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции	

Процедура ДобавитьОтбор(ДанныеСравнения, ЗначениеОтбора, ВидСравнения)
	
	ДанныеСравнения.Вставить("Свойство", ЗначениеОтбора.Ключ);
	ДанныеСравнения.Вставить("ВидСравнения", ВидСравнения);
	ДанныеСравнения.Вставить("Значение", ЗначениеОтбора.Значение);
	
КонецПроцедуры	

Функция ПолучитьКандидатов(
		ПараметрыПоиска,
		ТипСсылкой,
		ПараметрыОбъединенныхРеквизитов = Неопределено,
		Отбор = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат РаспознаваниеДокументовНечеткийПоискСлужебный.НечеткийПоиск(ТипСсылкой.Метаданные(), ПараметрыПоиска, Отбор);
	
КонецФункции

Процедура ЗаполнитьТаблицуПроверяемыхРеквизитов(ТаблицаРеквизитовДляПроверки, ТаблицаРеквизитовТЧДляПроверки, ВерифицируемыеРеквизиты)
	
	ТаблицаДляЗаполнения = ТаблицаРеквизитовТЧДляПроверки.Скопировать();
	ТаблицаДляЗаполнения.Колонки.Добавить("НаименованиеРеквизита", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаДляЗаполнения.Колонки.Добавить("ТекущееЗначение", Метаданные.ОпределяемыеТипы.РаспознаваемыеРеквизитыДокумента.Тип);
	ТаблицаДляЗаполнения.Очистить();
	
	Для Каждого Стр Из ТаблицаРеквизитовТЧДляПроверки Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ТабличнаяЧасть", Стр.ТабличнаяЧасть);
		Отбор.Вставить("НомерСтрокиТЧ", Стр.НомерСтрокиТЧ);  
		Отбор.Вставить("ИмяРеквизита", Стр.ИмяРеквизита); 
		Отбор.Вставить("Проверен", Ложь);
		
		ВР = ВерифицируемыеРеквизиты.НайтиСтроки(Отбор);
		
		Если ВР.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;  
		
		НСтр = ТаблицаДляЗаполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр); 
		ИмяТЧ = СтрЗаменить(Стр.ТабличнаяЧасть, "Объект.", "");    
		
		НСтр.НаименованиеРеквизита = Стр.ТабличнаяЧасть + " (" + Стр.НомерСтрокиТЧ + ")" + " - " + 
			Метаданные.Справочники.ДокументыПредприятия.ТабличныеЧасти[ИмяТЧ]["Реквизиты"][Стр.ИмяРеквизита]["Синоним"];
		НСтр.ТекущееЗначение = Стр.РаспознанноеЗначение;
		
	КонецЦикла;
	
	Для Каждого Стр Из ТаблицаРеквизитовДляПроверки Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИмяРеквизита", Стр.ИмяРеквизита);  
		Отбор.Вставить("ТабличнаяЧасть", ""); 
		Отбор.Вставить("Проверен", Ложь); 
		
		ВР = ВерифицируемыеРеквизиты.НайтиСтроки(Отбор);
		
		Если ВР.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;  
	
		НСтр = ТаблицаДляЗаполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр); 
		ИмяРеквизита = СтрЗаменить(Стр.ИмяРеквизита, "Объект.", "");
		
		Если Метаданные.Справочники.ДокументыПредприятия["Реквизиты"].Найти(ИмяРеквизита) <> Неопределено Тогда
			НСтр.НаименованиеРеквизита = Метаданные.Справочники.ДокументыПредприятия["Реквизиты"][ИмяРеквизита]["Синоним"];
		Иначе
			НСтр.НаименованиеРеквизита = ИмяРеквизита;
		КонецЕсли;
		
		НСтр.ТекущееЗначение = Стр.РаспознанноеЗначение;
		
	КонецЦикла;
	
	ТаблицаДляЗаполнения.Сортировать("ИмяРеквизита, ТабличнаяЧасть, НомерСтрокиТЧ");
	ВерифицируемыеРеквизиты.Загрузить(ТаблицаДляЗаполнения);
	
КонецПроцедуры

Процедура ДобавитьИННКПП(ПараметрыПоиска, ИННКПП)
	
	ПараметрыПоиска.Вставить("ИНН", ИзвлечьИННКППИзСтроки(ИННКПП, "ИНН"));
	ПараметрыПоиска.Вставить("КПП", ИзвлечьИННКППИзСтроки(ИННКПП, "КПП"));
	
КонецПроцедуры

Функция ИзвлечьСимволыИзСтроки(Строка, ДоступныеСимволы)
	
	Результат = Строка;
	Индекс = 1;
	Пока Индекс <= СтрДлина(Результат) Цикл
		ПроверяемыйСимвол = Сред(Результат, Индекс, 1);
		Если СтрНайти(ДоступныеСимволы, ПроверяемыйСимвол) = 0 Тогда
			Результат = СтрЗаменить(Результат, ПроверяемыйСимвол, "");
			Продолжить;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

#КонецОбласти