
&ИзменениеИКонтроль("ПредставлениеСотрудникаСУчетомЯзыка")
Функция АБ_ПредставлениеСотрудникаСУчетомЯзыка(Данные, СуффиксЯзыка)

	ИмяРеквизитаСПредставлением = "ПредставлениеДолжностиПодразделения" + СуффиксЯзыка;
	ИмяРеквизитаСФИО = "Наименование" + СуффиксЯзыка;

	Должность = Неопределено;
	Если Данные.Свойство("Должность") Тогда
		Должность = Данные.Должность;
	КонецЕсли;

	Подразделение = Неопределено;
	Если Данные.Свойство("Подразделение") Тогда
		Подразделение = Данные.Подразделение;
	КонецЕсли;
	
	#Удаление
	Возврат СотрудникиВызовСервера.ПредставлениеСотрудника(Данные[ИмяРеквизитаСФИО], 
	Данные[ИмяРеквизитаСПредставлением], Должность, Подразделение);
	#КонецУдаления
	#Вставка
	//++dar 28.05.26 (330597)
	Возврат СотрудникиВызовСервера.ПредставлениеСотрудника(Данные[ИмяРеквизитаСФИО], "")	
	//--dar 28.05.26 (330597)
	#КонецВставки

КонецФункции
