#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Файл уже обработан.
// 
// Параметры:
//  ИдентификаторРезультата - Строка
// 
// Возвращаемое значение:
//  Булево - Файл уже обработан
Функция РезультатУжеОбработан(ИдентификаторРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РезультатыРаспознаванияДокументов.Документ
		|ИЗ
		|	РегистрСведений.РезультатыРаспознаванияДокументов КАК РезультатыРаспознаванияДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФайлыДокументовНаРаспознавании КАК ФайлыДокументовНаРаспознавании
		|		ПО ФайлыДокументовНаРаспознавании.Файл.Владелец.ВладелецФайла = РезультатыРаспознаванияДокументов.Документ
		|ГДЕ
		|	РезультатыРаспознаванияДокументов.ИдентификаторРезультата = &ИдентификаторРезультата
		|	И ФайлыДокументовНаРаспознавании.Файл ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("ИдентификаторРезультата",ИдентификаторРезультата);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Добавить запись.
// 
// Параметры:
//  Документ - СправочникСсылка.ДокументыПредприятия
//  ИдентификаторРезультата - строка
//  ИдентификаторЗадания - строка
//  ВерсияФайлаСсылка - СправочникСсылка.ВерсииФайлов
//  Ответ - Структура
Процедура ДобавитьЗапись(Документ,ИдентификаторРезультата, ИдентификаторЗадания, ВерсияФайлаСсылка, Ответ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Документ = Документ;
	Запись.ИдентификаторЗадания = ИдентификаторЗадания;
	Запись.ИдентификаторРезультата = ИдентификаторРезультата;
	Запись.Файл = ВерсияФайлаСсылка;
	Запись.Ответ = Новый ХранилищеЗначения(Ответ);

	Запись.Записать(Истина);		
	
КонецПроцедуры
	
// Удалить запись.
// 
// Параметры:
//  Документ - СправочникСсылка.ДокументыПредприятия
Процедура УдалитьЗапись(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Получить результат по идентификатору.
// 
// Параметры:
//  ИдентификаторРезультата - Строка
// 
// Возвращаемое значение:
//  Структура:
// * Документ - СправочникСсылка.ДокументыПредприятия
// * ИдентификаторЗадания - Строка 
// * Файл - СправочникСсылка.ВерсииФайлов
// * Ответ - Структура
Функция ПолучитьРезультатПоИдентификатору(ИдентификаторРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РезультатыРаспознаванияДокументов.Документ КАК Документ,
		|	РезультатыРаспознаванияДокументов.ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	РезультатыРаспознаванияДокументов.Файл КАК Файл,
		|	РезультатыРаспознаванияДокументов.Ответ КАК Ответ
		|ИЗ
		|	РегистрСведений.РезультатыРаспознаванияДокументов КАК РезультатыРаспознаванияДокументов
		|ГДЕ
		|	РезультатыРаспознаванияДокументов.ИдентификаторРезультата = &ИдентификаторРезультата");
	
	Запрос.УстановитьПараметр("ИдентификаторРезультата",ИдентификаторРезультата);

	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураВозврата = СтруктураРезультатПоИдентификатору();
	
	Если Выборка.Следующий() Тогда 
		
		СтруктураВозврата.Ответ = Выборка.Ответ.Получить();
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка,,"Ответ");
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураРезультатПоИдентификатору()
	
	РезультатПоИдентификатору = Новый Структура;
	РезультатПоИдентификатору.Вставить("Документ");
	РезультатПоИдентификатору.Вставить("ИдентификаторЗадания");
	РезультатПоИдентификатору.Вставить("Файл");
	РезультатПоИдентификатору.Вставить("Ответ");
	Возврат РезультатПоИдентификатору;
	
КонецФункции

#КонецОбласти

#КонецЕсли